Caler10/RBCM_S32K344_AUTOSAR_MBD/Firmware/S32K344_DAPlink/S32K344_LED/S32K344_LED_ert_rtw/MW_target_hardware_resources.h
#ifndef PORTABLE_WORDSIZES
#ifdef __MW_TARGET_USE_HARDWARE_RESOURCES_H__
#ifndef __MW_TARGET_HARDWARE_RESOURCES_H__
#define __MW_TARGET_HARDWARE_RESOURCES_H__

#define MW_MULTI_TASKING_MODE 0
#include "mbdt_board_init.h"
#include "s32k3_trigger_config.h"

#define MW_USECODERTARGET 1
#define MW_TARGETHARDWARE NXP S32K3xx
#define MW_CONNECTIONINFO_SERIALINTERFACE_BAUDRATE 115200
#define MW_CONNECTIONINFO_SERIALINTERFACE_COMPORT COM1
#define MW_CONNECTIONINFO_SERIALINTERFACE_VERBOSE 0
#define MW_EXTMODE_CONFIGURATION Serial Interface
#define MW_RTOS Baremetal
#define MW_SCHEDULER_INTERRUPT_SOURCE 0
#define MW_CLOCKING_CPUCLOCKRATEMHZ 160
#define MW_REFCONFIG_LOCATION Browse for Referenced Configuration location
#define MW_REFCONFIG_BROWSE 
#define MW_HARDWARE_TYPE 10
#define MW_DEFAULT_LOC mbdtbx_s32k3/devices/S32K344-Q172/s32ds_default_project_config/S32K344-Q172.mex
#define MW_BROWSE_CONFIG 
#define MW_SAVE_CONFIG 
#define MW_OPEN_CONFIG 
#define MW_INITIALIZATION_ENABLE 0
#define MW_INITIALIZATION_LOCATION Initialization stored in model
#define MW_INITIALIZATION_BROWSE 
#define MW_INITIALIZATION_SEQUENCE 
#define MW_OPEN_BOARD_INIT 
#define MW_LINKER_ENABLE 0
#define MW_LINKER_LOCATION Browse for the linker location...
#define MW_LINKER_BROWSE 
#define MW_LINKER_OPEN 
#define MW_STARTUP_ENABLE 0
#define MW_STARTUP_LOCATION Browse for the startup code folder location...
#define MW_STARTUP_BROWSE 
#define MW_STARTUP_OPEN 
#define MW_TIMERS_STEPTIMER 1
#define MW_TIMERS_STEPGPTCHANNEL StepTimer
#define MW_TIMERS_STEPTIMERFREQ 40 MHz
#define MW_TIMERS_PROFILERTIMER 1
#define MW_TIMERS_PROFILERGPTCHANNEL ProfilerTimer
#define MW_TIMERS_PROFILERTIMERFREQ 40 MHz
#define MW_OPEN_TIMERS 
#define MW_REFRESH_TIMERS 
#define MW_DOWNLOAD_TYPE 1
#define MW_JLINK_LOCATION D:/Program Files/SEGGER/JLink/JLink.exe
#define MW_JLINK_BROWSE 
#define MW_TARGET_MEMORY -1
#define MW_CONFIGURATION_TOOL 0
#define MW_S32DS_CONFIGTOOLS_LOCATION tools/S32ConfigTools.2024.R1.7
#define MW_BROWSE_S32DSCONFIGTOOL 
#define MW_TRESOS_TOOLS_LOCATION D:/EB/tresos
#define MW_BROWSE_TRESOSTOOL 
#define MW_SDK_LOCATION S32K3_RTD/SW32K3_S32M27x_RTD_R21-11_4.0.0_P19
#define MW_MBD_BROWSESDK 
#define MW_TOOLS_S32DSLOCATION D:/AppGallery/Software/NXP/S32DS.3.5
#define MW_TOOLS_BROWSES32DS 
#define MW_S32DSPROJECT_OPEN 
#define MW_S32DSPROJECT_EXPORT 
#define MW_PIL_INTERFACE 0
#define MW_PIL_HARDWAREUART -1
#define MW_PIL_COMPORT -1
#define MW_PIL_BAUDRATE 10
#define MW_OPEN_PIL 
#define MW_UPDATE_PIL 
#define MW_EXT_HARDWAREUART -1
#define MW_EXT_COMPORT -1
#define MW_EXT_BAUDRATE 10
#define MW_OPEN_EXT 
#define MW_UPDATE_EXT 
#define MW_ADC_INFO /*
/Adc - Adc 
/Adc/AdcConfigSet - AdcConfigSet 
/Adc/AdcConfigSet/AdcHwTrigger - AdcHwTrigger_0 AdcHwTrigger_1 AdcHwTrigger_2 
/Adc/AdcConfigSet/AdcHwTrigger_0/AdcHwTrigSrc - BCTU_EMIOS_0_0 
/Adc/AdcConfigSet/AdcHwTrigger_1/AdcHwTrigSrc - BCTU_EMIOS_0_1 
/Adc/AdcConfigSet/AdcHwTrigger_2/AdcHwTrigSrc - BCTU_EMIOS_1_0 
/Adc/AdcConfigSet/AdcHwUnit - AdcHwUnit_0 AdcHwUnit_1 
/Adc/AdcConfigSet/AdcHwUnit_0//SdadcCalibAverage - 1 
/Adc/AdcConfigSet/AdcHwUnit_0//SdadcCalibSkipped - 0 
/Adc/AdcConfigSet/AdcHwUnit_0//SdadcDecimaRate - DECIMATION_RATE_120 
/Adc/AdcConfigSet/AdcHwUnit_0//SdadcFifoThreshold - 0 
/Adc/AdcConfigSet/AdcHwUnit_0//SdadcOutputSetDelay - 0 
/Adc/AdcConfigSet/AdcHwUnit_0/ADC_POT_0/AdcChannelHighLimit - 4095 
/Adc/AdcConfigSet/AdcHwUnit_0/ADC_POT_0/AdcChannelId - 34 
/Adc/AdcConfigSet/AdcHwUnit_0/ADC_POT_0/AdcChannelName - S10_ChanNum34 
/Adc/AdcConfigSet/AdcHwUnit_0/ADC_POT_0/AdcEnablePresampling - true 
/Adc/AdcConfigSet/AdcHwUnit_0/ADC_POT_0/AdcEnableThresholds - false 
/Adc/AdcConfigSet/AdcHwUnit_0/ADC_POT_0/AdcLogicalChannelId - 0 
/Adc/AdcConfigSet/AdcHwUnit_0/ADC_POT_0/AdcThresholdRegister - /Adc/Adc/AdcConfigSet/AdcHwUnit_0/AdcThresholdControl_0 
/Adc/AdcConfigSet/AdcHwUnit_0/ADC_POT_0/AdcWdogNotification - Adc_Adc1WdogNotification 
/Adc/AdcConfigSet/AdcHwUnit_0/Adc0Group_0/AdcAlternateGroupConvTimings - AdcAlternateGroupConvTimings 
/Adc/AdcConfigSet/AdcHwUnit_0/Adc0Group_0/AdcAlternateGroupConvTimings/AdcAltGroupSamplingDuration0 - 22 
/Adc/AdcConfigSet/AdcHwUnit_0/Adc0Group_0/AdcAlternateGroupConvTimings/AdcAltGroupSamplingDuration1 - 22 
/Adc/AdcConfigSet/AdcHwUnit_0/Adc0Group_0/AdcAlternateGroupConvTimings/AdcAltGroupSamplingDuration2 - 22 
/Adc/AdcConfigSet/AdcHwUnit_0/Adc0Group_0/AdcAlternateGroupConvTimings/AdcGroupAltHardwareAverageEnable - false 
/Adc/AdcConfigSet/AdcHwUnit_0/Adc0Group_0/AdcAlternateGroupConvTimings/AdcGroupAltHardwareAverageSelect - SAMPLES_4 
/Adc/AdcConfigSet/AdcHwUnit_0/Adc0Group_0/AdcEnableChDisableChGroup - false 
/Adc/AdcConfigSet/AdcHwUnit_0/Adc0Group_0/AdcEnableHalfInterrupt - false 
/Adc/AdcConfigSet/AdcHwUnit_0/Adc0Group_0/AdcEnableOptimizeDmaStreamingGroups - false 
/Adc/AdcConfigSet/AdcHwUnit_0/Adc0Group_0/AdcExtDMAChanEnable - false 
/Adc/AdcConfigSet/AdcHwUnit_0/Adc0Group_0/AdcExtraNotification - NULL_PTR 
/Adc/AdcConfigSet/AdcHwUnit_0/Adc0Group_0/AdcGroupAccessMode - ADC_ACCESS_MODE_SINGLE 
/Adc/AdcConfigSet/AdcHwUnit_0/Adc0Group_0/AdcGroupConversionConfiguration - AdcGroupConversionConfiguration 
/Adc/AdcConfigSet/AdcHwUnit_0/Adc0Group_0/AdcGroupConversionConfiguration/AdcGroupHardwareAverageEnable - false 
/Adc/AdcConfigSet/AdcHwUnit_0/Adc0Group_0/AdcGroupConversionConfiguration/AdcGroupHardwareAverageSelect - SAMPLES_4 
/Adc/AdcConfigSet/AdcHwUnit_0/Adc0Group_0/AdcGroupConversionConfiguration/AdcSamplingDuration0 - 22 
/Adc/AdcConfigSet/AdcHwUnit_0/Adc0Group_0/AdcGroupConversionConfiguration/AdcSamplingDuration1 - 22 
/Adc/AdcConfigSet/AdcHwUnit_0/Adc0Group_0/AdcGroupConversionConfiguration/AdcSamplingDuration2 - 22 
/Adc/AdcConfigSet/AdcHwUnit_0/Adc0Group_0/AdcGroupConversionMode - ADC_CONV_MODE_ONESHOT 
/Adc/AdcConfigSet/AdcHwUnit_0/Adc0Group_0/AdcGroupConversionType - ADC_CONV_TYPE_NORMAL 
/Adc/AdcConfigSet/AdcHwUnit_0/Adc0Group_0/AdcGroupDefinition - /Adc/Adc/AdcConfigSet/AdcHwUnit_0/ADC_POT_0 
/Adc/AdcConfigSet/AdcHwUnit_0/Adc0Group_0/AdcGroupHwTriggerSource - /Adc/Adc/AdcConfigSet/AdcHwTrigger_0 
/Adc/AdcConfigSet/AdcHwUnit_0/Adc0Group_0/AdcGroupId - 0 
/Adc/AdcConfigSet/AdcHwUnit_0/Adc0Group_0/AdcGroupTriggSrc - ADC_TRIGG_SRC_SW 
/Adc/AdcConfigSet/AdcHwUnit_0/Adc0Group_0/AdcNotification - Adc_Adc0Group0Notification 
/Adc/AdcConfigSet/AdcHwUnit_0/Adc0Group_0/AdcStreamResultGroup - false 
/Adc/AdcConfigSet/AdcHwUnit_0/Adc0Group_0/AdcStreamingBufferMode - ADC_STREAM_BUFFER_LINEAR 
/Adc/AdcConfigSet/AdcHwUnit_0/Adc0Group_0/AdcStreamingNumSamples - 1 
/Adc/AdcConfigSet/AdcHwUnit_0/Adc0Group_0/AdcWithoutDma - false 
/Adc/AdcConfigSet/AdcHwUnit_0/Adc0Group_0/AdcWithoutInterrupts - false 
/Adc/AdcConfigSet/AdcHwUnit_0/Adc0Group_1/AdcAlternateGroupConvTimings - AdcAlternateGroupConvTimings 
/Adc/AdcConfigSet/AdcHwUnit_0/Adc0Group_1/AdcAlternateGroupConvTimings/AdcAltGroupSamplingDuration0 - 22 
/Adc/AdcConfigSet/AdcHwUnit_0/Adc0Group_1/AdcAlternateGroupConvTimings/AdcAltGroupSamplingDuration1 - 22 
/Adc/AdcConfigSet/AdcHwUnit_0/Adc0Group_1/AdcAlternateGroupConvTimings/AdcAltGroupSamplingDuration2 - 22 
/Adc/AdcConfigSet/AdcHwUnit_0/Adc0Group_1/AdcAlternateGroupConvTimings/AdcGroupAltHardwareAverageEnable - false 
/Adc/AdcConfigSet/AdcHwUnit_0/Adc0Group_1/AdcAlternateGroupConvTimings/AdcGroupAltHardwareAverageSelect - SAMPLES_4 
/Adc/AdcConfigSet/AdcHwUnit_0/Adc0Group_1/AdcEnableChDisableChGroup - false 
/Adc/AdcConfigSet/AdcHwUnit_0/Adc0Group_1/AdcEnableHalfInterrupt - false 
/Adc/AdcConfigSet/AdcHwUnit_0/Adc0Group_1/AdcEnableOptimizeDmaStreamingGroups - false 
/Adc/AdcConfigSet/AdcHwUnit_0/Adc0Group_1/AdcExtDMAChanEnable - false 
/Adc/AdcConfigSet/AdcHwUnit_0/Adc0Group_1/AdcExtraNotification - NULL_PTR 
/Adc/AdcConfigSet/AdcHwUnit_0/Adc0Group_1/AdcGroupAccessMode - ADC_ACCESS_MODE_STREAMING 
/Adc/AdcConfigSet/AdcHwUnit_0/Adc0Group_1/AdcGroupConversionConfiguration - AdcGroupConversionConfiguration 
/Adc/AdcConfigSet/AdcHwUnit_0/Adc0Group_1/AdcGroupConversionConfiguration/AdcGroupHardwareAverageEnable - false 
/Adc/AdcConfigSet/AdcHwUnit_0/Adc0Group_1/AdcGroupConversionConfiguration/AdcGroupHardwareAverageSelect - SAMPLES_4 
/Adc/AdcConfigSet/AdcHwUnit_0/Adc0Group_1/AdcGroupConversionConfiguration/AdcSamplingDuration0 - 22 
/Adc/AdcConfigSet/AdcHwUnit_0/Adc0Group_1/AdcGroupConversionConfiguration/AdcSamplingDuration1 - 22 
/Adc/AdcConfigSet/AdcHwUnit_0/Adc0Group_1/AdcGroupConversionConfiguration/AdcSamplingDuration2 - 22 
/Adc/AdcConfigSet/AdcHwUnit_0/Adc0Group_1/AdcGroupConversionMode - ADC_CONV_MODE_CONTINUOUS 
/Adc/AdcConfigSet/AdcHwUnit_0/Adc0Group_1/AdcGroupConversionType - ADC_CONV_TYPE_NORMAL 
/Adc/AdcConfigSet/AdcHwUnit_0/Adc0Group_1/AdcGroupDefinition - /Adc/Adc/AdcConfigSet/AdcHwUnit_0/ADC_POT_0 
/Adc/AdcConfigSet/AdcHwUnit_0/Adc0Group_1/AdcGroupHwTriggerSource - /Adc/Adc/AdcConfigSet/AdcHwTrigger_0 
/Adc/AdcConfigSet/AdcHwUnit_0/Adc0Group_1/AdcGroupId - 2 
/Adc/AdcConfigSet/AdcHwUnit_0/Adc0Group_1/AdcGroupTriggSrc - ADC_TRIGG_SRC_SW 
/Adc/AdcConfigSet/AdcHwUnit_0/Adc0Group_1/AdcNotification - Adc_Adc0Group1Notification 
/Adc/AdcConfigSet/AdcHwUnit_0/Adc0Group_1/AdcStreamResultGroup - false 
/Adc/AdcConfigSet/AdcHwUnit_0/Adc0Group_1/AdcStreamingBufferMode - ADC_STREAM_BUFFER_LINEAR 
/Adc/AdcConfigSet/AdcHwUnit_0/Adc0Group_1/AdcStreamingNumSamples - 1 
/Adc/AdcConfigSet/AdcHwUnit_0/Adc0Group_1/AdcWithoutDma - false 
/Adc/AdcConfigSet/AdcHwUnit_0/Adc0Group_1/AdcWithoutInterrupts - false 
/Adc/AdcConfigSet/AdcHwUnit_0/AdcAltHighSpeedEnable - false 
/Adc/AdcConfigSet/AdcHwUnit_0/AdcAltPowerDownDelay - 15 
/Adc/AdcConfigSet/AdcHwUnit_0/AdcAltPrescale - 2 
/Adc/AdcConfigSet/AdcHwUnit_0/AdcAutoClockOff - false 
/Adc/AdcConfigSet/AdcHwUnit_0/AdcBypassSampling - false 
/Adc/AdcConfigSet/AdcHwUnit_0/AdcCalibrationPrescale - 1 
/Adc/AdcConfigSet/AdcHwUnit_0/AdcChannel - ADC_POT_0 
/Adc/AdcConfigSet/AdcHwUnit_0/AdcGroup - Adc0Group_0 Adc0Group_1 
/Adc/AdcConfigSet/AdcHwUnit_0/AdcHighSpeedEnable - false 
/Adc/AdcConfigSet/AdcHwUnit_0/AdcHwUnitBypassResolution - false 
/Adc/AdcConfigSet/AdcHwUnit_0/AdcHwUnitDmaClearSource - DMA_REQ_CLEAR_ON_ACK 
/Adc/AdcConfigSet/AdcHwUnit_0/AdcHwUnitId - ADC1 
/Adc/AdcConfigSet/AdcHwUnit_0/AdcHwUnitOverwriteEn - false 
/Adc/AdcConfigSet/AdcHwUnit_0/AdcHwUnitResolution - RESOLUTION_14 
/Adc/AdcConfigSet/AdcHwUnit_0/AdcHwUnitUsrGain - 0 
/Adc/AdcConfigSet/AdcHwUnit_0/AdcHwUnitUsrOffset - 0 
/Adc/AdcConfigSet/AdcHwUnit_0/AdcLogicalUnitId - 0 
/Adc/AdcConfigSet/AdcHwUnit_0/AdcMuxDelay - 15 
/Adc/AdcConfigSet/AdcHwUnit_0/AdcPowerDownDelay - 15 
/Adc/AdcConfigSet/AdcHwUnit_0/AdcPresamplingInternalSignal0 - VREFL 
/Adc/AdcConfigSet/AdcHwUnit_0/AdcPresamplingInternalSignal1 - VREFL 
/Adc/AdcConfigSet/AdcHwUnit_0/AdcPresamplingInternalSignal2 - VREFL 
/Adc/AdcConfigSet/AdcHwUnit_0/AdcPrescale - 1 
/Adc/AdcConfigSet/AdcHwUnit_0/AdcSarHwUnitVref - 53 
/Adc/AdcConfigSet/AdcHwUnit_0/AdcTransferType - ADC_INTERRUPT 
/Adc/AdcConfigSet/AdcHwUnit_0/SdAdcHwUnitSpecificConfiguration -  
/Adc/AdcConfigSet/AdcHwUnit_1//SdadcCalibAverage - 1 
/Adc/AdcConfigSet/AdcHwUnit_1//SdadcCalibSkipped - 0 
/Adc/AdcConfigSet/AdcHwUnit_1//SdadcDecimaRate - DECIMATION_RATE_120 
/Adc/AdcConfigSet/AdcHwUnit_1//SdadcFifoThreshold - 0 
/Adc/AdcConfigSet/AdcHwUnit_1//SdadcOutputSetDelay - 0 
/Adc/AdcConfigSet/AdcHwUnit_1/ADC_POT_1/AdcChannelHighLimit - 4095 
/Adc/AdcConfigSet/AdcHwUnit_1/ADC_POT_1/AdcChannelId - 43 
/Adc/AdcConfigSet/AdcHwUnit_1/ADC_POT_1/AdcChannelName - S19_ChanNum43 
/Adc/AdcConfigSet/AdcHwUnit_1/ADC_POT_1/AdcEnablePresampling - false 
/Adc/AdcConfigSet/AdcHwUnit_1/ADC_POT_1/AdcEnableThresholds - false 
/Adc/AdcConfigSet/AdcHwUnit_1/ADC_POT_1/AdcLogicalChannelId - 0 
/Adc/AdcConfigSet/AdcHwUnit_1/ADC_POT_1/AdcWdogNotification - NULL_PTR 
/Adc/AdcConfigSet/AdcHwUnit_1/Adc1Group_0/AdcAlternateGroupConvTimings - AdcAlternateGroupConvTimings 
/Adc/AdcConfigSet/AdcHwUnit_1/Adc1Group_0/AdcAlternateGroupConvTimings/AdcAltGroupSamplingDuration0 - 22 
/Adc/AdcConfigSet/AdcHwUnit_1/Adc1Group_0/AdcAlternateGroupConvTimings/AdcAltGroupSamplingDuration1 - 22 
/Adc/AdcConfigSet/AdcHwUnit_1/Adc1Group_0/AdcAlternateGroupConvTimings/AdcAltGroupSamplingDuration2 - 22 
/Adc/AdcConfigSet/AdcHwUnit_1/Adc1Group_0/AdcAlternateGroupConvTimings/AdcGroupAltHardwareAverageEnable - false 
/Adc/AdcConfigSet/AdcHwUnit_1/Adc1Group_0/AdcAlternateGroupConvTimings/AdcGroupAltHardwareAverageSelect - SAMPLES_4 
/Adc/AdcConfigSet/AdcHwUnit_1/Adc1Group_0/AdcEnableChDisableChGroup - false 
/Adc/AdcConfigSet/AdcHwUnit_1/Adc1Group_0/AdcEnableHalfInterrupt - false 
/Adc/AdcConfigSet/AdcHwUnit_1/Adc1Group_0/AdcEnableOptimizeDmaStreamingGroups - false 
/Adc/AdcConfigSet/AdcHwUnit_1/Adc1Group_0/AdcExtDMAChanEnable - false 
/Adc/AdcConfigSet/AdcHwUnit_1/Adc1Group_0/AdcExtraNotification - NULL_PTR 
/Adc/AdcConfigSet/AdcHwUnit_1/Adc1Group_0/AdcGroupAccessMode - ADC_ACCESS_MODE_SINGLE 
/Adc/AdcConfigSet/AdcHwUnit_1/Adc1Group_0/AdcGroupConversionConfiguration - AdcGroupConversionConfiguration 
/Adc/AdcConfigSet/AdcHwUnit_1/Adc1Group_0/AdcGroupConversionConfiguration/AdcGroupHardwareAverageEnable - false 
/Adc/AdcConfigSet/AdcHwUnit_1/Adc1Group_0/AdcGroupConversionConfiguration/AdcGroupHardwareAverageSelect - SAMPLES_4 
/Adc/AdcConfigSet/AdcHwUnit_1/Adc1Group_0/AdcGroupConversionConfiguration/AdcSamplingDuration0 - 22 
/Adc/AdcConfigSet/AdcHwUnit_1/Adc1Group_0/AdcGroupConversionConfiguration/AdcSamplingDuration1 - 22 
/Adc/AdcConfigSet/AdcHwUnit_1/Adc1Group_0/AdcGroupConversionConfiguration/AdcSamplingDuration2 - 22 
/Adc/AdcConfigSet/AdcHwUnit_1/Adc1Group_0/AdcGroupConversionMode - ADC_CONV_MODE_ONESHOT 
/Adc/AdcConfigSet/AdcHwUnit_1/Adc1Group_0/AdcGroupConversionType - ADC_CONV_TYPE_NORMAL 
/Adc/AdcConfigSet/AdcHwUnit_1/Adc1Group_0/AdcGroupDefinition - /Adc/Adc/AdcConfigSet/AdcHwUnit_1/ADC_POT_1 
/Adc/AdcConfigSet/AdcHwUnit_1/Adc1Group_0/AdcGroupHwTriggerSource - /Adc/Adc/AdcConfigSet/AdcHwTrigger_0 
/Adc/AdcConfigSet/AdcHwUnit_1/Adc1Group_0/AdcGroupId - 1 
/Adc/AdcConfigSet/AdcHwUnit_1/Adc1Group_0/AdcGroupTriggSrc - ADC_TRIGG_SRC_SW 
/Adc/AdcConfigSet/AdcHwUnit_1/Adc1Group_0/AdcNotification - Adc_Adc1Group0Notification 
/Adc/AdcConfigSet/AdcHwUnit_1/Adc1Group_0/AdcStreamResultGroup - false 
/Adc/AdcConfigSet/AdcHwUnit_1/Adc1Group_0/AdcStreamingBufferMode - ADC_STREAM_BUFFER_LINEAR 
/Adc/AdcConfigSet/AdcHwUnit_1/Adc1Group_0/AdcStreamingNumSamples - 1 
/Adc/AdcConfigSet/AdcHwUnit_1/Adc1Group_0/AdcWithoutDma - false 
/Adc/AdcConfigSet/AdcHwUnit_1/Adc1Group_0/AdcWithoutInterrupts - false 
/Adc/AdcConfigSet/AdcHwUnit_1/Adc1Group_1/AdcAlternateGroupConvTimings - AdcAlternateGroupConvTimings 
/Adc/AdcConfigSet/AdcHwUnit_1/Adc1Group_1/AdcAlternateGroupConvTimings/AdcAltGroupSamplingDuration0 - 22 
/Adc/AdcConfigSet/AdcHwUnit_1/Adc1Group_1/AdcAlternateGroupConvTimings/AdcAltGroupSamplingDuration1 - 22 
/Adc/AdcConfigSet/AdcHwUnit_1/Adc1Group_1/AdcAlternateGroupConvTimings/AdcAltGroupSamplingDuration2 - 22 
/Adc/AdcConfigSet/AdcHwUnit_1/Adc1Group_1/AdcAlternateGroupConvTimings/AdcGroupAltHardwareAverageEnable - false 
/Adc/AdcConfigSet/AdcHwUnit_1/Adc1Group_1/AdcAlternateGroupConvTimings/AdcGroupAltHardwareAverageSelect - SAMPLES_4 
/Adc/AdcConfigSet/AdcHwUnit_1/Adc1Group_1/AdcEnableChDisableChGroup - false 
/Adc/AdcConfigSet/AdcHwUnit_1/Adc1Group_1/AdcEnableHalfInterrupt - false 
/Adc/AdcConfigSet/AdcHwUnit_1/Adc1Group_1/AdcEnableOptimizeDmaStreamingGroups - false 
/Adc/AdcConfigSet/AdcHwUnit_1/Adc1Group_1/AdcExtDMAChanEnable - false 
/Adc/AdcConfigSet/AdcHwUnit_1/Adc1Group_1/AdcExtraNotification - NULL_PTR 
/Adc/AdcConfigSet/AdcHwUnit_1/Adc1Group_1/AdcGroupAccessMode - ADC_ACCESS_MODE_STREAMING 
/Adc/AdcConfigSet/AdcHwUnit_1/Adc1Group_1/AdcGroupConversionConfiguration - AdcGroupConversionConfiguration 
/Adc/AdcConfigSet/AdcHwUnit_1/Adc1Group_1/AdcGroupConversionConfiguration/AdcGroupHardwareAverageEnable - false 
/Adc/AdcConfigSet/AdcHwUnit_1/Adc1Group_1/AdcGroupConversionConfiguration/AdcGroupHardwareAverageSelect - SAMPLES_4 
/Adc/AdcConfigSet/AdcHwUnit_1/Adc1Group_1/AdcGroupConversionConfiguration/AdcSamplingDuration0 - 22 
/Adc/AdcConfigSet/AdcHwUnit_1/Adc1Group_1/AdcGroupConversionConfiguration/AdcSamplingDuration1 - 22 
/Adc/AdcConfigSet/AdcHwUnit_1/Adc1Group_1/AdcGroupConversionConfiguration/AdcSamplingDuration2 - 22 
/Adc/AdcConfigSet/AdcHwUnit_1/Adc1Group_1/AdcGroupConversionMode - ADC_CONV_MODE_CONTINUOUS 
/Adc/AdcConfigSet/AdcHwUnit_1/Adc1Group_1/AdcGroupConversionType - ADC_CONV_TYPE_NORMAL 
/Adc/AdcConfigSet/AdcHwUnit_1/Adc1Group_1/AdcGroupDefinition - /Adc/Adc/AdcConfigSet/AdcHwUnit_1/ADC_POT_1 
/Adc/AdcConfigSet/AdcHwUnit_1/Adc1Group_1/AdcGroupHwTriggerSource - /Adc/Adc/AdcConfigSet/AdcHwTrigger_0 
/Adc/AdcConfigSet/AdcHwUnit_1/Adc1Group_1/AdcGroupId - 3 
/Adc/AdcConfigSet/AdcHwUnit_1/Adc1Group_1/AdcGroupTriggSrc - ADC_TRIGG_SRC_SW 
/Adc/AdcConfigSet/AdcHwUnit_1/Adc1Group_1/AdcNotification - Adc_Adc1Group1Notification 
/Adc/AdcConfigSet/AdcHwUnit_1/Adc1Group_1/AdcStreamResultGroup - false 
/Adc/AdcConfigSet/AdcHwUnit_1/Adc1Group_1/AdcStreamingBufferMode - ADC_STREAM_BUFFER_LINEAR 
/Adc/AdcConfigSet/AdcHwUnit_1/Adc1Group_1/AdcStreamingNumSamples - 3 
/Adc/AdcConfigSet/AdcHwUnit_1/Adc1Group_1/AdcWithoutDma - false 
/Adc/AdcConfigSet/AdcHwUnit_1/Adc1Group_1/AdcWithoutInterrupts - false 
/Adc/AdcConfigSet/AdcHwUnit_1/AdcAltHighSpeedEnable - false 
/Adc/AdcConfigSet/AdcHwUnit_1/AdcAltPowerDownDelay - 15 
/Adc/AdcConfigSet/AdcHwUnit_1/AdcAltPrescale - 2 
/Adc/AdcConfigSet/AdcHwUnit_1/AdcAutoClockOff - false 
/Adc/AdcConfigSet/AdcHwUnit_1/AdcBypassSampling - false 
/Adc/AdcConfigSet/AdcHwUnit_1/AdcCalibrationPrescale - 1 
/Adc/AdcConfigSet/AdcHwUnit_1/AdcChannel - ADC_POT_1 
/Adc/AdcConfigSet/AdcHwUnit_1/AdcGroup - Adc1Group_0 Adc1Group_1 
/Adc/AdcConfigSet/AdcHwUnit_1/AdcHighSpeedEnable - false 
/Adc/AdcConfigSet/AdcHwUnit_1/AdcHwUnitBypassResolution - false 
/Adc/AdcConfigSet/AdcHwUnit_1/AdcHwUnitDmaClearSource - DMA_REQ_CLEAR_ON_ACK 
/Adc/AdcConfigSet/AdcHwUnit_1/AdcHwUnitId - ADC2 
/Adc/AdcConfigSet/AdcHwUnit_1/AdcHwUnitOverwriteEn - false 
/Adc/AdcConfigSet/AdcHwUnit_1/AdcHwUnitResolution - RESOLUTION_14 
/Adc/AdcConfigSet/AdcHwUnit_1/AdcHwUnitUsrGain - 0 
/Adc/AdcConfigSet/AdcHwUnit_1/AdcHwUnitUsrOffset - 0 
/Adc/AdcConfigSet/AdcHwUnit_1/AdcLogicalUnitId - 1 
/Adc/AdcConfigSet/AdcHwUnit_1/AdcMuxDelay - 15 
/Adc/AdcConfigSet/AdcHwUnit_1/AdcPowerDownDelay - 15 
/Adc/AdcConfigSet/AdcHwUnit_1/AdcPresamplingInternalSignal0 - VREFL 
/Adc/AdcConfigSet/AdcHwUnit_1/AdcPresamplingInternalSignal1 - VREFL 
/Adc/AdcConfigSet/AdcHwUnit_1/AdcPresamplingInternalSignal2 - VREFL 
/Adc/AdcConfigSet/AdcHwUnit_1/AdcPrescale - 1 
/Adc/AdcConfigSet/AdcHwUnit_1/AdcSarHwUnitVref - 53 
/Adc/AdcConfigSet/AdcHwUnit_1/AdcTransferType - ADC_INTERRUPT 
/Adc/AdcConfigSet/AdcHwUnit_1/SdAdcHwUnitSpecificConfiguration -  
/Adc/AdcConfigSet/BctuHwUnit - BctuHwUnit_0 
/Adc/AdcConfigSet/BctuHwUnit_0/BctuAdcNotifications - BctuAdcNotifications_0 BctuAdcNotifications_1 
/Adc/AdcConfigSet/BctuHwUnit_0/BctuAdcNotifications_0/BctuAdcNewDataNotification - Adc0_CtuNewDataNotification 
/Adc/AdcConfigSet/BctuHwUnit_0/BctuAdcNotifications_0/BctuAdcNotificationsAdcIndex - /Adc/Adc/AdcConfigSet/AdcHwUnit_0 
/Adc/AdcConfigSet/BctuHwUnit_0/BctuAdcNotifications_0/BctuDataOverrunNotification - Adc0_CtuDataOverrunNotification 
/Adc/AdcConfigSet/BctuHwUnit_0/BctuAdcNotifications_0/BctuListLastConversionNotification - Adc0_CtuListLastNotification 
/Adc/AdcConfigSet/BctuHwUnit_0/BctuAdcNotifications_1/BctuAdcNewDataNotification - Adc1_CtuNewDataNotification 
/Adc/AdcConfigSet/BctuHwUnit_0/BctuAdcNotifications_1/BctuAdcNotificationsAdcIndex - /Adc/Adc/AdcConfigSet/AdcHwUnit_1 
/Adc/AdcConfigSet/BctuHwUnit_0/BctuAdcNotifications_1/BctuDataOverrunNotification - Adc1_CtuDataOverrunNotification 
/Adc/AdcConfigSet/BctuHwUnit_0/BctuAdcNotifications_1/BctuListLastConversionNotification - Adc1_ListLastNotification 
/Adc/AdcConfigSet/BctuHwUnit_0/BctuFifoDmaRawData - false 
/Adc/AdcConfigSet/BctuHwUnit_0/BctuGlobalHwTriggers - true 
/Adc/AdcConfigSet/BctuHwUnit_0/BctuHwUnitId - 0 
/Adc/AdcConfigSet/BctuHwUnit_0/BctuInternalTrigger - BctuInternalTrigger_0 BctuInternalTrigger_1 BctuInternalTrigger_2 
/Adc/AdcConfigSet/BctuHwUnit_0/BctuInternalTrigger_0/BctuAdcChannelSingle - /Adc/Adc/AdcConfigSet/AdcHwUnit_0/ADC_POT_0 
/Adc/AdcConfigSet/BctuHwUnit_0/BctuInternalTrigger_0/BctuAdcTargetMask - 2 
/Adc/AdcConfigSet/BctuHwUnit_0/BctuInternalTrigger_0/BctuConversionListStartIndex - 0 
/Adc/AdcConfigSet/BctuHwUnit_0/BctuInternalTrigger_0/BctuDataDestination - BCTU_ADC_DATA_REG 
/Adc/AdcConfigSet/BctuHwUnit_0/BctuInternalTrigger_0/BctuHwTriggerEnable - false 
/Adc/AdcConfigSet/BctuHwUnit_0/BctuInternalTrigger_0/BctuTriggerConversionMode - SINGLE 
/Adc/AdcConfigSet/BctuHwUnit_0/BctuInternalTrigger_0/BctuTriggerLoop - false 
/Adc/AdcConfigSet/BctuHwUnit_0/BctuInternalTrigger_0/BctuTriggerSource - /Adc/Adc/AdcConfigSet/AdcHwTrigger_0 
/Adc/AdcConfigSet/BctuHwUnit_0/BctuInternalTrigger_1/BctuAdcChannelSingle - /Adc/Adc/AdcConfigSet/AdcHwUnit_1/ADC_POT_1 
/Adc/AdcConfigSet/BctuHwUnit_0/BctuInternalTrigger_1/BctuAdcTargetMask - 4 
/Adc/AdcConfigSet/BctuHwUnit_0/BctuInternalTrigger_1/BctuConversionListStartIndex - 0 
/Adc/AdcConfigSet/BctuHwUnit_0/BctuInternalTrigger_1/BctuDataDestination - BCTU_ADC_DATA_REG 
/Adc/AdcConfigSet/BctuHwUnit_0/BctuInternalTrigger_1/BctuHwTriggerEnable - false 
/Adc/AdcConfigSet/BctuHwUnit_0/BctuInternalTrigger_1/BctuTriggerConversionMode - SINGLE 
/Adc/AdcConfigSet/BctuHwUnit_0/BctuInternalTrigger_1/BctuTriggerLoop - false 
/Adc/AdcConfigSet/BctuHwUnit_0/BctuInternalTrigger_1/BctuTriggerSource - /Adc/Adc/AdcConfigSet/AdcHwTrigger_1 
/Adc/AdcConfigSet/BctuHwUnit_0/BctuInternalTrigger_2/BctuAdcChannelSingle - /Adc/Adc/AdcConfigSet/AdcHwUnit_1/ADC_POT_1 
/Adc/AdcConfigSet/BctuHwUnit_0/BctuInternalTrigger_2/BctuAdcTargetMask - 6 
/Adc/AdcConfigSet/BctuHwUnit_0/BctuInternalTrigger_2/BctuConversionListStartIndex - 0 
/Adc/AdcConfigSet/BctuHwUnit_0/BctuInternalTrigger_2/BctuDataDestination - BCTU_ADC_DATA_REG 
/Adc/AdcConfigSet/BctuHwUnit_0/BctuInternalTrigger_2/BctuHwTriggerEnable - false 
/Adc/AdcConfigSet/BctuHwUnit_0/BctuInternalTrigger_2/BctuTriggerConversionMode - LIST 
/Adc/AdcConfigSet/BctuHwUnit_0/BctuInternalTrigger_2/BctuTriggerLoop - false 
/Adc/AdcConfigSet/BctuHwUnit_0/BctuInternalTrigger_2/BctuTriggerSource - /Adc/Adc/AdcConfigSet/AdcHwTrigger_2 
/Adc/AdcConfigSet/BctuHwUnit_0/BctuListItems - BctuListItems_0 BctuListItems_1 
/Adc/AdcConfigSet/BctuHwUnit_0/BctuListItems_0/BctuAdcChannelList - S10_ChanNum34 
/Adc/AdcConfigSet/BctuHwUnit_0/BctuListItems_0/BctuLastChannel - false 
/Adc/AdcConfigSet/BctuHwUnit_0/BctuListItems_0/BctuNextChannelWaitOnTrig - false 
/Adc/AdcConfigSet/BctuHwUnit_0/BctuListItems_1/BctuAdcChannelList - S19_ChanNum43 
/Adc/AdcConfigSet/BctuHwUnit_0/BctuListItems_1/BctuLastChannel - true 
/Adc/AdcConfigSet/BctuHwUnit_0/BctuListItems_1/BctuNextChannelWaitOnTrig - false 
/Adc/AdcConfigSet/BctuHwUnit_0/BctuLogicalUnitId - 0 
/Adc/AdcConfigSet/BctuHwUnit_0/BctuLowPowerMode - false 
/Adc/AdcConfigSet/BctuHwUnit_0/BctuNewDataDMAEnableMask - 0 
/Adc/AdcConfigSet/BctuHwUnit_0/BctuResultFifos - BctuResultFifos_0 BctuResultFifos_1 
/Adc/AdcConfigSet/BctuHwUnit_0/BctuResultFifos_0/BctuFifoDmaBuffer - BctuDmaFifo1 
/Adc/AdcConfigSet/BctuHwUnit_0/BctuResultFifos_0/BctuFifoDmaEnable - false 
/Adc/AdcConfigSet/BctuHwUnit_0/BctuResultFifos_0/BctuFifoNotificationsEnable - false 
/Adc/AdcConfigSet/BctuHwUnit_0/BctuResultFifos_0/BctuOverrunNotification - Adc_Fifo1_OverrunNotification 
/Adc/AdcConfigSet/BctuHwUnit_0/BctuResultFifos_0/BctuResultFifoIndex - FIFO_1 
/Adc/AdcConfigSet/BctuHwUnit_0/BctuResultFifos_0/BctuUnderrunNotification - Adc_Fifo1_UnderrunNotification 
/Adc/AdcConfigSet/BctuHwUnit_0/BctuResultFifos_0/BctuWatermarkNotification - Adc_Fifo1_WaterMarkNotification 
/Adc/AdcConfigSet/BctuHwUnit_0/BctuResultFifos_0/BctuWatermarkValue - 1 
/Adc/AdcConfigSet/BctuHwUnit_0/BctuResultFifos_1/BctuFifoDmaBuffer - BctuDmaFifo1 
