Caler10/RBCM_S32K344_AUTOSAR_MBD/Firmware/S32K344_DAPlink/S32K344_LED/S32K344_LED_ert_rtw/MW_target_hardware_resources.h
/Adc/AdcConfigSet/BctuHwUnit_0/BctuResultFifos_1/BctuFifoDmaEnable - false 
/Adc/AdcConfigSet/BctuHwUnit_0/BctuResultFifos_1/BctuFifoNotificationsEnable - false 
/Adc/AdcConfigSet/BctuHwUnit_0/BctuResultFifos_1/BctuOverrunNotification - NULL_PTR 
/Adc/AdcConfigSet/BctuHwUnit_0/BctuResultFifos_1/BctuResultFifoIndex - FIFO_2 
/Adc/AdcConfigSet/BctuHwUnit_0/BctuResultFifos_1/BctuUnderrunNotification - NULL_PTR 
/Adc/AdcConfigSet/BctuHwUnit_0/BctuResultFifos_1/BctuWatermarkNotification - NULL_PTR 
/Adc/AdcConfigSet/BctuHwUnit_0/BctuResultFifos_1/BctuWatermarkValue - 0 
/Adc/AdcConfigSet/BctuHwUnit_0/BctuTriggerNotification - NULL_PTR 
/Adc/AdcGeneral - AdcGeneral 
/Adc/AdcGeneral/AdcDeInitApi - true 
/Adc/AdcGeneral/AdcDevErrorDetect - true 
/Adc/AdcGeneral/AdcEnableLimitCheck - true 
/Adc/AdcGeneral/AdcEnableQueuing - true 
/Adc/AdcGeneral/AdcEnableStartStopGroupApi - true 
/Adc/AdcGeneral/AdcGrpNotifCapability - true 
/Adc/AdcGeneral/AdcHwTriggerApi - false 
/Adc/AdcGeneral/AdcLowPowerStatesSupport - false 
/Adc/AdcGeneral/AdcPriorityImplementation - ADC_PRIORITY_NONE 
/Adc/AdcGeneral/AdcPriorityQueueMaxDepth - 1 
/Adc/AdcGeneral/AdcReadGroupApi - true 
/Adc/AdcGeneral/AdcResultAlignment - ADC_ALIGN_RIGHT 
/Adc/AdcGeneral/AdcVersionInfoApi - true 
/Adc/AdcInterrupt - AdcInterrupt_0 AdcInterrupt_1 AdcInterrupt_2 AdcInterrupt_3 AdcInterrupt_4 AdcInterrupt_5 
/Adc/AdcInterrupt_0/AdcInterruptEnable - false 
/Adc/AdcInterrupt_0/AdcInterruptSource - ADC0_EOC 
/Adc/AdcInterrupt_1/AdcInterruptEnable - false 
/Adc/AdcInterrupt_1/AdcInterruptSource - ADC0_WD 
/Adc/AdcInterrupt_2/AdcInterruptEnable - true 
/Adc/AdcInterrupt_2/AdcInterruptSource - ADC1_EOC 
/Adc/AdcInterrupt_3/AdcInterruptEnable - false 
/Adc/AdcInterrupt_3/AdcInterruptSource - ADC1_WD 
/Adc/AdcInterrupt_4/AdcInterruptEnable - true 
/Adc/AdcInterrupt_4/AdcInterruptSource - ADC2_EOC 
/Adc/AdcInterrupt_5/AdcInterruptEnable - false 
/Adc/AdcInterrupt_5/AdcInterruptSource - ADC2_WD 
/Adc/AdcPublishedInformation - AdcPublishedInformation 
/Adc/AdcPublishedInformation/AdcChannelValueSigned - false 
/Adc/AdcPublishedInformation/AdcGroupFirstChannelFixed - false 
/Adc/AdcPublishedInformation/AdcMaxChannelResolution - 14 
/Adc/AutosarExt - AutosarExt 
/Adc/AutosarExt/AdcBypassAbortChainCheck - false 
/Adc/AutosarExt/AdcConvTimeOnce - false 
/Adc/AutosarExt/AdcCtuHardwareTriggerOptimization - false 
/Adc/AutosarExt/AdcEnableApplyCalibration - false 
/Adc/AutosarExt/AdcEnableCalibration - true 
/Adc/AutosarExt/AdcEnableChDisableChApi - true 
/Adc/AutosarExt/AdcEnableCtuControlModeApi - true 
/Adc/AutosarExt/AdcEnableCtuTrigAutosarExtApi - false 
/Adc/AutosarExt/AdcEnableDmaTransferMode - false 
/Adc/AutosarExt/AdcEnableDualClockMode - false 
/Adc/AutosarExt/AdcEnableGroupDependentChannelNames - false 
/Adc/AutosarExt/AdcEnableGroupStreamingResultReorder - false 
/Adc/AutosarExt/AdcEnableInitialNotification - false 
/Adc/AutosarExt/AdcEnableReadRawDataApi - false 
/Adc/AutosarExt/AdcEnableSelfTest - false 
/Adc/AutosarExt/AdcEnableSetChannel - false 
/Adc/AutosarExt/AdcEnableThresholdConfigurationApi - true 
/Adc/AutosarExt/AdcEnableUserModeSupport - false 
/Adc/AutosarExt/AdcEnableWatchdogApi - true 
/Adc/AutosarExt/AdcGetInjectedConvStatusApi - false 
/Adc/AutosarExt/AdcMulticoreSupport - false 
/Adc/AutosarExt/AdcOptimizeDmaStreamingGroups - false 
/Adc/AutosarExt/AdcOptimizeOneShotHwTriggerConversions - false 
/Adc/AutosarExt/AdcPreSamplingOnce - true 
/Adc/AutosarExt/AdcSarEnableTempsenseApi - false 
/Adc/AutosarExt/AdcSarIpDevErrorDetect - false 
/Adc/AutosarExt/AdcSarPowerOnTempSense - false 
/Adc/AutosarExt/AdcSarTempSenseVsupply - 53 
/Adc/AutosarExt/AdcSetHwUnitPowerModeApi - true 
/Adc/AutosarExt/AdcTimeoutMethod - OSIF_COUNTER_DUMMY 
/Adc/AutosarExt/AdcTimeoutVal - 3000 
/Adc/AutosarExt/AdcUseHardwareNormalGroups - false 
/Adc/AutosarExt/AdcUseSoftwareInjectedGroups - false 
/Adc/AutosarExt/BctuIpDevErrorDetect - false 
/Adc/AutosarExt/CtuEnableDmaTransferMode - false 
/Adc/AutosarExt/SdAdcDspssSchedMode - DSPSS_SAMPLE_THRESHOLD_MODE 
/Adc/AutosarExt/SdadcDspssEnable - false 
/Adc/AutosarExt/SdadcDspssErrorNotifCapability - false 
/Adc/AutosarExt/SdadcIpDevErrorDetect - false 
/Adc/CommonPublishedInformation - CommonPublishedInformation 
/Adc/CommonPublishedInformation/ArReleaseMajorVersion - 4 
/Adc/CommonPublishedInformation/ArReleaseMinorVersion - 4 
/Adc/CommonPublishedInformation/ArReleaseRevisionVersion - 0 
/Adc/CommonPublishedInformation/ModuleId - 123 
/Adc/CommonPublishedInformation/SwMajorVersion - 2 
/Adc/CommonPublishedInformation/SwMinorVersion - 0 
/Adc/CommonPublishedInformation/SwPatchVersion - 0 
/Adc/CommonPublishedInformation/VendorApiInfix -  
/Adc/CommonPublishedInformation/VendorId - 43 
/Adc/IMPLEMENTATION-CONFIG-VARIANT - VARIANT-POST-BUILD 
/Adc/POST_BUILD_VARIANT_USED - true 

*/
#define MW_DETAILS_ADC 
#define MW_OPEN_ADC 
#define MW_UPDATE_ADC 
#define MW_RESTORE_ADC 
#define MW_CAN_43_FLEXCAN_INFO /*
/Can - Can 
/Can/CanConfigSet - CanConfigSet 
/Can/CanConfigSet/CanController - CanController_0 CanController_1 
/Can/CanConfigSet/CanController_0/CanAutoBusOffRecovery - false 
/Can/CanConfigSet/CanController_0/CanBusoffProcessing - POLLING 
/Can/CanConfigSet/CanController_0/CanControllerActivation - true 
/Can/CanConfigSet/CanController_0/CanControllerBaseAddress - 0 
/Can/CanConfigSet/CanController_0/CanControllerBaudrateConfig - CanControllerBaudrateConfig_0 
/Can/CanConfigSet/CanController_0/CanControllerBaudrateConfig_0/CanAdvancedSetting - false 
/Can/CanConfigSet/CanController_0/CanControllerBaudrateConfig_0/CanBaudrateTypeSuport - NORMAL_CBT 
/Can/CanConfigSet/CanController_0/CanControllerBaudrateConfig_0/CanBusLength - 40 
/Can/CanConfigSet/CanController_0/CanControllerBaudrateConfig_0/CanControllerBaudRate - 500.0 
/Can/CanConfigSet/CanController_0/CanControllerBaudrateConfig_0/CanControllerBaudRateConfigID - 0 
/Can/CanConfigSet/CanController_0/CanControllerBaudrateConfig_0/CanControllerFdBaudrateConfig - CanControllerFdBaudrateConfig 
/Can/CanConfigSet/CanController_0/CanControllerBaudrateConfig_0/CanControllerFdBaudrateConfig/CanControllerFdBaudRate - 2000 
/Can/CanConfigSet/CanController_0/CanControllerBaudrateConfig_0/CanControllerFdBaudrateConfig/CanControllerFdPrescaller - 2 
/Can/CanConfigSet/CanController_0/CanControllerBaudrateConfig_0/CanControllerFdBaudrateConfig/CanControllerFdSyncSeg - 1 
/Can/CanConfigSet/CanController_0/CanControllerBaudrateConfig_0/CanControllerFdBaudrateConfig/CanControllerPrescallerAlternateFd - 1 
/Can/CanConfigSet/CanController_0/CanControllerBaudrateConfig_0/CanControllerFdBaudrateConfig/CanControllerPropSeg - 5 
/Can/CanConfigSet/CanController_0/CanControllerBaudrateConfig_0/CanControllerFdBaudrateConfig/CanControllerSeg1 - 2 
/Can/CanConfigSet/CanController_0/CanControllerBaudrateConfig_0/CanControllerFdBaudrateConfig/CanControllerSeg2 - 2 
/Can/CanConfigSet/CanController_0/CanControllerBaudrateConfig_0/CanControllerFdBaudrateConfig/CanControllerSyncJumpWidth - 2 
/Can/CanConfigSet/CanController_0/CanControllerBaudrateConfig_0/CanControllerFdBaudrateConfig/CanControllerTxBitRateSwitch - true 
/Can/CanConfigSet/CanController_0/CanControllerBaudrateConfig_0/CanControllerPrescaller - 2 
/Can/CanConfigSet/CanController_0/CanControllerBaudrateConfig_0/CanControllerPrescallerAlternate - 10 
/Can/CanConfigSet/CanController_0/CanControllerBaudrateConfig_0/CanControllerPropSeg - 11 
/Can/CanConfigSet/CanController_0/CanControllerBaudrateConfig_0/CanControllerSeg1 - 18 
/Can/CanConfigSet/CanController_0/CanControllerBaudrateConfig_0/CanControllerSeg2 - 10 
/Can/CanConfigSet/CanController_0/CanControllerBaudrateConfig_0/CanControllerSyncJumpWidth - 10 
/Can/CanConfigSet/CanController_0/CanControllerBaudrateConfig_0/CanControllerSyncSeg - 1 
/Can/CanConfigSet/CanController_0/CanControllerBaudrateConfig_0/CanPropDelayTranceiver - 150.0 
/Can/CanConfigSet/CanController_0/CanControllerBaudrateConfig_0/CanTxArbitrationStartDelay - 12 
/Can/CanConfigSet/CanController_0/CanControllerDefaultBaudrate - /Can_43_FLEXCAN/Can/CanConfigSet/CanController_0/CanControllerBaudrateConfig_0 
/Can/CanConfigSet/CanController_0/CanControllerEdgeFilter - false 
/Can/CanConfigSet/CanController_0/CanControllerFdISO - true 
/Can/CanConfigSet/CanController_0/CanControllerId - 0 
/Can/CanConfigSet/CanController_0/CanControllerPrExcEn - false 
/Can/CanConfigSet/CanController_0/CanCpuClockRef - /Mcu/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/FLEXCAN_PE_CLK0_2 
/Can/CanConfigSet/CanController_0/CanCpuClockRefAlternate - /Mcu/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/FLEXCAN_PE_CLK0_2 
/Can/CanConfigSet/CanController_0/CanHwChannel - FLEXCAN_0 
/Can/CanConfigSet/CanController_0/CanLoopBackMode - false 
/Can/CanConfigSet/CanController_0/CanRamBlock - CanRamBlock 
/Can/CanConfigSet/CanController_0/CanRamBlock/CanRamBlockUnified - CanRamBlockUnified 
/Can/CanConfigSet/CanController_0/CanRamBlock/CanRamBlockUnified/CanBlockUnifiedPayloadLength - CAN_16_BYTES_PAYLOAD 
/Can/CanConfigSet/CanController_0/CanRamBlock/Choice - CanRamBlockUnified 
/Can/CanConfigSet/CanController_0/CanRxFiFo - CanRxFiFo 
/Can/CanConfigSet/CanController_0/CanRxFiFo/CanEnhanceFiFo - CanRxFiFo 
/Can/CanConfigSet/CanController_0/CanRxFiFo/CanRxFiFo/CanEnhanceFiFoDmaEnable - false 
/Can/CanConfigSet/CanController_0/CanRxFiFo/CanRxFiFo/CanEnhancedSchemeType - MASK_FILTER_SCHEME 
/Can/CanConfigSet/CanController_0/CanRxFiFo/CanRxFiFo/CanFiFoDmaErrorNotif - NULL_PTR 
/Can/CanConfigSet/CanController_0/CanRxFiFo/CanRxFiFo/CanFiFoOverflowNotif - MBDT_FlexCAN0_FifoOverflowNotif 
/Can/CanConfigSet/CanController_0/CanRxFiFo/CanRxFiFo/NumberMBTransferDMA - 1 
/Can/CanConfigSet/CanController_0/CanRxFiFo/Choice - CanEnhanceFiFo 
/Can/CanConfigSet/CanController_0/CanRxProcessing - MIXED 
/Can/CanConfigSet/CanController_0/CanTrippleSamplingEnable - false 
/Can/CanConfigSet/CanController_0/CanTxProcessing - MIXED 
/Can/CanConfigSet/CanController_0/CanWakeupFunctionalityAPI - false 
/Can/CanConfigSet/CanController_0/CanWakeupProcessing - POLLING 
/Can/CanConfigSet/CanController_0/CanWakeupSupport - false 
/Can/CanConfigSet/CanController_1/CanAutoBusOffRecovery - false 
/Can/CanConfigSet/CanController_1/CanBusoffProcessing - POLLING 
/Can/CanConfigSet/CanController_1/CanControllerActivation - true 
/Can/CanConfigSet/CanController_1/CanControllerBaseAddress - 0 
/Can/CanConfigSet/CanController_1/CanControllerBaudrateConfig - CanControllerBaudrateConfig_0 
/Can/CanConfigSet/CanController_1/CanControllerBaudrateConfig_0/CanAdvancedSetting - false 
/Can/CanConfigSet/CanController_1/CanControllerBaudrateConfig_0/CanBaudrateTypeSuport - NORMAL_CBT 
/Can/CanConfigSet/CanController_1/CanControllerBaudrateConfig_0/CanBusLength - 40 
/Can/CanConfigSet/CanController_1/CanControllerBaudrateConfig_0/CanControllerBaudRate - 500.0 
/Can/CanConfigSet/CanController_1/CanControllerBaudrateConfig_0/CanControllerBaudRateConfigID - 0 
/Can/CanConfigSet/CanController_1/CanControllerBaudrateConfig_0/CanControllerPrescaller - 4 
/Can/CanConfigSet/CanController_1/CanControllerBaudrateConfig_0/CanControllerPrescallerAlternate - 10 
/Can/CanConfigSet/CanController_1/CanControllerBaudrateConfig_0/CanControllerPropSeg - 6 
/Can/CanConfigSet/CanController_1/CanControllerBaudrateConfig_0/CanControllerSeg1 - 8 
/Can/CanConfigSet/CanController_1/CanControllerBaudrateConfig_0/CanControllerSeg2 - 5 
/Can/CanConfigSet/CanController_1/CanControllerBaudrateConfig_0/CanControllerSyncJumpWidth - 4 
/Can/CanConfigSet/CanController_1/CanControllerBaudrateConfig_0/CanControllerSyncSeg - 1 
/Can/CanConfigSet/CanController_1/CanControllerBaudrateConfig_0/CanPropDelayTranceiver - 150.0 
/Can/CanConfigSet/CanController_1/CanControllerBaudrateConfig_0/CanTxArbitrationStartDelay - 12 
/Can/CanConfigSet/CanController_1/CanControllerDefaultBaudrate - /Can_43_FLEXCAN/Can/CanConfigSet/CanController_1/CanControllerBaudrateConfig_0 
/Can/CanConfigSet/CanController_1/CanControllerEdgeFilter - false 
/Can/CanConfigSet/CanController_1/CanControllerFdISO - true 
/Can/CanConfigSet/CanController_1/CanControllerId - 1 
/Can/CanConfigSet/CanController_1/CanControllerPrExcEn - false 
/Can/CanConfigSet/CanController_1/CanCpuClockRef - /Mcu/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/FLEXCAN_PE_CLK3_5 
/Can/CanConfigSet/CanController_1/CanCpuClockRefAlternate - /Mcu/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/FLEXCAN_PE_CLK0_2 
/Can/CanConfigSet/CanController_1/CanHwChannel - FLEXCAN_4 
/Can/CanConfigSet/CanController_1/CanLoopBackMode - false 
/Can/CanConfigSet/CanController_1/CanRxFiFo - CanRxFiFo 
/Can/CanConfigSet/CanController_1/CanRxFiFo/CanLegacyFiFo - CanRxFiFo 
/Can/CanConfigSet/CanController_1/CanRxFiFo/CanRxFiFo/CanFiFoDmaErrorNotif - NULL_PTR 
/Can/CanConfigSet/CanController_1/CanRxFiFo/CanRxFiFo/CanFiFoOverflowNotif - MBDT_FlexCAN4_FifoOverflowNotif 
/Can/CanConfigSet/CanController_1/CanRxFiFo/CanRxFiFo/CanFiFoWarnNotif - MBDT_FlexCAN4_FifoWarnNotif 
/Can/CanConfigSet/CanController_1/CanRxFiFo/CanRxFiFo/CanIdAcceptanceMode - FORMAT_A 
/Can/CanConfigSet/CanController_1/CanRxFiFo/CanRxFiFo/CanLegacyFIFOGlobalMask0 - 0 
/Can/CanConfigSet/CanController_1/CanRxFiFo/CanRxFiFo/CanLegacyFIFOGlobalMask1 - 0 
/Can/CanConfigSet/CanController_1/CanRxFiFo/CanRxFiFo/CanLegacyFIFOGlobalMask2 - 0 
/Can/CanConfigSet/CanController_1/CanRxFiFo/CanRxFiFo/CanLegacyFIFOGlobalMask3 - 0 
/Can/CanConfigSet/CanController_1/CanRxFiFo/CanRxFiFo/CanLegacyFiFoDmaEnable - false 
/Can/CanConfigSet/CanController_1/CanRxFiFo/Choice - CanLegacyFiFo 
/Can/CanConfigSet/CanController_1/CanRxProcessing - MIXED 
/Can/CanConfigSet/CanController_1/CanTrippleSamplingEnable - false 
/Can/CanConfigSet/CanController_1/CanTxProcessing - MIXED 
/Can/CanConfigSet/CanController_1/CanWakeupFunctionalityAPI - false 
/Can/CanConfigSet/CanController_1/CanWakeupProcessing - POLLING 
/Can/CanConfigSet/CanController_1/CanWakeupSupport - false 
/Can/CanConfigSet/CanHardwareObject - CanHardwareObject_Can0_Rx_Ext_Interrupt CanHardwareObject_Can0_Rx_FIFO CanHardwareObject_Can0_Rx_Std_Polling CanHardwareObject_Can0_Tx_Interrupt CanHardwareObject_Can0_Tx_Polling CanHardwareObject_Can4_Rx_Ext_Interrupt CanHardwareObject_Can4_Rx_FIFO CanHardwareObject_Can4_Rx_Std_Polling CanHardwareObject_Can4_Tx_Interrupt CanHardwareObject_Can4_Tx_Polling 
/Can/CanConfigSet/CanHardwareObject_Can0_Rx_Ext_Interrupt/CanControllerRef - /Can_43_FLEXCAN/Can/CanConfigSet/CanController_0 
/Can/CanConfigSet/CanHardwareObject_Can0_Rx_Ext_Interrupt/CanHandleType - BASIC 
/Can/CanConfigSet/CanHardwareObject_Can0_Rx_Ext_Interrupt/CanHardwareObjectUsesPolling - false 
/Can/CanConfigSet/CanHardwareObject_Can0_Rx_Ext_Interrupt/CanHwFilter - CanHwFilter_0 
/Can/CanConfigSet/CanHardwareObject_Can0_Rx_Ext_Interrupt/CanHwFilter_0/CanHwFilterCode - 0 
/Can/CanConfigSet/CanHardwareObject_Can0_Rx_Ext_Interrupt/CanHwFilter_0/CanHwFilterMask - 0 
/Can/CanConfigSet/CanHardwareObject_Can0_Rx_Ext_Interrupt/CanHwObjectCount - 1 
/Can/CanConfigSet/CanHardwareObject_Can0_Rx_Ext_Interrupt/CanIdType - EXTENDED 
/Can/CanConfigSet/CanHardwareObject_Can0_Rx_Ext_Interrupt/CanObjectId - 2 
/Can/CanConfigSet/CanHardwareObject_Can0_Rx_Ext_Interrupt/CanObjectType - RECEIVE 
/Can/CanConfigSet/CanHardwareObject_Can0_Rx_FIFO/CanControllerRef - /Can_43_FLEXCAN/Can/CanConfigSet/CanController_0 
/Can/CanConfigSet/CanHardwareObject_Can0_Rx_FIFO/CanHandleType - BASIC 
/Can/CanConfigSet/CanHardwareObject_Can0_Rx_FIFO/CanHardwareObjectUsesPolling - false 
/Can/CanConfigSet/CanHardwareObject_Can0_Rx_FIFO/CanHwFilter - CanHwFilter_0 CanHwFilter_1 CanHwFilter_2 CanHwFilter_3 CanHwFilter_4 CanHwFilter_5 CanHwFilter_6 CanHwFilter_7 
/Can/CanConfigSet/CanHardwareObject_Can0_Rx_FIFO/CanHwFilter_0/CanHwFilterCode - 1008 
/Can/CanConfigSet/CanHardwareObject_Can0_Rx_FIFO/CanHwFilter_0/CanHwFilterMask - 536870911 
/Can/CanConfigSet/CanHardwareObject_Can0_Rx_FIFO/CanHwFilter_1/CanHwFilterCode - 1009 
/Can/CanConfigSet/CanHardwareObject_Can0_Rx_FIFO/CanHwFilter_1/CanHwFilterMask - 536870911 
/Can/CanConfigSet/CanHardwareObject_Can0_Rx_FIFO/CanHwFilter_2/CanHwFilterCode - 1010 
/Can/CanConfigSet/CanHardwareObject_Can0_Rx_FIFO/CanHwFilter_2/CanHwFilterMask - 536870911 
/Can/CanConfigSet/CanHardwareObject_Can0_Rx_FIFO/CanHwFilter_3/CanHwFilterCode - 1011 
/Can/CanConfigSet/CanHardwareObject_Can0_Rx_FIFO/CanHwFilter_3/CanHwFilterMask - 536870911 
/Can/CanConfigSet/CanHardwareObject_Can0_Rx_FIFO/CanHwFilter_4/CanHwFilterCode - 1012 
/Can/CanConfigSet/CanHardwareObject_Can0_Rx_FIFO/CanHwFilter_4/CanHwFilterMask - 536870911 
/Can/CanConfigSet/CanHardwareObject_Can0_Rx_FIFO/CanHwFilter_5/CanHwFilterCode - 1013 
/Can/CanConfigSet/CanHardwareObject_Can0_Rx_FIFO/CanHwFilter_5/CanHwFilterMask - 536870911 
/Can/CanConfigSet/CanHardwareObject_Can0_Rx_FIFO/CanHwFilter_6/CanHwFilterCode - 1014 
/Can/CanConfigSet/CanHardwareObject_Can0_Rx_FIFO/CanHwFilter_6/CanHwFilterMask - 536870911 
/Can/CanConfigSet/CanHardwareObject_Can0_Rx_FIFO/CanHwFilter_7/CanHwFilterCode - 1015 
/Can/CanConfigSet/CanHardwareObject_Can0_Rx_FIFO/CanHwFilter_7/CanHwFilterMask - 536870911 
/Can/CanConfigSet/CanHardwareObject_Can0_Rx_FIFO/CanHwObjectCount - 6 
/Can/CanConfigSet/CanHardwareObject_Can0_Rx_FIFO/CanIdType - EXTENDED 
/Can/CanConfigSet/CanHardwareObject_Can0_Rx_FIFO/CanObjectId - 0 
/Can/CanConfigSet/CanHardwareObject_Can0_Rx_FIFO/CanObjectType - RECEIVE 
/Can/CanConfigSet/CanHardwareObject_Can0_Rx_Std_Polling/CanControllerRef - /Can_43_FLEXCAN/Can/CanConfigSet/CanController_0 
/Can/CanConfigSet/CanHardwareObject_Can0_Rx_Std_Polling/CanHandleType - BASIC 
/Can/CanConfigSet/CanHardwareObject_Can0_Rx_Std_Polling/CanHardwareObjectUsesPolling - true 
/Can/CanConfigSet/CanHardwareObject_Can0_Rx_Std_Polling/CanHwFilter - CanHwFilter_0 
/Can/CanConfigSet/CanHardwareObject_Can0_Rx_Std_Polling/CanHwFilter_0/CanHwFilterCode - 0 
/Can/CanConfigSet/CanHardwareObject_Can0_Rx_Std_Polling/CanHwFilter_0/CanHwFilterMask - 0 
/Can/CanConfigSet/CanHardwareObject_Can0_Rx_Std_Polling/CanHwObjectCount - 1 
/Can/CanConfigSet/CanHardwareObject_Can0_Rx_Std_Polling/CanIdType - STANDARD 
/Can/CanConfigSet/CanHardwareObject_Can0_Rx_Std_Polling/CanMainFunctionRWPeriodRef - /Can_43_FLEXCAN/Can/CanGeneral/CanMainFunctionRWPeriods_0 
/Can/CanConfigSet/CanHardwareObject_Can0_Rx_Std_Polling/CanObjectId - 1 
/Can/CanConfigSet/CanHardwareObject_Can0_Rx_Std_Polling/CanObjectType - RECEIVE 
/Can/CanConfigSet/CanHardwareObject_Can0_Tx_Interrupt/CanControllerRef - /Can_43_FLEXCAN/Can/CanConfigSet/CanController_0 
/Can/CanConfigSet/CanHardwareObject_Can0_Tx_Interrupt/CanHandleType - BASIC 
/Can/CanConfigSet/CanHardwareObject_Can0_Tx_Interrupt/CanHardwareObjectUsesPolling - false 
/Can/CanConfigSet/CanHardwareObject_Can0_Tx_Interrupt/CanHwFilter - CanHwFilter_0 
/Can/CanConfigSet/CanHardwareObject_Can0_Tx_Interrupt/CanHwFilter_0/CanHwFilterCode - 0 
/Can/CanConfigSet/CanHardwareObject_Can0_Tx_Interrupt/CanHwFilter_0/CanHwFilterMask - 0 
/Can/CanConfigSet/CanHardwareObject_Can0_Tx_Interrupt/CanHwObjectCount - 1 
/Can/CanConfigSet/CanHardwareObject_Can0_Tx_Interrupt/CanIdType - MIXED 
/Can/CanConfigSet/CanHardwareObject_Can0_Tx_Interrupt/CanObjectId - 7 
/Can/CanConfigSet/CanHardwareObject_Can0_Tx_Interrupt/CanObjectType - TRANSMIT 
/Can/CanConfigSet/CanHardwareObject_Can0_Tx_Polling/CanControllerRef - /Can_43_FLEXCAN/Can/CanConfigSet/CanController_0 
/Can/CanConfigSet/CanHardwareObject_Can0_Tx_Polling/CanHandleType - BASIC 
/Can/CanConfigSet/CanHardwareObject_Can0_Tx_Polling/CanHardwareObjectUsesPolling - true 
/Can/CanConfigSet/CanHardwareObject_Can0_Tx_Polling/CanHwFilter - CanHwFilter_0 
/Can/CanConfigSet/CanHardwareObject_Can0_Tx_Polling/CanHwFilter_0/CanHwFilterCode - 0 
/Can/CanConfigSet/CanHardwareObject_Can0_Tx_Polling/CanHwFilter_0/CanHwFilterMask - 0 
/Can/CanConfigSet/CanHardwareObject_Can0_Tx_Polling/CanHwObjectCount - 1 
/Can/CanConfigSet/CanHardwareObject_Can0_Tx_Polling/CanIdType - MIXED 
/Can/CanConfigSet/CanHardwareObject_Can0_Tx_Polling/CanMainFunctionRWPeriodRef - /Can_43_FLEXCAN/Can/CanGeneral/CanMainFunctionRWPeriods_0 
/Can/CanConfigSet/CanHardwareObject_Can0_Tx_Polling/CanObjectId - 6 
/Can/CanConfigSet/CanHardwareObject_Can0_Tx_Polling/CanObjectType - TRANSMIT 
/Can/CanConfigSet/CanHardwareObject_Can4_Rx_Ext_Interrupt/CanControllerRef - /Can_43_FLEXCAN/Can/CanConfigSet/CanController_1 
/Can/CanConfigSet/CanHardwareObject_Can4_Rx_Ext_Interrupt/CanHandleType - BASIC 
/Can/CanConfigSet/CanHardwareObject_Can4_Rx_Ext_Interrupt/CanHardwareObjectUsesPolling - false 
/Can/CanConfigSet/CanHardwareObject_Can4_Rx_Ext_Interrupt/CanHwFilter - CanHwFilter_0 
/Can/CanConfigSet/CanHardwareObject_Can4_Rx_Ext_Interrupt/CanHwFilter_0/CanHwFilterCode - 0 
/Can/CanConfigSet/CanHardwareObject_Can4_Rx_Ext_Interrupt/CanHwFilter_0/CanHwFilterMask - 0 
/Can/CanConfigSet/CanHardwareObject_Can4_Rx_Ext_Interrupt/CanHwObjectCount - 1 
/Can/CanConfigSet/CanHardwareObject_Can4_Rx_Ext_Interrupt/CanIdType - EXTENDED 
/Can/CanConfigSet/CanHardwareObject_Can4_Rx_Ext_Interrupt/CanObjectId - 5 
/Can/CanConfigSet/CanHardwareObject_Can4_Rx_Ext_Interrupt/CanObjectType - RECEIVE 
/Can/CanConfigSet/CanHardwareObject_Can4_Rx_FIFO/CanControllerRef - /Can_43_FLEXCAN/Can/CanConfigSet/CanController_1 
/Can/CanConfigSet/CanHardwareObject_Can4_Rx_FIFO/CanHandleType - BASIC 
/Can/CanConfigSet/CanHardwareObject_Can4_Rx_FIFO/CanHardwareObjectUsesPolling - false 
/Can/CanConfigSet/CanHardwareObject_Can4_Rx_FIFO/CanHwFilter - CanHwFilter_0 CanHwFilter_1 CanHwFilter_2 CanHwFilter_3 CanHwFilter_4 CanHwFilter_5 CanHwFilter_6 CanHwFilter_7 
/Can/CanConfigSet/CanHardwareObject_Can4_Rx_FIFO/CanHwFilter_0/CanHwFilterCode - 1008 
/Can/CanConfigSet/CanHardwareObject_Can4_Rx_FIFO/CanHwFilter_0/CanHwFilterMask - 536870911 
/Can/CanConfigSet/CanHardwareObject_Can4_Rx_FIFO/CanHwFilter_1/CanHwFilterCode - 1009 
/Can/CanConfigSet/CanHardwareObject_Can4_Rx_FIFO/CanHwFilter_1/CanHwFilterMask - 536870911 
/Can/CanConfigSet/CanHardwareObject_Can4_Rx_FIFO/CanHwFilter_2/CanHwFilterCode - 1010 
/Can/CanConfigSet/CanHardwareObject_Can4_Rx_FIFO/CanHwFilter_2/CanHwFilterMask - 536870911 
/Can/CanConfigSet/CanHardwareObject_Can4_Rx_FIFO/CanHwFilter_3/CanHwFilterCode - 1011 
/Can/CanConfigSet/CanHardwareObject_Can4_Rx_FIFO/CanHwFilter_3/CanHwFilterMask - 536870911 
/Can/CanConfigSet/CanHardwareObject_Can4_Rx_FIFO/CanHwFilter_4/CanHwFilterCode - 1012 
/Can/CanConfigSet/CanHardwareObject_Can4_Rx_FIFO/CanHwFilter_4/CanHwFilterMask - 536870911 
/Can/CanConfigSet/CanHardwareObject_Can4_Rx_FIFO/CanHwFilter_5/CanHwFilterCode - 1013 
/Can/CanConfigSet/CanHardwareObject_Can4_Rx_FIFO/CanHwFilter_5/CanHwFilterMask - 536870911 
/Can/CanConfigSet/CanHardwareObject_Can4_Rx_FIFO/CanHwFilter_6/CanHwFilterCode - 1014 
/Can/CanConfigSet/CanHardwareObject_Can4_Rx_FIFO/CanHwFilter_6/CanHwFilterMask - 536870911 
/Can/CanConfigSet/CanHardwareObject_Can4_Rx_FIFO/CanHwFilter_7/CanHwFilterCode - 1015 
/Can/CanConfigSet/CanHardwareObject_Can4_Rx_FIFO/CanHwFilter_7/CanHwFilterMask - 536870911 
/Can/CanConfigSet/CanHardwareObject_Can4_Rx_FIFO/CanHwObjectCount - 6 
/Can/CanConfigSet/CanHardwareObject_Can4_Rx_FIFO/CanIdType - EXTENDED 
/Can/CanConfigSet/CanHardwareObject_Can4_Rx_FIFO/CanObjectId - 3 
/Can/CanConfigSet/CanHardwareObject_Can4_Rx_FIFO/CanObjectType - RECEIVE 
/Can/CanConfigSet/CanHardwareObject_Can4_Rx_Std_Polling/CanControllerRef - /Can_43_FLEXCAN/Can/CanConfigSet/CanController_1 
/Can/CanConfigSet/CanHardwareObject_Can4_Rx_Std_Polling/CanHandleType - BASIC 
/Can/CanConfigSet/CanHardwareObject_Can4_Rx_Std_Polling/CanHardwareObjectUsesPolling - true 
/Can/CanConfigSet/CanHardwareObject_Can4_Rx_Std_Polling/CanHwFilter - CanHwFilter_0 
/Can/CanConfigSet/CanHardwareObject_Can4_Rx_Std_Polling/CanHwFilter_0/CanHwFilterCode - 0 
/Can/CanConfigSet/CanHardwareObject_Can4_Rx_Std_Polling/CanHwFilter_0/CanHwFilterMask - 0 
/Can/CanConfigSet/CanHardwareObject_Can4_Rx_Std_Polling/CanHwObjectCount - 1 
