Caler10/RBCM_S32K344_AUTOSAR_MBD/Firmware/S32K344_DAPlink/S32K344_LED/S32K344_LED_ert_rtw/MW_target_hardware_resources.h
/Can/CanConfigSet/CanHardwareObject_Can4_Rx_Std_Polling/CanIdType - STANDARD 
/Can/CanConfigSet/CanHardwareObject_Can4_Rx_Std_Polling/CanMainFunctionRWPeriodRef - /Can_43_FLEXCAN/Can/CanGeneral/CanMainFunctionRWPeriods_0 
/Can/CanConfigSet/CanHardwareObject_Can4_Rx_Std_Polling/CanObjectId - 4 
/Can/CanConfigSet/CanHardwareObject_Can4_Rx_Std_Polling/CanObjectType - RECEIVE 
/Can/CanConfigSet/CanHardwareObject_Can4_Tx_Interrupt/CanControllerRef - /Can_43_FLEXCAN/Can/CanConfigSet/CanController_1 
/Can/CanConfigSet/CanHardwareObject_Can4_Tx_Interrupt/CanHandleType - BASIC 
/Can/CanConfigSet/CanHardwareObject_Can4_Tx_Interrupt/CanHardwareObjectUsesPolling - false 
/Can/CanConfigSet/CanHardwareObject_Can4_Tx_Interrupt/CanHwFilter - CanHwFilter_0 
/Can/CanConfigSet/CanHardwareObject_Can4_Tx_Interrupt/CanHwFilter_0/CanHwFilterCode - 0 
/Can/CanConfigSet/CanHardwareObject_Can4_Tx_Interrupt/CanHwFilter_0/CanHwFilterMask - 0 
/Can/CanConfigSet/CanHardwareObject_Can4_Tx_Interrupt/CanHwObjectCount - 1 
/Can/CanConfigSet/CanHardwareObject_Can4_Tx_Interrupt/CanIdType - MIXED 
/Can/CanConfigSet/CanHardwareObject_Can4_Tx_Interrupt/CanObjectId - 9 
/Can/CanConfigSet/CanHardwareObject_Can4_Tx_Interrupt/CanObjectType - TRANSMIT 
/Can/CanConfigSet/CanHardwareObject_Can4_Tx_Polling/CanControllerRef - /Can_43_FLEXCAN/Can/CanConfigSet/CanController_1 
/Can/CanConfigSet/CanHardwareObject_Can4_Tx_Polling/CanHandleType - BASIC 
/Can/CanConfigSet/CanHardwareObject_Can4_Tx_Polling/CanHardwareObjectUsesPolling - true 
/Can/CanConfigSet/CanHardwareObject_Can4_Tx_Polling/CanHwFilter - CanHwFilter_0 
/Can/CanConfigSet/CanHardwareObject_Can4_Tx_Polling/CanHwFilter_0/CanHwFilterCode - 0 
/Can/CanConfigSet/CanHardwareObject_Can4_Tx_Polling/CanHwFilter_0/CanHwFilterMask - 0 
/Can/CanConfigSet/CanHardwareObject_Can4_Tx_Polling/CanHwObjectCount - 1 
/Can/CanConfigSet/CanHardwareObject_Can4_Tx_Polling/CanIdType - MIXED 
/Can/CanConfigSet/CanHardwareObject_Can4_Tx_Polling/CanMainFunctionRWPeriodRef - /Can_43_FLEXCAN/Can/CanGeneral/CanMainFunctionRWPeriods_0 
/Can/CanConfigSet/CanHardwareObject_Can4_Tx_Polling/CanObjectId - 8 
/Can/CanConfigSet/CanHardwareObject_Can4_Tx_Polling/CanObjectType - TRANSMIT 
/Can/CanGeneral - CanGeneral 
/Can/CanGeneral/CanApiEnableMbAbort - true 
/Can/CanGeneral/CanDevErrorDetect - true 
/Can/CanGeneral/CanEnableDualClockMode - false 
/Can/CanGeneral/CanEnableSecurityEventReporting - false 
/Can/CanGeneral/CanEnableUserModeSupport - false 
/Can/CanGeneral/CanGlobalTimeSupport - false 
/Can/CanGeneral/CanIndex - 0 
/Can/CanGeneral/CanMBCountExtensionSupport - false 
/Can/CanGeneral/CanMainFunctionModePeriod - 0.001 
/Can/CanGeneral/CanMainFunctionRWPeriods - CanMainFunctionRWPeriods_0 
/Can/CanGeneral/CanMainFunctionRWPeriods_0/CanMainFunctionPeriod - 0.001 
/Can/CanGeneral/CanMulticoreSupport - false 
/Can/CanGeneral/CanMultiplexedTransmission - true 
/Can/CanGeneral/CanSetBaudrateApi - true 
/Can/CanGeneral/CanTimeoutDuration - 1.0 
/Can/CanGeneral/CanTimeoutMethod - OSIF_COUNTER_DUMMY 
/Can/CanGeneral/CanVersionInfoApi - true 
/Can/CommonPublishedInformation - CommonPublishedInformation 
/Can/CommonPublishedInformation/ArReleaseMajorVersion - 4 
/Can/CommonPublishedInformation/ArReleaseMinorVersion - 7 
/Can/CommonPublishedInformation/ArReleaseRevisionVersion - 0 
/Can/CommonPublishedInformation/ModuleId - 80 
/Can/CommonPublishedInformation/SwMajorVersion - 3 
/Can/CommonPublishedInformation/SwMinorVersion - 0 
/Can/CommonPublishedInformation/SwPatchVersion - 0 
/Can/CommonPublishedInformation/VendorApiInfix - FLEXCAN 
/Can/CommonPublishedInformation/VendorId - 43 
/Can/IMPLEMENTATION-CONFIG-VARIANT - VARIANT-PRE-COMPILE 
/Can/POST_BUILD_VARIANT_USED - false 

*/
#define MW_DETAILS_CAN_43_FLEXCAN 
#define MW_OPEN_CAN_43_FLEXCAN 
#define MW_UPDATE_CAN_43_FLEXCAN 
#define MW_RESTORE_CAN_43_FLEXCAN 
#define MW_CANIF_INFO /*
/CanIf - CanIf 
/CanIf/CanIfCtrlDrvCfg - CanIfCtrlDrvCfg_0 
/CanIf/CanIfCtrlDrvCfg_0/CanIfCtrlCfg - CanIfCtrlCfg_0 CanIfCtrlCfg_1 
/CanIf/CanIfCtrlDrvCfg_0/CanIfCtrlCfg_0/CanIfCtrlCanCtrlRef - /Can_43_FLEXCAN/Can/CanConfigSet/CanController_0 
/CanIf/CanIfCtrlDrvCfg_0/CanIfCtrlCfg_0/CanIfCtrlId - 0 
/CanIf/CanIfCtrlDrvCfg_0/CanIfCtrlCfg_1/CanIfCtrlCanCtrlRef - /Can_43_FLEXCAN/Can/CanConfigSet/CanController_1 
/CanIf/CanIfCtrlDrvCfg_0/CanIfCtrlCfg_1/CanIfCtrlId - 1 
/CanIf/CanIfCtrlDrvCfg_0/CanIfCtrlDrvNameRef - /Can_43_FLEXCAN/Can/CanGeneral 
/CanIf/CanIfDispatchCfg - CanIfDispatchCfg 
/CanIf/CanIfDispatchCfg/CanIfDispatchUserCtrlBusOffUL - CDD 
/CanIf/CanIfInitCfg - CanIfInitCfg 
/CanIf/CanIfPublicCfg - CanIfPublicCfg 
/CanIf/CanIfPublicCfg/CanIfDevErrorDetect - false 
/CanIf/IMPLEMENTATION-CONFIG-VARIANT - VARIANT-PRE-COMPILE 
/CanIf/POST_BUILD_VARIANT_USED - false 

*/
#define MW_DETAILS_CANIF 
#define MW_OPEN_CANIF 
#define MW_UPDATE_CANIF 
#define MW_RESTORE_CANIF 
#define MW_DIO_INFO /*
/Dio - Dio 
/Dio/CommonPublishedInformation - CommonPublishedInformation 
/Dio/CommonPublishedInformation/ArReleaseMajorVersion - 4 
/Dio/CommonPublishedInformation/ArReleaseMinorVersion - 4 
/Dio/CommonPublishedInformation/ArReleaseRevisionVersion - 0 
/Dio/CommonPublishedInformation/ModuleId - 120 
/Dio/CommonPublishedInformation/SwMajorVersion - 2 
/Dio/CommonPublishedInformation/SwMinorVersion - 0 
/Dio/CommonPublishedInformation/SwPatchVersion - 0 
/Dio/CommonPublishedInformation/VendorId - 43 
/Dio/DioConfig - DioConfig 
/Dio/DioConfig/DioPort - PTA_H PTB_H PTC_H PTD_L PTE_L 
/Dio/DioConfig/PTA_H/DioChannel - RGBLED0_BLUE RGBLED0_GREEN RGBLED0_RED 
/Dio/DioConfig/PTA_H/DioPortId - 1 
/Dio/DioConfig/PTA_H/RGBLED0_BLUE/DioChannelId - 15 
/Dio/DioConfig/PTA_H/RGBLED0_BLUE/PDACSlot - VIRTUAL_WRAPPER_PDAC0 
/Dio/DioConfig/PTA_H/RGBLED0_GREEN/DioChannelId - 14 
/Dio/DioConfig/PTA_H/RGBLED0_GREEN/PDACSlot - VIRTUAL_WRAPPER_PDAC0 
/Dio/DioConfig/PTA_H/RGBLED0_RED/DioChannelId - 13 
/Dio/DioConfig/PTA_H/RGBLED0_RED/PDACSlot - VIRTUAL_WRAPPER_PDAC0 
/Dio/DioConfig/PTB_H/DioChannel - RGBLED1_GREEN RGBLED1_RED USER_SW0 USER_SW1 
/Dio/DioConfig/PTB_H/DioPortId - 3 
/Dio/DioConfig/PTB_H/RGBLED1_GREEN/DioChannelId - 9 
/Dio/DioConfig/PTB_H/RGBLED1_GREEN/PDACSlot - VIRTUAL_WRAPPER_PDAC0 
/Dio/DioConfig/PTB_H/RGBLED1_RED/DioChannelId - 2 
/Dio/DioConfig/PTB_H/RGBLED1_RED/PDACSlot - VIRTUAL_WRAPPER_PDAC0 
/Dio/DioConfig/PTB_H/USER_SW0/DioChannelId - 10 
/Dio/DioConfig/PTB_H/USER_SW0/PDACSlot - VIRTUAL_WRAPPER_PDAC0 
/Dio/DioConfig/PTB_H/USER_SW1/DioChannelId - 3 
/Dio/DioConfig/PTB_H/USER_SW1/PDACSlot - VIRTUAL_WRAPPER_PDAC0 
/Dio/DioConfig/PTC_H/CanController_0_EN/DioChannelId - 5 
/Dio/DioConfig/PTC_H/CanController_0_EN/PDACSlot - VIRTUAL_WRAPPER_PDAC0 
/Dio/DioConfig/PTC_H/CanController_0_ERRN/DioChannelId - 7 
/Dio/DioConfig/PTC_H/CanController_0_ERRN/PDACSlot - VIRTUAL_WRAPPER_PDAC0 
/Dio/DioConfig/PTC_H/CanController_0_STB/DioChannelId - 4 
/Dio/DioConfig/PTC_H/CanController_0_STB/PDACSlot - VIRTUAL_WRAPPER_PDAC0 
/Dio/DioConfig/PTC_H/DioChannel - CanController_0_EN CanController_0_ERRN CanController_0_STB 
/Dio/DioConfig/PTC_H/DioPortId - 5 
/Dio/DioConfig/PTD_L/CanController_1_EN/DioChannelId - 15 
/Dio/DioConfig/PTD_L/CanController_1_EN/PDACSlot - VIRTUAL_WRAPPER_PDAC0 
/Dio/DioConfig/PTD_L/CanController_1_STB/DioChannelId - 13 
/Dio/DioConfig/PTD_L/CanController_1_STB/PDACSlot - VIRTUAL_WRAPPER_PDAC0 
/Dio/DioConfig/PTD_L/DioChannel - CanController_1_EN CanController_1_STB 
/Dio/DioConfig/PTD_L/DioPortId - 6 
/Dio/DioConfig/PTE_L/CanController_1_ERRN/DioChannelId - 8 
/Dio/DioConfig/PTE_L/CanController_1_ERRN/PDACSlot - VIRTUAL_WRAPPER_PDAC0 
/Dio/DioConfig/PTE_L/DioChannel - CanController_1_ERRN RGBLED1_BLUE 
/Dio/DioConfig/PTE_L/DioPortId - 8 
/Dio/DioConfig/PTE_L/RGBLED1_BLUE/DioChannelId - 12 
/Dio/DioConfig/PTE_L/RGBLED1_BLUE/PDACSlot - VIRTUAL_WRAPPER_PDAC0 
/Dio/DioGeneral - DioGeneral 
/Dio/DioGeneral/DioDevErrorDetect - true 
/Dio/DioGeneral/DioEnableUserModeSupport - false 
/Dio/DioGeneral/DioFlipChannelApi - true 
/Dio/DioGeneral/DioMaskedWritePortApi - true 
/Dio/DioGeneral/DioMulticoreSupport - false 
/Dio/DioGeneral/DioReadZeroForUndefinedPortPins - false 
/Dio/DioGeneral/DioReversePortBits - false 
/Dio/DioGeneral/DioVersionInfoApi - true 
/Dio/DioGeneral/DioVirtWrapperSupport - false 
/Dio/DioGeneral/SIUL2DioIPDevErrorDetect - true 
/Dio/IMPLEMENTATION-CONFIG-VARIANT - VARIANT-PRE-COMPILE 
/Dio/POST_BUILD_VARIANT_USED - false 

*/
#define MW_DETAILS_DIO 
#define MW_OPEN_DIO 
#define MW_UPDATE_DIO 
#define MW_RESTORE_DIO 
#define MW_GPT_INFO /*
/Gpt - Gpt 
/Gpt/CommonPublishedInformation - CommonPublishedInformation 
/Gpt/CommonPublishedInformation/ArReleaseMajorVersion - 4 
/Gpt/CommonPublishedInformation/ArReleaseMinorVersion - 4 
/Gpt/CommonPublishedInformation/ArReleaseRevisionVersion - 0 
/Gpt/CommonPublishedInformation/ModuleId - 100 
/Gpt/CommonPublishedInformation/SwMajorVersion - 2 
/Gpt/CommonPublishedInformation/SwMinorVersion - 0 
/Gpt/CommonPublishedInformation/SwPatchVersion - 0 
/Gpt/CommonPublishedInformation/VendorId - 43 
/Gpt/GptAutosarExt - GptAutosarExt 
/Gpt/GptAutosarExt/ChainModeApi - false 
/Gpt/GptAutosarExt/GptChangeNextTimeoutValueApi - false 
/Gpt/GptAutosarExt/GptEnableDualClockMode - false 
/Gpt/GptAutosarExt/GptEnableTriggers - false 
/Gpt/GptAutosarExt/GptEnableUserModeSupport - false 
/Gpt/GptAutosarExt/GptStandbyWakeupSupport - false 
/Gpt/GptChannelConfigSet - GptChannelConfigSet 
/Gpt/GptChannelConfigSet/GptChannelConfiguration - GptChannelConfiguration_0 GptChannelConfiguration_1 ProfilerTimer StepTimer 
/Gpt/GptChannelConfigSet/GptChannelConfiguration_0/GptChannelClkSrcRef - /Gpt/Gpt/GptDriverConfiguration/GptClockReferencePoint_0 
/Gpt/GptChannelConfigSet/GptChannelConfiguration_0/GptChannelId - 0 
/Gpt/GptChannelConfigSet/GptChannelConfiguration_0/GptChannelMode - GPT_CH_MODE_CONTINUOUS 
/Gpt/GptChannelConfigSet/GptChannelConfiguration_0/GptChannelTickValueMax - 4294967295 
/Gpt/GptChannelConfigSet/GptChannelConfiguration_0/GptEnableWakeup - false 
/Gpt/GptChannelConfigSet/GptChannelConfiguration_0/GptHwIp - PIT 
/Gpt/GptChannelConfigSet/GptChannelConfiguration_0/GptModuleRef - /Gpt/Gpt/GptChannelConfigSet/GptPit_0/GptPitChannels_0 
/Gpt/GptChannelConfigSet/GptChannelConfiguration_0/GptNotification - Gpt_PitNotification 
/Gpt/GptChannelConfigSet/GptChannelConfiguration_1/GptChannelClkSrcRef - /Gpt/Gpt/GptDriverConfiguration/GptClockReferencePoint_0 
/Gpt/GptChannelConfigSet/GptChannelConfiguration_1/GptChannelId - 1 
/Gpt/GptChannelConfigSet/GptChannelConfiguration_1/GptChannelMode - GPT_CH_MODE_ONESHOT 
/Gpt/GptChannelConfigSet/GptChannelConfiguration_1/GptChannelTickValueMax - 4294967295 
/Gpt/GptChannelConfigSet/GptChannelConfiguration_1/GptEnableWakeup - true 
/Gpt/GptChannelConfigSet/GptChannelConfiguration_1/GptHwIp - PIT 
/Gpt/GptChannelConfigSet/GptChannelConfiguration_1/GptModuleRef - /Gpt/Gpt/GptChannelConfigSet/GptPit_0/GptPitChannels_1 
/Gpt/GptChannelConfigSet/GptChannelConfiguration_1/GptWakeupConfiguration - GptWakeupConfiguration 
/Gpt/GptChannelConfigSet/GptChannelConfiguration_1/GptWakeupConfiguration/GptWakeupSourceRef - /EcuM/EcuM/EcuMConfiguration_0/EcuMCommonConfiguration/EcuMWakeupSource_0 
/Gpt/GptChannelConfigSet/GptPit - GptPit_0 
/Gpt/GptChannelConfigSet/GptPit_0/GptPitChannels - GptPitChannels_0 GptPitChannels_1 GptPitChannels_2 GptPitChannels_3 
/Gpt/GptChannelConfigSet/GptPit_0/GptPitChannels_0/ChainMode - false 
/Gpt/GptChannelConfigSet/GptPit_0/GptPitChannels_0/GptPitChannel - CH_0 
/Gpt/GptChannelConfigSet/GptPit_0/GptPitChannels_1/ChainMode - false 
/Gpt/GptChannelConfigSet/GptPit_0/GptPitChannels_1/GptPitChannel - CH_RTI 
/Gpt/GptChannelConfigSet/GptPit_0/GptPitChannels_2/ChainMode - false 
/Gpt/GptChannelConfigSet/GptPit_0/GptPitChannels_2/GptPitChannel - CH_2 
/Gpt/GptChannelConfigSet/GptPit_0/GptPitChannels_3/ChainMode - false 
/Gpt/GptChannelConfigSet/GptPit_0/GptPitChannels_3/GptPitChannel - CH_3 
/Gpt/GptChannelConfigSet/GptPit_0/GptPitModule - PIT_0 
/Gpt/GptChannelConfigSet/GptPit_0/PitFreezeEnable - false 
/Gpt/GptChannelConfigSet/ProfilerTimer/GptChannelClkSrcRef - /Gpt/Gpt/GptDriverConfiguration/GptClockReferencePoint_0 
/Gpt/GptChannelConfigSet/ProfilerTimer/GptChannelId - 3 
/Gpt/GptChannelConfigSet/ProfilerTimer/GptChannelMode - GPT_CH_MODE_CONTINUOUS 
/Gpt/GptChannelConfigSet/ProfilerTimer/GptChannelTickValueMax - 4294967295 
/Gpt/GptChannelConfigSet/ProfilerTimer/GptEnableWakeup - false 
/Gpt/GptChannelConfigSet/ProfilerTimer/GptHwIp - PIT 
/Gpt/GptChannelConfigSet/ProfilerTimer/GptModuleRef - /Gpt/Gpt/GptChannelConfigSet/GptPit_0/GptPitChannels_3 
/Gpt/GptChannelConfigSet/StepTimer/GptChannelClkSrcRef - /Gpt/Gpt/GptDriverConfiguration/GptClockReferencePoint_0 
/Gpt/GptChannelConfigSet/StepTimer/GptChannelId - 2 
/Gpt/GptChannelConfigSet/StepTimer/GptChannelMode - GPT_CH_MODE_CONTINUOUS 
/Gpt/GptChannelConfigSet/StepTimer/GptChannelTickValueMax - 4294967295 
/Gpt/GptChannelConfigSet/StepTimer/GptEnableWakeup - false 
/Gpt/GptChannelConfigSet/StepTimer/GptHwIp - PIT 
/Gpt/GptChannelConfigSet/StepTimer/GptModuleRef - /Gpt/Gpt/GptChannelConfigSet/GptPit_0/GptPitChannels_2 
/Gpt/GptChannelConfigSet/StepTimer/GptNotification - MBDT_Step_Handler 
/Gpt/GptConfigurationOfOptApiServices - GptConfigurationOfOptApiServices 
/Gpt/GptConfigurationOfOptApiServices/GptDeinitApi - true 
/Gpt/GptConfigurationOfOptApiServices/GptEnableDisableNotificationApi - true 
/Gpt/GptConfigurationOfOptApiServices/GptPredefTimerFunctionalityApi - true 
/Gpt/GptConfigurationOfOptApiServices/GptTimeElapsedApi - true 
/Gpt/GptConfigurationOfOptApiServices/GptTimeRemainingApi - true 
/Gpt/GptConfigurationOfOptApiServices/GptVersionInfoApi - true 
/Gpt/GptConfigurationOfOptApiServices/GptWakeupFunctionalityApi - true 
/Gpt/GptDriverConfiguration - GptDriverConfiguration 
/Gpt/GptDriverConfiguration/GptClockReferencePoint - GptClockReferencePoint_0 
/Gpt/GptDriverConfiguration/GptClockReferencePoint_0/GptClockReference - /Mcu/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/GPT_CLK 
/Gpt/GptDriverConfiguration/GptDevErrorDetect - true 
/Gpt/GptDriverConfiguration/GptMulticoreSupport - false 
/Gpt/GptDriverConfiguration/GptPredefTimer100us32bitEnable - false 
/Gpt/GptDriverConfiguration/GptPredefTimer1usEnablingGrade - GPT_PREDEF_TIMER_1US_DISABLED 
/Gpt/GptDriverConfiguration/GptReportWakeupSource - true 
/Gpt/GptDriverConfiguration/GptTimeoutDuration - 65535 
/Gpt/GptDriverConfiguration/GptTimeoutMethod - OSIF_COUNTER_SYSTEM 
/Gpt/GptHwConfiguration - GptHwConfiguration_0 GptHwConfiguration_1 GptHwConfiguration_10 GptHwConfiguration_11 GptHwConfiguration_12 GptHwConfiguration_13 GptHwConfiguration_14 GptHwConfiguration_15 GptHwConfiguration_16 GptHwConfiguration_17 GptHwConfiguration_18 GptHwConfiguration_19 GptHwConfiguration_2 GptHwConfiguration_20 GptHwConfiguration_21 GptHwConfiguration_22 GptHwConfiguration_23 GptHwConfiguration_24 GptHwConfiguration_25 GptHwConfiguration_26 GptHwConfiguration_27 GptHwConfiguration_28 GptHwConfiguration_29 GptHwConfiguration_3 GptHwConfiguration_30 GptHwConfiguration_31 GptHwConfiguration_32 GptHwConfiguration_33 GptHwConfiguration_34 GptHwConfiguration_35 GptHwConfiguration_36 GptHwConfiguration_37 GptHwConfiguration_38 GptHwConfiguration_39 GptHwConfiguration_4 GptHwConfiguration_40 GptHwConfiguration_41 GptHwConfiguration_42 GptHwConfiguration_43 GptHwConfiguration_44 GptHwConfiguration_45 GptHwConfiguration_5 GptHwConfiguration_6 GptHwConfiguration_7 GptHwConfiguration_8 GptHwConfiguration_9 
/Gpt/GptHwConfiguration_0/GptChannelIsUsed - false 
/Gpt/GptHwConfiguration_0/GptIsrEnable - false 
/Gpt/GptHwConfiguration_0/GptIsrHwId - STM_0_CH_0 
/Gpt/GptHwConfiguration_1/GptChannelIsUsed - false 
/Gpt/GptHwConfiguration_1/GptIsrEnable - false 
/Gpt/GptHwConfiguration_1/GptIsrHwId - STM_0_CH_1 
/Gpt/GptHwConfiguration_10/GptChannelIsUsed - false 
/Gpt/GptHwConfiguration_10/GptIsrEnable - false 
/Gpt/GptHwConfiguration_10/GptIsrHwId - PIT_0_CH_1 
/Gpt/GptHwConfiguration_11/GptChannelIsUsed - true 
/Gpt/GptHwConfiguration_11/GptIsrEnable - true 
/Gpt/GptHwConfiguration_11/GptIsrHwId - PIT_0_CH_2 
/Gpt/GptHwConfiguration_12/GptChannelIsUsed - true 
/Gpt/GptHwConfiguration_12/GptIsrEnable - true 
/Gpt/GptHwConfiguration_12/GptIsrHwId - PIT_0_CH_3 
/Gpt/GptHwConfiguration_13/GptChannelIsUsed - false 
/Gpt/GptHwConfiguration_13/GptIsrEnable - false 
/Gpt/GptHwConfiguration_13/GptIsrHwId - PIT_1_CH_0 
/Gpt/GptHwConfiguration_14/GptChannelIsUsed - false 
/Gpt/GptHwConfiguration_14/GptIsrEnable - false 
/Gpt/GptHwConfiguration_14/GptIsrHwId - PIT_1_CH_1 
/Gpt/GptHwConfiguration_15/GptChannelIsUsed - false 
/Gpt/GptHwConfiguration_15/GptIsrEnable - false 
/Gpt/GptHwConfiguration_15/GptIsrHwId - PIT_1_CH_2 
/Gpt/GptHwConfiguration_16/GptChannelIsUsed - false 
/Gpt/GptHwConfiguration_16/GptIsrEnable - false 
/Gpt/GptHwConfiguration_16/GptIsrHwId - PIT_1_CH_3 
/Gpt/GptHwConfiguration_17/GptChannelIsUsed - false 
/Gpt/GptHwConfiguration_17/GptIsrEnable - false 
/Gpt/GptHwConfiguration_17/GptIsrHwId - PIT_2_CH_0 
/Gpt/GptHwConfiguration_18/GptChannelIsUsed - false 
/Gpt/GptHwConfiguration_18/GptIsrEnable - false 
/Gpt/GptHwConfiguration_18/GptIsrHwId - PIT_2_CH_1 
/Gpt/GptHwConfiguration_19/GptChannelIsUsed - false 
/Gpt/GptHwConfiguration_19/GptIsrEnable - false 
/Gpt/GptHwConfiguration_19/GptIsrHwId - PIT_2_CH_2 
/Gpt/GptHwConfiguration_2/GptChannelIsUsed - false 
/Gpt/GptHwConfiguration_2/GptIsrEnable - false 
/Gpt/GptHwConfiguration_2/GptIsrHwId - STM_0_CH_2 
/Gpt/GptHwConfiguration_20/GptChannelIsUsed - false 
/Gpt/GptHwConfiguration_20/GptIsrEnable - false 
/Gpt/GptHwConfiguration_20/GptIsrHwId - PIT_2_CH_3 
/Gpt/GptHwConfiguration_21/GptChannelIsUsed - false 
/Gpt/GptHwConfiguration_21/GptIsrEnable - false 
/Gpt/GptHwConfiguration_21/GptIsrHwId - EMIOS_0_CH_0 
/Gpt/GptHwConfiguration_22/GptChannelIsUsed - false 
/Gpt/GptHwConfiguration_22/GptIsrEnable - false 
/Gpt/GptHwConfiguration_22/GptIsrHwId - EMIOS_0_CH_1 
/Gpt/GptHwConfiguration_23/GptChannelIsUsed - false 
/Gpt/GptHwConfiguration_23/GptIsrEnable - false 
/Gpt/GptHwConfiguration_23/GptIsrHwId - EMIOS_0_CH_2 
/Gpt/GptHwConfiguration_24/GptChannelIsUsed - false 
/Gpt/GptHwConfiguration_24/GptIsrEnable - false 
/Gpt/GptHwConfiguration_24/GptIsrHwId - EMIOS_0_CH_3 
/Gpt/GptHwConfiguration_25/GptChannelIsUsed - false 
/Gpt/GptHwConfiguration_25/GptIsrEnable - false 
/Gpt/GptHwConfiguration_25/GptIsrHwId - EMIOS_0_CH_4 
/Gpt/GptHwConfiguration_26/GptChannelIsUsed - false 
/Gpt/GptHwConfiguration_26/GptIsrEnable - false 
/Gpt/GptHwConfiguration_26/GptIsrHwId - EMIOS_0_CH_5 
/Gpt/GptHwConfiguration_27/GptChannelIsUsed - false 
/Gpt/GptHwConfiguration_27/GptIsrEnable - false 
/Gpt/GptHwConfiguration_27/GptIsrHwId - EMIOS_0_CH_6 
/Gpt/GptHwConfiguration_28/GptChannelIsUsed - false 
/Gpt/GptHwConfiguration_28/GptIsrEnable - false 
/Gpt/GptHwConfiguration_28/GptIsrHwId - EMIOS_0_CH_7 
/Gpt/GptHwConfiguration_29/GptChannelIsUsed - false 
/Gpt/GptHwConfiguration_29/GptIsrEnable - false 
/Gpt/GptHwConfiguration_29/GptIsrHwId - EMIOS_0_CH_8 
/Gpt/GptHwConfiguration_3/GptChannelIsUsed - false 
/Gpt/GptHwConfiguration_3/GptIsrEnable - false 
/Gpt/GptHwConfiguration_3/GptIsrHwId - STM_0_CH_3 
/Gpt/GptHwConfiguration_30/GptChannelIsUsed - false 
/Gpt/GptHwConfiguration_30/GptIsrEnable - false 
/Gpt/GptHwConfiguration_30/GptIsrHwId - EMIOS_0_CH_16 
/Gpt/GptHwConfiguration_31/GptChannelIsUsed - false 
/Gpt/GptHwConfiguration_31/GptIsrEnable - false 
/Gpt/GptHwConfiguration_31/GptIsrHwId - EMIOS_0_CH_22 
/Gpt/GptHwConfiguration_32/GptChannelIsUsed - false 
/Gpt/GptHwConfiguration_32/GptIsrEnable - false 
/Gpt/GptHwConfiguration_32/GptIsrHwId - EMIOS_0_CH_23 
/Gpt/GptHwConfiguration_33/GptChannelIsUsed - false 
/Gpt/GptHwConfiguration_33/GptIsrEnable - false 
/Gpt/GptHwConfiguration_33/GptIsrHwId - EMIOS_1_CH_0 
/Gpt/GptHwConfiguration_34/GptChannelIsUsed - false 
/Gpt/GptHwConfiguration_34/GptIsrEnable - false 
/Gpt/GptHwConfiguration_34/GptIsrHwId - EMIOS_1_CH_8 
/Gpt/GptHwConfiguration_35/GptChannelIsUsed - false 
/Gpt/GptHwConfiguration_35/GptIsrEnable - false 
/Gpt/GptHwConfiguration_35/GptIsrHwId - EMIOS_1_CH_16 
/Gpt/GptHwConfiguration_36/GptChannelIsUsed - false 
/Gpt/GptHwConfiguration_36/GptIsrEnable - false 
/Gpt/GptHwConfiguration_36/GptIsrHwId - EMIOS_1_CH_22 
/Gpt/GptHwConfiguration_37/GptChannelIsUsed - false 
/Gpt/GptHwConfiguration_37/GptIsrEnable - false 
/Gpt/GptHwConfiguration_37/GptIsrHwId - EMIOS_1_CH_23 
/Gpt/GptHwConfiguration_38/GptChannelIsUsed - false 
/Gpt/GptHwConfiguration_38/GptIsrEnable - false 
/Gpt/GptHwConfiguration_38/GptIsrHwId - EMIOS_2_CH_0 
/Gpt/GptHwConfiguration_39/GptChannelIsUsed - false 
/Gpt/GptHwConfiguration_39/GptIsrEnable - false 
/Gpt/GptHwConfiguration_39/GptIsrHwId - EMIOS_2_CH_8 
/Gpt/GptHwConfiguration_4/GptChannelIsUsed - false 
/Gpt/GptHwConfiguration_4/GptIsrEnable - false 
/Gpt/GptHwConfiguration_4/GptIsrHwId - STM_1_CH_0 
/Gpt/GptHwConfiguration_40/GptChannelIsUsed - false 
/Gpt/GptHwConfiguration_40/GptIsrEnable - false 
/Gpt/GptHwConfiguration_40/GptIsrHwId - EMIOS_2_CH_16 
/Gpt/GptHwConfiguration_41/GptChannelIsUsed - false 
/Gpt/GptHwConfiguration_41/GptIsrEnable - false 
/Gpt/GptHwConfiguration_41/GptIsrHwId - EMIOS_2_CH_22 
/Gpt/GptHwConfiguration_42/GptChannelIsUsed - false 
/Gpt/GptHwConfiguration_42/GptIsrEnable - false 
/Gpt/GptHwConfiguration_42/GptIsrHwId - EMIOS_2_CH_23 
/Gpt/GptHwConfiguration_43/GptChannelIsUsed - false 
/Gpt/GptHwConfiguration_43/GptIsrEnable - false 
/Gpt/GptHwConfiguration_43/GptIsrHwId - RTC_0_CH_0 
/Gpt/GptHwConfiguration_44/GptChannelIsUsed - false 
/Gpt/GptHwConfiguration_44/GptIsrEnable - false 
/Gpt/GptHwConfiguration_44/GptIsrHwId - STM_0_PREDEF 
/Gpt/GptHwConfiguration_45/GptChannelIsUsed - false 
/Gpt/GptHwConfiguration_45/GptIsrEnable - false 
/Gpt/GptHwConfiguration_45/GptIsrHwId - STM_1_PREDEF 
/Gpt/GptHwConfiguration_5/GptChannelIsUsed - false 
/Gpt/GptHwConfiguration_5/GptIsrEnable - false 
/Gpt/GptHwConfiguration_5/GptIsrHwId - STM_1_CH_1 
/Gpt/GptHwConfiguration_6/GptChannelIsUsed - false 
/Gpt/GptHwConfiguration_6/GptIsrEnable - false 
/Gpt/GptHwConfiguration_6/GptIsrHwId - STM_1_CH_2 
/Gpt/GptHwConfiguration_7/GptChannelIsUsed - false 
/Gpt/GptHwConfiguration_7/GptIsrEnable - false 
/Gpt/GptHwConfiguration_7/GptIsrHwId - STM_1_CH_3 
/Gpt/GptHwConfiguration_8/GptChannelIsUsed - true 
/Gpt/GptHwConfiguration_8/GptIsrEnable - true 
/Gpt/GptHwConfiguration_8/GptIsrHwId - PIT_0_CH_RTI 
/Gpt/GptHwConfiguration_9/GptChannelIsUsed - true 
/Gpt/GptHwConfiguration_9/GptIsrEnable - true 
/Gpt/GptHwConfiguration_9/GptIsrHwId - PIT_0_CH_0 
/Gpt/GptPredefTimerConfiguration - GptPredefTimerConfiguration 
/Gpt/IMPLEMENTATION-CONFIG-VARIANT - VARIANT-POST-BUILD 
/Gpt/POST_BUILD_VARIANT_USED - true 

