Caler10/RBCM_S32K344_AUTOSAR_MBD/Firmware/S32K344_DAPlink/S32K344_LED/S32K344_LED_ert_rtw/MW_target_hardware_resources.h
*/
#define MW_DETAILS_GPT 
#define MW_OPEN_GPT 
#define MW_UPDATE_GPT 
#define MW_RESTORE_GPT 
#define MW_I2C_INFO /*
/I2c - I2c 
/I2c/CommonPublishedInformation - CommonPublishedInformation 
/I2c/CommonPublishedInformation/ArReleaseMajorVersion - 4 
/I2c/CommonPublishedInformation/ArReleaseMinorVersion - 7 
/I2c/CommonPublishedInformation/ArReleaseRevisionVersion - 0 
/I2c/CommonPublishedInformation/ModuleId - 255 
/I2c/CommonPublishedInformation/SwMajorVersion - 3 
/I2c/CommonPublishedInformation/SwMinorVersion - 0 
/I2c/CommonPublishedInformation/SwPatchVersion - 0 
/I2c/CommonPublishedInformation/VendorApiInfix -  
/I2c/CommonPublishedInformation/VendorId - 43 
/I2c/GeneralConfiguration - GeneralConfiguration 
/I2c/GeneralConfiguration/I2cCallback - MBDT_I2c_Callback 
/I2c/GeneralConfiguration/I2cDevErrorDetect - true 
/I2c/GeneralConfiguration/I2cDisableDemReportErrorStatus - true 
/I2c/GeneralConfiguration/I2cDmaOptimize - false 
/I2c/GeneralConfiguration/I2cDmaUsed - false 
/I2c/GeneralConfiguration/I2cEnableUserModeSupport - false 
/I2c/GeneralConfiguration/I2cFlexIOUsed - true 
/I2c/GeneralConfiguration/I2cMulticoreSupport - false 
/I2c/GeneralConfiguration/I2cTimeoutDuration - 65535 
/I2c/GeneralConfiguration/I2cTimeoutMethod - OSIF_COUNTER_DUMMY 
/I2c/GeneralConfiguration/I2cVersionInfoApi - true 
/I2c/GeneralConfiguration/VendorId - 0 
/I2c/I2cGlobalConfig - I2cGlobalConfig 
/I2c/I2cGlobalConfig/I2cChannel - I2cChannel_0 I2cChannel_1 
/I2c/I2cGlobalConfig/I2cChannel_0/I2cChannelId - 0 
/I2c/I2cGlobalConfig/I2cChannel_0/I2cFlexIOConfiguration - I2c_FlexIOChannel0 
/I2c/I2cGlobalConfig/I2cChannel_0/I2cHwChannel - FLEXIO_0_CH_2_3 
/I2c/I2cGlobalConfig/I2cChannel_0/I2cMasterConfiguration - I2cMasterConfiguration 
/I2c/I2cGlobalConfig/I2cChannel_0/I2cMasterConfiguration/I2cAsyncMethod - LPI2C_USING_INTERRUPTS 
/I2c/I2cGlobalConfig/I2cChannel_0/I2cMasterConfiguration/I2cBusIdleTimeout - 0 
/I2c/I2cGlobalConfig/I2cChannel_0/I2cMasterConfiguration/I2cClockHighPeriod - 1 
/I2c/I2cGlobalConfig/I2cChannel_0/I2cMasterConfiguration/I2cClockLowPeriod - 3 
/I2c/I2cGlobalConfig/I2cChannel_0/I2cMasterConfiguration/I2cDataValidDelay - 1 
/I2c/I2cGlobalConfig/I2cChannel_0/I2cMasterConfiguration/I2cGlitchFilterSCL - 0 
/I2c/I2cGlobalConfig/I2cChannel_0/I2cMasterConfiguration/I2cGlitchFilterSDA - 0 
/I2c/I2cGlobalConfig/I2cChannel_0/I2cMasterConfiguration/I2cHighSpeedModeConfiguration - I2cHighSpeedModeConfiguration 
/I2c/I2cGlobalConfig/I2cChannel_0/I2cMasterConfiguration/I2cHighSpeedModeConfiguration/I2cClockHighPeriod - 1 
/I2c/I2cGlobalConfig/I2cChannel_0/I2cMasterConfiguration/I2cHighSpeedModeConfiguration/I2cClockLowPeriod - 3 
/I2c/I2cGlobalConfig/I2cChannel_0/I2cMasterConfiguration/I2cHighSpeedModeConfiguration/I2cDataValidDelay - 1 
/I2c/I2cGlobalConfig/I2cChannel_0/I2cMasterConfiguration/I2cHighSpeedModeConfiguration/I2cMasterCode - 0 
/I2c/I2cGlobalConfig/I2cChannel_0/I2cMasterConfiguration/I2cHighSpeedModeConfiguration/I2cSetupHoldDelay - 2 
/I2c/I2cGlobalConfig/I2cChannel_0/I2cMasterConfiguration/I2cMasterFilterEnable - false 
/I2c/I2cGlobalConfig/I2cChannel_0/I2cMasterConfiguration/I2cPinLowTimeout - 0 
/I2c/I2cGlobalConfig/I2cChannel_0/I2cMasterConfiguration/I2cPrescaler - LPI2C_MASTER_PRESC_DIV_1 
/I2c/I2cGlobalConfig/I2cChannel_0/I2cMasterConfiguration/I2cSetupHoldDelay - 2 
/I2c/I2cGlobalConfig/I2cChannel_0/I2cSlaveConfiguration - I2cSlaveConfiguration 
/I2c/I2cGlobalConfig/I2cChannel_0/I2cSlaveConfiguration/I2cAsyncMethod - LPI2C_USING_INTERRUPTS 
/I2c/I2cGlobalConfig/I2cChannel_0/I2cSlaveConfiguration/I2cGlitchFilterSCL - 0 
/I2c/I2cGlobalConfig/I2cChannel_0/I2cSlaveConfiguration/I2cGlitchFilterSDA - 0 
/I2c/I2cGlobalConfig/I2cChannel_0/I2cSlaveConfiguration/I2cSlaveAddress - 0 
/I2c/I2cGlobalConfig/I2cChannel_0/I2cSlaveConfiguration/I2cSlaveFilterEnable - true 
/I2c/I2cGlobalConfig/I2cChannel_0/I2cSlaveConfiguration/I2cSlaveIs10BitAddress - false 
/I2c/I2cGlobalConfig/I2cChannel_0/I2cSlaveConfiguration/Lpi2cSlaveListening - false 
/I2c/I2cGlobalConfig/I2cChannel_0/I2c_FlexIOChannel0/FlexIO_clock - /Mcu/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/CORE_CLK 
/I2c/I2cGlobalConfig/I2cChannel_0/I2c_FlexIOChannel0/I2cAsyncMethod - FLEXIO_I2C_USING_INTERRUPTS 
/I2c/I2cGlobalConfig/I2cChannel_0/I2c_FlexIOChannel0/I2cDmaRxChannelRef - /Mcl/Mcl/MclConfig/dmaLogicChannel_Type_0 
/I2c/I2cGlobalConfig/I2cChannel_0/I2c_FlexIOChannel0/I2cDmaTxChannelRef - /Mcl/Mcl/MclConfig/dmaLogicChannel_Type_0 
/I2c/I2cGlobalConfig/I2cChannel_0/I2c_FlexIOChannel0/I2cFlexIOChannelPrescaler - DIV_16 
/I2c/I2cGlobalConfig/I2cChannel_0/I2c_FlexIOChannel0/I2cFlexIOCompareValue - 55 
/I2c/I2cGlobalConfig/I2cChannel_0/I2c_FlexIOChannel0/SclFlexioRef - /Mcl/Mcl/MclConfig/FlexioCommon_0/FlexioMclLogicChannels_Scl 
/I2c/I2cGlobalConfig/I2cChannel_0/I2c_FlexIOChannel0/SdaFlexioRef - /Mcl/Mcl/MclConfig/FlexioCommon_0/FlexioMclLogicChannels_Sda 
/I2c/I2cGlobalConfig/I2cChannel_1/I2cChannelId - 1 
/I2c/I2cGlobalConfig/I2cChannel_1/I2cFlexIOConfiguration - I2cFlexIOConfiguration 
/I2c/I2cGlobalConfig/I2cChannel_1/I2cFlexIOConfiguration/FlexIO_clock - /Mcu/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/CORE_CLK 
/I2c/I2cGlobalConfig/I2cChannel_1/I2cFlexIOConfiguration/I2cAsyncMethod - FLEXIO_I2C_USING_INTERRUPTS 
/I2c/I2cGlobalConfig/I2cChannel_1/I2cFlexIOConfiguration/I2cDmaRxChannelRef - /Mcl/Mcl/MclConfig/dmaLogicChannel_Type_0 
/I2c/I2cGlobalConfig/I2cChannel_1/I2cFlexIOConfiguration/I2cDmaTxChannelRef - /Mcl/Mcl/MclConfig/dmaLogicChannel_Type_0 
/I2c/I2cGlobalConfig/I2cChannel_1/I2cFlexIOConfiguration/I2cFlexIOChannelPrescaler - DIV_1 
/I2c/I2cGlobalConfig/I2cChannel_1/I2cFlexIOConfiguration/I2cFlexIOCompareValue - 8 
/I2c/I2cGlobalConfig/I2cChannel_1/I2cFlexIOConfiguration/SclFlexioRef - /Mcl/Mcl/MclConfig/FlexioCommon_0/FlexioMclLogicChannels_Rx 
/I2c/I2cGlobalConfig/I2cChannel_1/I2cFlexIOConfiguration/SdaFlexioRef - /Mcl/Mcl/MclConfig/FlexioCommon_0/FlexioMclLogicChannels_Rx 
/I2c/I2cGlobalConfig/I2cChannel_1/I2cHwChannel - LPI2C_1 
/I2c/I2cGlobalConfig/I2cChannel_1/I2cMasterConfiguration - I2cMasterConfiguration 
/I2c/I2cGlobalConfig/I2cChannel_1/I2cMasterConfiguration/I2cAsyncMethod - LPI2C_USING_INTERRUPTS 
/I2c/I2cGlobalConfig/I2cChannel_1/I2cMasterConfiguration/I2cBusIdleTimeout - 0 
/I2c/I2cGlobalConfig/I2cChannel_1/I2cMasterConfiguration/I2cClockHighPeriod - 1 
/I2c/I2cGlobalConfig/I2cChannel_1/I2cMasterConfiguration/I2cClockLowPeriod - 3 
/I2c/I2cGlobalConfig/I2cChannel_1/I2cMasterConfiguration/I2cDataValidDelay - 1 
/I2c/I2cGlobalConfig/I2cChannel_1/I2cMasterConfiguration/I2cGlitchFilterSCL - 0 
/I2c/I2cGlobalConfig/I2cChannel_1/I2cMasterConfiguration/I2cGlitchFilterSDA - 0 
/I2c/I2cGlobalConfig/I2cChannel_1/I2cMasterConfiguration/I2cHighSpeedModeConfiguration - I2cHighSpeedModeConfiguration 
/I2c/I2cGlobalConfig/I2cChannel_1/I2cMasterConfiguration/I2cHighSpeedModeConfiguration/I2cClockHighPeriod - 1 
/I2c/I2cGlobalConfig/I2cChannel_1/I2cMasterConfiguration/I2cHighSpeedModeConfiguration/I2cClockLowPeriod - 3 
/I2c/I2cGlobalConfig/I2cChannel_1/I2cMasterConfiguration/I2cHighSpeedModeConfiguration/I2cDataValidDelay - 1 
/I2c/I2cGlobalConfig/I2cChannel_1/I2cMasterConfiguration/I2cHighSpeedModeConfiguration/I2cMasterCode - 0 
/I2c/I2cGlobalConfig/I2cChannel_1/I2cMasterConfiguration/I2cHighSpeedModeConfiguration/I2cSetupHoldDelay - 2 
/I2c/I2cGlobalConfig/I2cChannel_1/I2cMasterConfiguration/I2cMasterFilterEnable - false 
/I2c/I2cGlobalConfig/I2cChannel_1/I2cMasterConfiguration/I2cPinLowTimeout - 0 
/I2c/I2cGlobalConfig/I2cChannel_1/I2cMasterConfiguration/I2cPrescaler - LPI2C_MASTER_PRESC_DIV_1 
/I2c/I2cGlobalConfig/I2cChannel_1/I2cMasterConfiguration/I2cSetupHoldDelay - 2 
/I2c/I2cGlobalConfig/I2cChannel_1/I2cMasterSlaveConfiguration - SLAVE_MODE 
/I2c/I2cGlobalConfig/I2cChannel_1/I2cOperatingMode - LPI2C_STANDARD_MODE 
/I2c/I2cGlobalConfig/I2cChannel_1/I2cSlaveConfiguration - I2c_Lpi2cSlaveChannel1 
/I2c/I2cGlobalConfig/I2cChannel_1/I2c_Lpi2cSlaveChannel1/I2cAsyncMethod - LPI2C_USING_INTERRUPTS 
/I2c/I2cGlobalConfig/I2cChannel_1/I2c_Lpi2cSlaveChannel1/I2cGlitchFilterSCL - 0 
/I2c/I2cGlobalConfig/I2cChannel_1/I2c_Lpi2cSlaveChannel1/I2cGlitchFilterSDA - 0 
/I2c/I2cGlobalConfig/I2cChannel_1/I2c_Lpi2cSlaveChannel1/I2cSlaveAddress - 50 
/I2c/I2cGlobalConfig/I2cChannel_1/I2c_Lpi2cSlaveChannel1/I2cSlaveFilterEnable - true 
/I2c/I2cGlobalConfig/I2cChannel_1/I2c_Lpi2cSlaveChannel1/I2cSlaveIs10BitAddress - false 
/I2c/I2cGlobalConfig/I2cChannel_1/I2c_Lpi2cSlaveChannel1/Lpi2cSlaveListening - false 
/I2c/IMPLEMENTATION-CONFIG-VARIANT - VARIANT-POST-BUILD 
/I2c/POST_BUILD_VARIANT_USED - true 

*/
#define MW_DETAILS_I2C 
#define MW_OPEN_I2C 
#define MW_UPDATE_I2C 
#define MW_RESTORE_I2C 
#define MW_ICU_INFO /*
/Icu - Icu 
/Icu/CommonPublishedInformation - CommonPublishedInformation 
/Icu/CommonPublishedInformation/ArReleaseMajorVersion - 4 
/Icu/CommonPublishedInformation/ArReleaseMinorVersion - 4 
/Icu/CommonPublishedInformation/ArReleaseRevisionVersion - 0 
/Icu/CommonPublishedInformation/ModuleId - 122 
/Icu/CommonPublishedInformation/SwMajorVersion - 2 
/Icu/CommonPublishedInformation/SwMinorVersion - 0 
/Icu/CommonPublishedInformation/SwPatchVersion - 0 
/Icu/CommonPublishedInformation/VendorId - 43 
/Icu/IMPLEMENTATION-CONFIG-VARIANT - VARIANT-POST-BUILD 
/Icu/IcuAutosarExt - IcuAutosarExt 
/Icu/IcuAutosarExt/IcuEnableDualClockMode - false 
/Icu/IcuAutosarExt/IcuGetCaptureRegisterValueApi - false 
/Icu/IcuAutosarExt/IcuGetInputLevelApi - false 
/Icu/IcuAutosarExt/IcuOverflowNotificationApi - true 
/Icu/IcuAutosarExt/IcuSetInitialCounterValue - false 
/Icu/IcuAutosarExt/IcuSetMaxCounterValue - false 
/Icu/IcuAutosarExt/IcuSupportSAICModeApi - false 
/Icu/IcuAutosarExt/IcuWkpuStandbyWakeupSupport - false 
/Icu/IcuConfigSet - IcuConfigSet 
/Icu/IcuConfigSet/IcuChannel - IcuChannel_0 IcuChannel_1 IcuChannel_2 IcuChannel_3 
/Icu/IcuConfigSet/IcuChannel_0/IcuChannelId - 0 
/Icu/IcuConfigSet/IcuChannel_0/IcuChannelRef - /Icu/Icu/IcuConfigSet/IcuSiul2_0/IcuSiul2Channels_0 
/Icu/IcuConfigSet/IcuChannel_0/IcuDMAChannelEnable - false 
/Icu/IcuConfigSet/IcuChannel_0/IcuDefaultStartEdge - ICU_RISING_EDGE 
/Icu/IcuConfigSet/IcuChannel_0/IcuMeasurementMode - ICU_MODE_SIGNAL_EDGE_DETECT 
/Icu/IcuConfigSet/IcuChannel_0/IcuOverflowNotification - NULL_PTR 
/Icu/IcuConfigSet/IcuChannel_0/IcuSignalEdgeDetection - IcuSignalEdgeDetection 
/Icu/IcuConfigSet/IcuChannel_0/IcuSignalEdgeDetection/IcuSignalNotification - MBDT_USER_SW0_callback 
/Icu/IcuConfigSet/IcuChannel_0/IcuWakeupCapability - false 
/Icu/IcuConfigSet/IcuChannel_1/IcuChannelId - 1 
/Icu/IcuConfigSet/IcuChannel_1/IcuChannelRef - /Icu/Icu/IcuConfigSet/IcueMios_2/IcueMios_2_Channel_1 
/Icu/IcuConfigSet/IcuChannel_1/IcuDMAChannelEnable - false 
/Icu/IcuConfigSet/IcuChannel_1/IcuDefaultStartEdge - ICU_RISING_EDGE 
/Icu/IcuConfigSet/IcuChannel_1/IcuMeasurementMode - ICU_MODE_SIGNAL_MEASUREMENT 
/Icu/IcuConfigSet/IcuChannel_1/IcuOverflowNotification - MBDT_ICU_OverflowNotif 
/Icu/IcuConfigSet/IcuChannel_1/IcuSignalMeasurement - IcuSignalMeasurement 
/Icu/IcuConfigSet/IcuChannel_1/IcuSignalMeasurement/IcuSignalMeasurementProperty - ICU_DUTY_CYCLE 
/Icu/IcuConfigSet/IcuChannel_1/IcuWakeupCapability - false 
/Icu/IcuConfigSet/IcuChannel_2/IcuChannelId - 2 
/Icu/IcuConfigSet/IcuChannel_2/IcuChannelRef - /Icu/Icu/IcuConfigSet/IcueMios_2/IcueMios_2_Channel_2 
/Icu/IcuConfigSet/IcuChannel_2/IcuDMAChannelEnable - false 
/Icu/IcuConfigSet/IcuChannel_2/IcuDefaultStartEdge - ICU_RISING_EDGE 
/Icu/IcuConfigSet/IcuChannel_2/IcuMeasurementMode - ICU_MODE_TIMESTAMP 
/Icu/IcuConfigSet/IcuChannel_2/IcuOverflowNotification - MBDT_ICU_OverflowNotif 
/Icu/IcuConfigSet/IcuChannel_2/IcuTimestampMeasurement - IcuTimestampMeasurement 
/Icu/IcuConfigSet/IcuChannel_2/IcuTimestampMeasurement/IcuTimestampMeasurementProperty - ICU_CIRCULAR_BUFFER 
/Icu/IcuConfigSet/IcuChannel_2/IcuTimestampMeasurement/IcuTimestampNotification - MBDT_ICU_Timestamp_Callback 
/Icu/IcuConfigSet/IcuChannel_2/IcuWakeupCapability - false 
/Icu/IcuConfigSet/IcuChannel_3/IcuChannelId - 3 
/Icu/IcuConfigSet/IcuChannel_3/IcuChannelRef - /Icu/Icu/IcuConfigSet/IcueMios_0/IcueMios_0_Channel_3 
/Icu/IcuConfigSet/IcuChannel_3/IcuDMAChannelEnable - false 
/Icu/IcuConfigSet/IcuChannel_3/IcuDefaultStartEdge - ICU_RISING_EDGE 
/Icu/IcuConfigSet/IcuChannel_3/IcuMeasurementMode - ICU_MODE_EDGE_COUNTER 
/Icu/IcuConfigSet/IcuChannel_3/IcuOverflowNotification - NULL_PTR 
/Icu/IcuConfigSet/IcuChannel_3/IcuWakeupCapability - false 
/Icu/IcuConfigSet/IcuHwInterruptConfigList - IcuHwInterruptConfigList_0 IcuHwInterruptConfigList_1 IcuHwInterruptConfigList_2 IcuHwInterruptConfigList_3 
/Icu/IcuConfigSet/IcuHwInterruptConfigList_0/IcuIsrEnable - true 
/Icu/IcuConfigSet/IcuHwInterruptConfigList_0/IcuIsrHwId - SIUL2_0_IRQ_CH_13 
/Icu/IcuConfigSet/IcuHwInterruptConfigList_1/IcuIsrEnable - true 
/Icu/IcuConfigSet/IcuHwInterruptConfigList_1/IcuIsrHwId - EMIOS_2_CH_1 
/Icu/IcuConfigSet/IcuHwInterruptConfigList_2/IcuIsrEnable - true 
/Icu/IcuConfigSet/IcuHwInterruptConfigList_2/IcuIsrHwId - EMIOS_2_CH_2 
/Icu/IcuConfigSet/IcuHwInterruptConfigList_3/IcuIsrEnable - true 
/Icu/IcuConfigSet/IcuHwInterruptConfigList_3/IcuIsrHwId - EMIOS_0_CH_3 
/Icu/IcuConfigSet/IcuMaxChannel - 4 
/Icu/IcuConfigSet/IcuSiul2 - IcuSiul2_0 
/Icu/IcuConfigSet/IcuSiul2_0/IcuEXT_ISR_AlternateInterruptFilterClockPrescaler - 0 
/Icu/IcuConfigSet/IcuSiul2_0/IcuEXT_ISR_InterruptFilterClockPrescaler - 0 
/Icu/IcuConfigSet/IcuSiul2_0/IcuSiul2Channels - IcuSiul2Channels_0 
/Icu/IcuConfigSet/IcuSiul2_0/IcuSiul2Channels_0/IcuSiul2Channel - 13 
/Icu/IcuConfigSet/IcuSiul2_0/IcuSiul2Channels_0/Icu_EXT_ISR_IFERDigitalFilter - false 
/Icu/IcuConfigSet/IcuSiul2_0/IcuSiul2Channels_0/Icu_EXT_ISR_IFMCDigitalFilter - 0 
/Icu/IcuConfigSet/IcuSiul2_0/IcuSiul2Instance - 0 
/Icu/IcuConfigSet/IcueMios - IcueMios_0 IcueMios_2 
/Icu/IcuConfigSet/IcueMios_0/IcueMiosChannels - IcueMios_0_Channel_3 
/Icu/IcuConfigSet/IcueMios_0/IcueMiosModule - 0 
/Icu/IcuConfigSet/IcueMios_0/IcueMios_0_Channel_3/IcuEmiosBusRef - /Mcl/Mcl/MclConfig/EmiosCommon_0/EmiosMclMasterBus_1 
/Icu/IcuConfigSet/IcueMios_0/IcueMios_0_Channel_3/IcuEmiosBusSelect - EMIOS_ICU_BUS_INTERNAL_COUNTER 
/Icu/IcuConfigSet/IcueMios_0/IcueMios_0_Channel_3/IcuEmiosDigitalFilter - EMIOS_DIGITAL_FILTER_BYPASSED 
/Icu/IcuConfigSet/IcueMios_0/IcueMios_0_Channel_3/IcuEmiosFreeze - false 
/Icu/IcuConfigSet/IcueMios_0/IcueMios_0_Channel_3/IcuEmiosPrescaler - EMIOS_PRESCALER_DIVIDE_1 
/Icu/IcuConfigSet/IcueMios_0/IcueMios_0_Channel_3/IcuEmiosPrescaler_Alternate - EMIOS_PRESCALER_DIVIDE_1 
/Icu/IcuConfigSet/IcueMios_0/IcueMios_0_Channel_3/IcuSignalMeasureWithoutInterrupt - false 
/Icu/IcuConfigSet/IcueMios_0/IcueMios_0_Channel_3/IcuSubModeforMeasurement - IPWM 
/Icu/IcuConfigSet/IcueMios_0/IcueMios_0_Channel_3/IcueMiosChannel - 3 
/Icu/IcuConfigSet/IcueMios_2/IcueMiosChannels - IcueMios_2_Channel_1 IcueMios_2_Channel_2 
/Icu/IcuConfigSet/IcueMios_2/IcueMiosModule - 2 
/Icu/IcuConfigSet/IcueMios_2/IcueMios_2_Channel_1/IcuEmiosBusRef - /Mcl/Mcl/MclConfig/EmiosCommon_2/EmiosMclMasterBus_1 
/Icu/IcuConfigSet/IcueMios_2/IcueMios_2_Channel_1/IcuEmiosBusSelect - EMIOS_ICU_BUS_DIVERSE 
/Icu/IcuConfigSet/IcueMios_2/IcueMios_2_Channel_1/IcuEmiosDigitalFilter - EMIOS_DIGITAL_FILTER_BYPASSED 
/Icu/IcuConfigSet/IcueMios_2/IcueMios_2_Channel_1/IcuEmiosFreeze - false 
/Icu/IcuConfigSet/IcueMios_2/IcueMios_2_Channel_1/IcuEmiosPrescaler - EMIOS_PRESCALER_DIVIDE_1 
/Icu/IcuConfigSet/IcueMios_2/IcueMios_2_Channel_1/IcuEmiosPrescaler_Alternate - EMIOS_PRESCALER_DIVIDE_1 
/Icu/IcuConfigSet/IcueMios_2/IcueMios_2_Channel_1/IcuSignalMeasureWithoutInterrupt - false 
/Icu/IcuConfigSet/IcueMios_2/IcueMios_2_Channel_1/IcuSubModeforMeasurement - IPWM 
/Icu/IcuConfigSet/IcueMios_2/IcueMios_2_Channel_1/IcueMiosChannel - 1 
/Icu/IcuConfigSet/IcueMios_2/IcueMios_2_Channel_2/IcuEmiosBusRef - /Mcl/Mcl/MclConfig/EmiosCommon_2/EmiosMclMasterBus_1 
/Icu/IcuConfigSet/IcueMios_2/IcueMios_2_Channel_2/IcuEmiosBusSelect - EMIOS_ICU_BUS_DIVERSE 
/Icu/IcuConfigSet/IcueMios_2/IcueMios_2_Channel_2/IcuEmiosDigitalFilter - EMIOS_DIGITAL_FILTER_BYPASSED 
/Icu/IcuConfigSet/IcueMios_2/IcueMios_2_Channel_2/IcuEmiosFreeze - false 
/Icu/IcuConfigSet/IcueMios_2/IcueMios_2_Channel_2/IcuEmiosPrescaler - EMIOS_PRESCALER_DIVIDE_1 
/Icu/IcuConfigSet/IcueMios_2/IcueMios_2_Channel_2/IcuEmiosPrescaler_Alternate - EMIOS_PRESCALER_DIVIDE_1 
/Icu/IcuConfigSet/IcueMios_2/IcueMios_2_Channel_2/IcuSignalMeasureWithoutInterrupt - false 
/Icu/IcuConfigSet/IcueMios_2/IcueMios_2_Channel_2/IcuSubModeforMeasurement - IPWM 
/Icu/IcuConfigSet/IcueMios_2/IcueMios_2_Channel_2/IcueMiosChannel - 2 
/Icu/IcuGeneral - IcuGeneral 
/Icu/IcuGeneral/IcuDevErrorDetect - true 
/Icu/IcuGeneral/IcuEnableUserModeSupport - false 
/Icu/IcuGeneral/IcuMulticoreSupport - false 
/Icu/IcuGeneral/IcuReportWakeupSource - true 
/Icu/IcuOptionalApis - IcuOptionalApis 
/Icu/IcuOptionalApis/IcuDeInitApi - true 
/Icu/IcuOptionalApis/IcuDisableWakeupApi - true 
/Icu/IcuOptionalApis/IcuEdgeCountApi - true 
/Icu/IcuOptionalApis/IcuEdgeDetectApi - true 
/Icu/IcuOptionalApis/IcuEnableWakeupApi - true 
/Icu/IcuOptionalApis/IcuGetDutyCycleValuesApi - true 
/Icu/IcuOptionalApis/IcuGetInputStateApi - true 
/Icu/IcuOptionalApis/IcuGetTimeElapsedApi - true 
/Icu/IcuOptionalApis/IcuGetVersionInfoApi - true 
/Icu/IcuOptionalApis/IcuSetModeApi - true 
/Icu/IcuOptionalApis/IcuSignalMeasurementApi - true 
/Icu/IcuOptionalApis/IcuTimestampApi - true 
/Icu/IcuOptionalApis/IcuWakeupFunctionalityApi - true 
/Icu/POST_BUILD_VARIANT_USED - true 

*/
#define MW_DETAILS_ICU 
#define MW_OPEN_ICU 
#define MW_UPDATE_ICU 
#define MW_RESTORE_ICU 
#define MW_LIN_43_LPUART_FLEXIO_INFO /*
/Lin - Lin 
/Lin/AutosarExt - AutosarExt 
/Lin/AutosarExt/LinDisableDemReportErrorStatus - false 
/Lin/AutosarExt/LinEnableUserModeSupport - false 
/Lin/AutosarExt/LinFrameTimeoutDisable - true 
/Lin/CommonPublishedInformation - CommonPublishedInformation 
/Lin/CommonPublishedInformation/ArReleaseMajorVersion - 4 
/Lin/CommonPublishedInformation/ArReleaseMinorVersion - 7 
/Lin/CommonPublishedInformation/ArReleaseRevisionVersion - 0 
/Lin/CommonPublishedInformation/ModuleId - 82 
/Lin/CommonPublishedInformation/SwMajorVersion - 3 
/Lin/CommonPublishedInformation/SwMinorVersion - 0 
/Lin/CommonPublishedInformation/SwPatchVersion - 0 
/Lin/CommonPublishedInformation/VendorId - 43 
/Lin/IMPLEMENTATION-CONFIG-VARIANT - VARIANT-POST-BUILD 
/Lin/LinGeneral - LinGeneral 
/Lin/LinGeneral/LinDevErrorDetect - false 
/Lin/LinGeneral/LinIndex - 0 
/Lin/LinGeneral/LinMulticoreSupport - false 
/Lin/LinGeneral/LinTimeoutDuration - 65535 
/Lin/LinGeneral/LinTimeoutMethod - OSIF_COUNTER_DUMMY 
/Lin/LinGeneral/LinVersionInfoApi - true 
/Lin/LinGlobalConfig - LinGlobalConfig 
/Lin/LinGlobalConfig/LinChannel - LinChannel_0 LinChannel_1 
/Lin/LinGlobalConfig/LinChannel_0/BreakLength - BL_13 
/Lin/LinGlobalConfig/LinChannel_0/DetectedBreakLength - BL_11 
/Lin/LinGlobalConfig/LinChannel_0/LinChannelBaudRate - 19200 
/Lin/LinGlobalConfig/LinChannel_0/LinChannelId - 0 
/Lin/LinGlobalConfig/LinChannel_0/LinChannelWakeupSupport - false 
/Lin/LinGlobalConfig/LinChannel_0/LinClockRef - /Mcu/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/FLEXIO_CLK 
/Lin/LinGlobalConfig/LinChannel_0/LinFlexioRxControllerRef - /Mcl/Mcl/MclConfig/FlexioCommon_0/FlexioMclLogicChannels_Rx 
/Lin/LinGlobalConfig/LinChannel_0/LinFlexioTxControllerRef - /Mcl/Mcl/MclConfig/FlexioCommon_0/FlexioMclLogicChannels_Tx 
/Lin/LinGlobalConfig/LinChannel_0/LinHeaderTimeout - 44 
/Lin/LinGlobalConfig/LinChannel_0/LinHwChannel - FLEXIO_IP_0 
/Lin/LinGlobalConfig/LinChannel_0/LinNodeType - MASTER 
/Lin/LinGlobalConfig/LinChannel_0/LinResponseTimeout - 14 
/Lin/LinGlobalConfig/LinChannel_1/BreakLength - BL_13 
/Lin/LinGlobalConfig/LinChannel_1/DetectedBreakLength - BL_11 
/Lin/LinGlobalConfig/LinChannel_1/LinChannelBaudRate - 19200 
/Lin/LinGlobalConfig/LinChannel_1/LinChannelId - 1 
/Lin/LinGlobalConfig/LinChannel_1/LinChannelWakeupSupport - false 
/Lin/LinGlobalConfig/LinChannel_1/LinClockRef - /Mcu/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/UART_CLK 
/Lin/LinGlobalConfig/LinChannel_1/LinHeaderTimeout - 44 
/Lin/LinGlobalConfig/LinChannel_1/LinHwChannel - LPUART_IP_5 
/Lin/LinGlobalConfig/LinChannel_1/LinNodeType - SLAVE 
/Lin/LinGlobalConfig/LinChannel_1/LinResponseTimeout - 14 
/Lin/POST_BUILD_VARIANT_USED - true 

