Caler10/RBCM_S32K344_AUTOSAR_MBD/Firmware/S32K344_DAPlink/S32K344_LED/S32K344_LED_ert_rtw/MW_target_hardware_resources.h
*/
#define MW_DETAILS_LIN_43_LPUART_FLEXIO 
#define MW_OPEN_LIN_43_LPUART_FLEXIO 
#define MW_UPDATE_LIN_43_LPUART_FLEXIO 
#define MW_RESTORE_LIN_43_LPUART_FLEXIO 
#define MW_MCL_INFO /*
/Mcl - Mcl 
/Mcl/CommonPublishedInformation - CommonPublishedInformation 
/Mcl/IMPLEMENTATION-CONFIG-VARIANT - VARIANT-POST-BUILD 
/Mcl/MclConfig - MclConfig 
/Mcl/MclConfig/EmiosCommon - EmiosCommon_0 EmiosCommon_1 EmiosCommon_2 
/Mcl/MclConfig/EmiosCommon_0/EmiosMclClkDivVal - 1 
/Mcl/MclConfig/EmiosCommon_0/EmiosMclEnableFreezState - true 
/Mcl/MclConfig/EmiosCommon_0/EmiosMclEnableGlobalTimeBase - true 
/Mcl/MclConfig/EmiosCommon_0/EmiosMclInstances - EMIOS_0 
/Mcl/MclConfig/EmiosCommon_0/EmiosMclMasterBus - EmiosMclMasterBus_0 
/Mcl/MclConfig/EmiosCommon_0/EmiosMclMasterBus_0/EmiosMclChannelAllowDebugMode - true 
/Mcl/MclConfig/EmiosCommon_0/EmiosMclMasterBus_0/EmiosMclDefaultPeriod - 16000 
/Mcl/MclConfig/EmiosCommon_0/EmiosMclMasterBus_0/EmiosMclFirstOffsetValue - 0 
/Mcl/MclConfig/EmiosCommon_0/EmiosMclMasterBus_0/EmiosMclMasterBusAltPrescaler - DIV_1 
/Mcl/MclConfig/EmiosCommon_0/EmiosMclMasterBus_0/EmiosMclMasterBusModeType - MCB_UP_COUNTER 
/Mcl/MclConfig/EmiosCommon_0/EmiosMclMasterBus_0/EmiosMclMasterBusNumber - EMIOS_CH_23 
/Mcl/MclConfig/EmiosCommon_0/EmiosMclMasterBus_0/EmiosMclMasterBusPrescaler - DIV_1 
/Mcl/MclConfig/EmiosCommon_0/EmiosMclMasterBus_0/EmiosMclPwmExclusiveAccess - true 
/Mcl/MclConfig/EmiosCommon_1/EmiosMclClkDivVal - 1 
/Mcl/MclConfig/EmiosCommon_1/EmiosMclEnableFreezState - true 
/Mcl/MclConfig/EmiosCommon_1/EmiosMclEnableGlobalTimeBase - true 
/Mcl/MclConfig/EmiosCommon_1/EmiosMclInstances - EMIOS_1 
/Mcl/MclConfig/EmiosCommon_1/EmiosMclMasterBus - EmiosMclMasterBus_0 
/Mcl/MclConfig/EmiosCommon_1/EmiosMclMasterBus_0/EmiosMclChannelAllowDebugMode - true 
/Mcl/MclConfig/EmiosCommon_1/EmiosMclMasterBus_0/EmiosMclDefaultPeriod - 16000 
/Mcl/MclConfig/EmiosCommon_1/EmiosMclMasterBus_0/EmiosMclFirstOffsetValue - 0 
/Mcl/MclConfig/EmiosCommon_1/EmiosMclMasterBus_0/EmiosMclMasterBusAltPrescaler - DIV_1 
/Mcl/MclConfig/EmiosCommon_1/EmiosMclMasterBus_0/EmiosMclMasterBusModeType - MCB_UP_COUNTER 
/Mcl/MclConfig/EmiosCommon_1/EmiosMclMasterBus_0/EmiosMclMasterBusNumber - EMIOS_CH_23 
/Mcl/MclConfig/EmiosCommon_1/EmiosMclMasterBus_0/EmiosMclMasterBusPrescaler - DIV_1 
/Mcl/MclConfig/EmiosCommon_1/EmiosMclMasterBus_0/EmiosMclPwmExclusiveAccess - true 
/Mcl/MclConfig/EmiosCommon_2/EmiosMclClkDivVal - 160 
/Mcl/MclConfig/EmiosCommon_2/EmiosMclEnableFreezState - true 
/Mcl/MclConfig/EmiosCommon_2/EmiosMclEnableGlobalTimeBase - true 
/Mcl/MclConfig/EmiosCommon_2/EmiosMclInstances - EMIOS_2 
/Mcl/MclConfig/EmiosCommon_2/EmiosMclMasterBus - EmiosMclMasterBus_0 EmiosMclMasterBus_1 
/Mcl/MclConfig/EmiosCommon_2/EmiosMclMasterBus_0/EmiosMclChannelAllowDebugMode - true 
/Mcl/MclConfig/EmiosCommon_2/EmiosMclMasterBus_0/EmiosMclDefaultPeriod - 40000 
/Mcl/MclConfig/EmiosCommon_2/EmiosMclMasterBus_0/EmiosMclFirstOffsetValue - 0 
/Mcl/MclConfig/EmiosCommon_2/EmiosMclMasterBus_0/EmiosMclMasterBusAltPrescaler - DIV_10 
/Mcl/MclConfig/EmiosCommon_2/EmiosMclMasterBus_0/EmiosMclMasterBusModeType - MCB_UP_COUNTER 
/Mcl/MclConfig/EmiosCommon_2/EmiosMclMasterBus_0/EmiosMclMasterBusNumber - EMIOS_CH_23 
/Mcl/MclConfig/EmiosCommon_2/EmiosMclMasterBus_0/EmiosMclMasterBusPrescaler - DIV_10 
/Mcl/MclConfig/EmiosCommon_2/EmiosMclMasterBus_0/EmiosMclPwmExclusiveAccess - true 
/Mcl/MclConfig/EmiosCommon_2/EmiosMclMasterBus_1/EmiosMclChannelAllowDebugMode - true 
/Mcl/MclConfig/EmiosCommon_2/EmiosMclMasterBus_1/EmiosMclDefaultPeriod - 65535 
/Mcl/MclConfig/EmiosCommon_2/EmiosMclMasterBus_1/EmiosMclFirstOffsetValue - 0 
/Mcl/MclConfig/EmiosCommon_2/EmiosMclMasterBus_1/EmiosMclMasterBusAltPrescaler - DIV_10 
/Mcl/MclConfig/EmiosCommon_2/EmiosMclMasterBus_1/EmiosMclMasterBusModeType - MCB_UP_COUNTER 
/Mcl/MclConfig/EmiosCommon_2/EmiosMclMasterBus_1/EmiosMclMasterBusNumber - EMIOS_CH_0 
/Mcl/MclConfig/EmiosCommon_2/EmiosMclMasterBus_1/EmiosMclMasterBusPrescaler - DIV_10 
/Mcl/MclConfig/EmiosCommon_2/EmiosMclMasterBus_1/EmiosMclPwmExclusiveAccess - false 
/Mcl/MclConfig/FlexioCommon - FlexioCommon_0 
/Mcl/MclConfig/FlexioCommon_0/FlexioDebugEnable - false 
/Mcl/MclConfig/FlexioCommon_0/FlexioMclInstances - FLEXIO_0 
/Mcl/MclConfig/FlexioCommon_0/FlexioMclLogicChannels - FlexioMclLogicChannels_Rx FlexioMclLogicChannels_Scl FlexioMclLogicChannels_Sda FlexioMclLogicChannels_Tx 
/Mcl/MclConfig/FlexioCommon_0/FlexioMclLogicChannels_Rx/FlexioMclAddChannelEnable - false 
/Mcl/MclConfig/FlexioCommon_0/FlexioMclLogicChannels_Rx/FlexioMclAddChannelId - CHANNEL_0 
/Mcl/MclConfig/FlexioCommon_0/FlexioMclLogicChannels_Rx/FlexioMclAddPinEnable - false 
/Mcl/MclConfig/FlexioCommon_0/FlexioMclLogicChannels_Rx/FlexioMclAddPinId - PIN_0 
/Mcl/MclConfig/FlexioCommon_0/FlexioMclLogicChannels_Rx/FlexioMclChannelId - CHANNEL_0 
/Mcl/MclConfig/FlexioCommon_0/FlexioMclLogicChannels_Rx/FlexioMclPinId - PIN_28 
/Mcl/MclConfig/FlexioCommon_0/FlexioMclLogicChannels_Scl/FlexioMclAddChannelEnable - false 
/Mcl/MclConfig/FlexioCommon_0/FlexioMclLogicChannels_Scl/FlexioMclAddChannelId - CHANNEL_0 
/Mcl/MclConfig/FlexioCommon_0/FlexioMclLogicChannels_Scl/FlexioMclAddPinEnable - false 
/Mcl/MclConfig/FlexioCommon_0/FlexioMclLogicChannels_Scl/FlexioMclAddPinId - PIN_0 
/Mcl/MclConfig/FlexioCommon_0/FlexioMclLogicChannels_Scl/FlexioMclChannelId - CHANNEL_2 
/Mcl/MclConfig/FlexioCommon_0/FlexioMclLogicChannels_Scl/FlexioMclPinId - PIN_4 
/Mcl/MclConfig/FlexioCommon_0/FlexioMclLogicChannels_Sda/FlexioMclAddChannelEnable - false 
/Mcl/MclConfig/FlexioCommon_0/FlexioMclLogicChannels_Sda/FlexioMclAddChannelId - CHANNEL_0 
/Mcl/MclConfig/FlexioCommon_0/FlexioMclLogicChannels_Sda/FlexioMclAddPinEnable - false 
/Mcl/MclConfig/FlexioCommon_0/FlexioMclLogicChannels_Sda/FlexioMclAddPinId - PIN_0 
/Mcl/MclConfig/FlexioCommon_0/FlexioMclLogicChannels_Sda/FlexioMclChannelId - CHANNEL_3 
/Mcl/MclConfig/FlexioCommon_0/FlexioMclLogicChannels_Sda/FlexioMclPinId - PIN_5 
/Mcl/MclConfig/FlexioCommon_0/FlexioMclLogicChannels_Tx/FlexioMclAddChannelEnable - false 
/Mcl/MclConfig/FlexioCommon_0/FlexioMclLogicChannels_Tx/FlexioMclAddChannelId - CHANNEL_0 
/Mcl/MclConfig/FlexioCommon_0/FlexioMclLogicChannels_Tx/FlexioMclAddPinEnable - false 
/Mcl/MclConfig/FlexioCommon_0/FlexioMclLogicChannels_Tx/FlexioMclAddPinId - PIN_0 
/Mcl/MclConfig/FlexioCommon_0/FlexioMclLogicChannels_Tx/FlexioMclChannelId - CHANNEL_1 
/Mcl/MclConfig/FlexioCommon_0/FlexioMclLogicChannels_Tx/FlexioMclPinId - PIN_27 
/Mcl/MclConfig/dmaLogicChannel_Type - dmaLogicChannel_Type_0 
/Mcl/MclConfig/dmaLogicChannel_Type_0/dmaLogicChannel_ConfigType - dmaLogicChannel_ConfigType 
/Mcl/MclConfig/dmaLogicChannel_Type_0/dmaLogicChannel_ConfigType/dmaLogicChannel_GlobalConfigType - dmaLogicChannel_GlobalConfigType 
/Mcl/MclConfig/dmaLogicChannel_Type_0/dmaLogicChannel_ConfigType/dmaLogicChannel_GlobalConfigType/dmaLogicChannelConfig_GlobalControlType - dmaLogicChannelConfig_GlobalControlType 
/Mcl/MclConfig/dmaLogicChannel_Type_0/dmaLogicChannel_ConfigType/dmaLogicChannel_GlobalConfigType/dmaLogicChannelConfig_GlobalControlType/dmaGlobalControl_enBufferedWrites - false 
/Mcl/MclConfig/dmaLogicChannel_Type_0/dmaLogicChannel_ConfigType/dmaLogicChannel_GlobalConfigType/dmaLogicChannelConfig_GlobalControlType/dmaGlobalControl_enMasterIdReplication - false 
/Mcl/MclConfig/dmaLogicChannel_Type_0/dmaLogicChannel_ConfigType/dmaLogicChannel_GlobalConfigType/dmaLogicChannelConfig_GlobalInterruptType - dmaLogicChannelConfig_GlobalInterruptType 
/Mcl/MclConfig/dmaLogicChannel_Type_0/dmaLogicChannel_ConfigType/dmaLogicChannel_GlobalConfigType/dmaLogicChannelConfig_GlobalInterruptType/dmaGlobalInterrupt_enDmaErrorInterrupt - false 
/Mcl/MclConfig/dmaLogicChannel_Type_0/dmaLogicChannel_ConfigType/dmaLogicChannel_GlobalConfigType/dmaLogicChannelConfig_GlobalPriorityType - dmaLogicChannelConfig_GlobalPriorityType 
/Mcl/MclConfig/dmaLogicChannel_Type_0/dmaLogicChannel_ConfigType/dmaLogicChannel_GlobalConfigType/dmaLogicChannelConfig_GlobalPriorityType/dmaGlobalPriority_GroupPriority - DMA_IP_GROUP_PRIO0 
/Mcl/MclConfig/dmaLogicChannel_Type_0/dmaLogicChannel_ConfigType/dmaLogicChannel_GlobalConfigType/dmaLogicChannelConfig_GlobalPriorityType/dmaGlobalPriority_LevelPriority - DMA_IP_LEVEL_PRIO0 
/Mcl/MclConfig/dmaLogicChannel_Type_0/dmaLogicChannel_ConfigType/dmaLogicChannel_GlobalConfigType/dmaLogicChannelConfig_GlobalPriorityType/dmaGlobalPriority_disPreempt - false 
/Mcl/MclConfig/dmaLogicChannel_Type_0/dmaLogicChannel_ConfigType/dmaLogicChannel_GlobalConfigType/dmaLogicChannelConfig_GlobalPriorityType/dmaGlobalPriority_enPreemption - false 
/Mcl/MclConfig/dmaLogicChannel_Type_0/dmaLogicChannel_ConfigType/dmaLogicChannel_GlobalConfigType/dmaLogicChannelConfig_GlobalRequestType - dmaLogicChannelConfig_GlobalRequestType 
/Mcl/MclConfig/dmaLogicChannel_Type_0/dmaLogicChannel_ConfigType/dmaLogicChannel_GlobalConfigType/dmaLogicChannelConfig_GlobalRequestType/dmaGlobalRequest_enDmaRequest - false 
/Mcl/MclConfig/dmaLogicChannel_Type_0/dmaLogicChannel_ConfigType/dmaLogicChannel_ScatterGatherConfigType - dmaLogicChannel_ScatterGatherConfigType 
/Mcl/MclConfig/dmaLogicChannel_Type_0/dmaLogicChannel_ConfigType/dmaLogicChannel_TransferConfigType - dmaLogicChannel_TransferConfigType 
/Mcl/MclConfig/dmaLogicChannel_Type_0/dmaLogicChannel_ConfigType/dmaLogicChannel_TransferConfigType/dmaLogicChannelConfig_TransferControlType - dmaLogicChannelConfig_TransferControlType 
/Mcl/MclConfig/dmaLogicChannel_Type_0/dmaLogicChannel_ConfigType/dmaLogicChannel_TransferConfigType/dmaLogicChannelConfig_TransferControlType/dmaLogicChannelConfig_DestinationStoreAddressType -  
/Mcl/MclConfig/dmaLogicChannel_Type_0/dmaLogicChannel_ConfigType/dmaLogicChannel_TransferConfigType/dmaLogicChannelConfig_TransferControlType/dmaLogicChannelConfig_bandwidthControl - DMA_IP_BWC_ENGINE_NO_STALL 
/Mcl/MclConfig/dmaLogicChannel_Type_0/dmaLogicChannel_ConfigType/dmaLogicChannel_TransferConfigType/dmaLogicChannelConfig_TransferControlType/dmaLogicChannelConfig_disDmaAutoHwReq - false 
/Mcl/MclConfig/dmaLogicChannel_Type_0/dmaLogicChannel_ConfigType/dmaLogicChannel_TransferConfigType/dmaLogicChannelConfig_TransferControlType/dmaLogicChannelConfig_enDmaHalfMajorInterrupt - false 
/Mcl/MclConfig/dmaLogicChannel_Type_0/dmaLogicChannel_ConfigType/dmaLogicChannel_TransferConfigType/dmaLogicChannelConfig_TransferControlType/dmaLogicChannelConfig_enDmaMajorInterrupt - false 
/Mcl/MclConfig/dmaLogicChannel_Type_0/dmaLogicChannel_ConfigType/dmaLogicChannel_TransferConfigType/dmaLogicChannelConfig_TransferControlType/dmaLogicChannelConfig_enEndOfPacketSignal - false 
/Mcl/MclConfig/dmaLogicChannel_Type_0/dmaLogicChannel_ConfigType/dmaLogicChannel_TransferConfigType/dmaLogicChannelConfig_TransferDestinationType - dmaLogicChannelConfig_TransferDestinationType 
/Mcl/MclConfig/dmaLogicChannel_Type_0/dmaLogicChannel_ConfigType/dmaLogicChannel_TransferConfigType/dmaLogicChannelConfig_TransferDestinationType/dmaLogicChannelConfig_DestinationLastAddressAdjustmentType - 0 
/Mcl/MclConfig/dmaLogicChannel_Type_0/dmaLogicChannel_ConfigType/dmaLogicChannel_TransferConfigType/dmaLogicChannelConfig_TransferDestinationType/dmaLogicChannelConfig_DestinationModuloType - 0 
/Mcl/MclConfig/dmaLogicChannel_Type_0/dmaLogicChannel_ConfigType/dmaLogicChannel_TransferConfigType/dmaLogicChannelConfig_TransferDestinationType/dmaLogicChannelConfig_DestinationSignedOffsetType - 0 
/Mcl/MclConfig/dmaLogicChannel_Type_0/dmaLogicChannel_ConfigType/dmaLogicChannel_TransferConfigType/dmaLogicChannelConfig_TransferDestinationType/dmaTransferConfig_TransferSizeType - DMA_IP_TRANSFER_SIZE_1_BYTE 
/Mcl/MclConfig/dmaLogicChannel_Type_0/dmaLogicChannel_ConfigType/dmaLogicChannel_TransferConfigType/dmaLogicChannelConfig_TransferMajorLoopType - dmaLogicChannelConfig_TransferMajorLoopType 
/Mcl/MclConfig/dmaLogicChannel_Type_0/dmaLogicChannel_ConfigType/dmaLogicChannel_TransferConfigType/dmaLogicChannelConfig_TransferMajorLoopType/dmaLogicChannelConfig_MajorLoopCountType - 0 
/Mcl/MclConfig/dmaLogicChannel_Type_0/dmaLogicChannel_ConfigType/dmaLogicChannel_TransferConfigType/dmaLogicChannelConfig_TransferMajorLoopType/dmaLogicChannelConfig_enMajorLoopLinkCh - false 
/Mcl/MclConfig/dmaLogicChannel_Type_0/dmaLogicChannel_ConfigType/dmaLogicChannel_TransferConfigType/dmaLogicChannelConfig_TransferMajorLoopType/dynamic_dmaLogicChannelConfig_MajorLoopLinkChValueType - /Mcl/Mcl/MclConfig/dmaLogicChannel_Type_0 
/Mcl/MclConfig/dmaLogicChannel_Type_0/dmaLogicChannel_ConfigType/dmaLogicChannel_TransferConfigType/dmaLogicChannelConfig_TransferMinorLoopType - dmaLogicChannelConfig_TransferMinorLoopType 
/Mcl/MclConfig/dmaLogicChannel_Type_0/dmaLogicChannel_ConfigType/dmaLogicChannel_TransferConfigType/dmaLogicChannelConfig_TransferMinorLoopType/dmaLogicChannelConfig_MinorLoopSizeType - 0 
/Mcl/MclConfig/dmaLogicChannel_Type_0/dmaLogicChannel_ConfigType/dmaLogicChannel_TransferConfigType/dmaLogicChannelConfig_TransferMinorLoopType/dmaLogicChannelConfig_OffsetValueType - 0 
/Mcl/MclConfig/dmaLogicChannel_Type_0/dmaLogicChannel_ConfigType/dmaLogicChannel_TransferConfigType/dmaLogicChannelConfig_TransferMinorLoopType/dmaLogicChannelConfig_enDestinationOffset - false 
/Mcl/MclConfig/dmaLogicChannel_Type_0/dmaLogicChannel_ConfigType/dmaLogicChannel_TransferConfigType/dmaLogicChannelConfig_TransferMinorLoopType/dmaLogicChannelConfig_enMinorLoopLinkCh - false 
/Mcl/MclConfig/dmaLogicChannel_Type_0/dmaLogicChannel_ConfigType/dmaLogicChannel_TransferConfigType/dmaLogicChannelConfig_TransferMinorLoopType/dmaLogicChannelConfig_enSourceOffset - false 
/Mcl/MclConfig/dmaLogicChannel_Type_0/dmaLogicChannel_ConfigType/dmaLogicChannel_TransferConfigType/dmaLogicChannelConfig_TransferMinorLoopType/dynamic_dmaLogicChannelConfig_MinorLoopLinkChValueType - /Mcl/Mcl/MclConfig/dmaLogicChannel_Type_0 
/Mcl/MclConfig/dmaLogicChannel_Type_0/dmaLogicChannel_ConfigType/dmaLogicChannel_TransferConfigType/dmaLogicChannelConfig_TransferSourceType - dmaLogicChannelConfig_TransferSourceType 
/Mcl/MclConfig/dmaLogicChannel_Type_0/dmaLogicChannel_ConfigType/dmaLogicChannel_TransferConfigType/dmaLogicChannelConfig_TransferSourceType/dmaLogicChannelConfig_SourceLastAddressAdjustmentType - 0 
/Mcl/MclConfig/dmaLogicChannel_Type_0/dmaLogicChannel_ConfigType/dmaLogicChannel_TransferConfigType/dmaLogicChannelConfig_TransferSourceType/dmaLogicChannelConfig_SourceModuloType - 0 
/Mcl/MclConfig/dmaLogicChannel_Type_0/dmaLogicChannel_ConfigType/dmaLogicChannel_TransferConfigType/dmaLogicChannelConfig_TransferSourceType/dmaLogicChannelConfig_SourceSignedOffsetType - 0 
/Mcl/MclConfig/dmaLogicChannel_Type_0/dmaLogicChannel_ConfigType/dmaLogicChannel_TransferConfigType/dmaLogicChannelConfig_TransferSourceType/dmaTransferConfig_TransferSizeType - DMA_IP_TRANSFER_SIZE_1_BYTE 
/Mcl/MclConfig/dmaLogicChannel_Type_0/dmaLogicChannel_EcucPartitionRef - /EcuC/EcuC/EcucPartitionCollection_0/EcucPartition_0 
/Mcl/MclConfig/dmaLogicChannel_Type_0/dmaLogicChannel_EnableGlobalConfig - false 
/Mcl/MclConfig/dmaLogicChannel_Type_0/dmaLogicChannel_EnableScatterGather - false 
/Mcl/MclConfig/dmaLogicChannel_Type_0/dmaLogicChannel_EnableTransferConfig - false 
/Mcl/MclConfig/dmaLogicChannel_Type_0/dmaLogicChannel_ErrorInterruptCallback - NULL_PTR 
/Mcl/MclConfig/dmaLogicChannel_Type_0/dmaLogicChannel_HwChId - DMA_IP_HW_CH_0 
/Mcl/MclConfig/dmaLogicChannel_Type_0/dmaLogicChannel_HwInstId - DMA_IP_HW_INST_0 
/Mcl/MclConfig/dmaLogicChannel_Type_0/dmaLogicChannel_InterruptCallback - NULL_PTR 
/Mcl/MclConfig/dmaLogicChannel_Type_0/dmaLogicChannel_LogicName - DMA_LOGIC_CH_0 
/Mcl/MclConfig/lcuConfiguration - lcuConfiguration_0 
/Mcl/MclConfig/lcuConfiguration_0/lcuInstanceCfg - lcuInstanceCfg_0 
/Mcl/MclConfig/lcuConfiguration_0/lcuInstanceCfg_0/lcuLogicCellCfg_lst - lcuLogicCellCfg_lst_0 
/Mcl/MclConfig/lcuConfiguration_0/lcuInstanceCfg_0/lcuLogicCellCfg_lst_0/lcuLogicCell_EcucPartitionRef - /EcuC/EcuC/EcucPartitionCollection_0/EcucPartition_0 
/Mcl/MclConfig/lcuConfiguration_0/lcuInstanceCfg_0/lcuLogicCellCfg_lst_0/lcuLogicCell_ForceSignalCfg - lcuLogicCell_ForceSignalCfg_0 
/Mcl/MclConfig/lcuConfiguration_0/lcuInstanceCfg_0/lcuLogicCellCfg_lst_0/lcuLogicCell_ForceSignalCfg_0/lcuLogicCell_ForceSignalSelect - LCU_IP_FORCE_SEL_INPUT0 
/Mcl/MclConfig/lcuConfiguration_0/lcuInstanceCfg_0/lcuLogicCellCfg_lst_0/lcuLogicCell_ForceSignalCfg_0/lcuLogicCell_combEnable - false 
/Mcl/MclConfig/lcuConfiguration_0/lcuInstanceCfg_0/lcuLogicCellCfg_lst_0/lcuLogicCell_ForceSignalCfg_0/lcuLogicCell_forcePol - false 
/Mcl/MclConfig/lcuConfiguration_0/lcuInstanceCfg_0/lcuLogicCellCfg_lst_0/lcuLogicCell_HwLcID - LCU_IP_HW_LC_0 
/Mcl/MclConfig/lcuConfiguration_0/lcuInstanceCfg_0/lcuLogicCellCfg_lst_0/lcuLogicCell_SwSyncSel - LCU_IP_SYNC_SEL_INPUT0 
/Mcl/MclConfig/lcuConfiguration_0/lcuInstanceCfg_0/lcuLogicCellCfg_lst_0/lcuLogicCell_forceFilter - 0 
/Mcl/MclConfig/lcuConfiguration_0/lcuInstanceCfg_0/lcuLogicCellCfg_lst_0/lcuLogicCell_usingCombinationalForcePath - false 
/Mcl/MclConfig/lcuConfiguration_0/lcuInstanceCfg_0/lcuLogicCellCfg_lst_0/lcuLogicCell_usingForcePolarity - false 
/Mcl/MclConfig/lcuConfiguration_0/lcuInstanceCfg_0/lcuLogicCell_UsingForceSignal - false 
/Mcl/MclConfig/lcuConfiguration_0/lcuInstanceCfg_0/lcuLogicCell_UsingSyncSignal - false 
/Mcl/MclConfig/lcuConfiguration_0/lcuInstanceCfg_0/lcuLogicInstance_HwInstID - LCU_IP_HW_INST_0 
/Mcl/MclConfig/lcuConfiguration_0/lcuInstanceCfg_0/lcuLogicInstance_LogicName - LCU_LOGIC_INSTANCE_0 
/Mcl/MclConfig/lcuConfiguration_0/lcuInstanceCfg_0/lcuLogicInstance_OperationMode - INTERRUPT 
/Mcl/MclConfig/lcuConfiguration_0/mclLcuInputConfiguration - mclLcuInputConfiguration_0 
/Mcl/MclConfig/lcuConfiguration_0/mclLcuInputConfiguration_0/lcuLogicInput_HwInputID - LCU_IP_HW_INPUT_0 
/Mcl/MclConfig/lcuConfiguration_0/mclLcuInputConfiguration_0/lcuLogicInput_HwInstID - LCU_IP_HW_INST_0 
/Mcl/MclConfig/lcuConfiguration_0/mclLcuInputConfiguration_0/lcuLogicInput_HwLcID - LCU_IP_HW_LC_0 
/Mcl/MclConfig/lcuConfiguration_0/mclLcuInputConfiguration_0/lcuLogicInput_LogicName - LCU_LOGIC_INPUT_0 
/Mcl/MclConfig/lcuConfiguration_0/mclLcuInputConfiguration_0/lcuLogicInput_MuxSelect - LCU_IP_MUX_SEL_LOGIC_0 
/Mcl/MclConfig/lcuConfiguration_0/mclLcuInputConfiguration_0/lcuLogicInput_SwOverrideMode - LCU_IP_SW_SYNC_IMMEDIATE 
/Mcl/MclConfig/lcuConfiguration_0/mclLcuInputConfiguration_0/lcuLogicInput_SwOverrideValue - LCU_IP_SW_OVERRIDE_LOGIC_LOW 
/Mcl/MclConfig/lcuConfiguration_0/mclLcuInputConfiguration_0/lcuLogicInput_UsingSwOverride - false 
/Mcl/MclConfig/lcuConfiguration_0/mclLcuOutputConfiguration - mclLcuOutputConfiguration_0 
/Mcl/MclConfig/lcuConfiguration_0/mclLcuOutputConfiguration_0/lcuLogicOutput_DebugMode - false 
/Mcl/MclConfig/lcuConfiguration_0/mclLcuOutputConfiguration_0/lcuLogicOutput_ForceSignalConfiguration - lcuLogicOutput_ForceSignalConfiguration 
/Mcl/MclConfig/lcuConfiguration_0/mclLcuOutputConfiguration_0/lcuLogicOutput_ForceSignalConfiguration/lcuLogicOutput_ForceClearMode - LCU_IP_CLEAR_FORCE_SIGNAL_IMMEDIATE 
/Mcl/MclConfig/lcuConfiguration_0/mclLcuOutputConfiguration_0/lcuLogicOutput_ForceSignalConfiguration/lcuLogicOutput_ForceDmaEnable - false 
/Mcl/MclConfig/lcuConfiguration_0/mclLcuOutputConfiguration_0/lcuLogicOutput_ForceSignalConfiguration/lcuLogicOutput_ForceIntEnable - false 
/Mcl/MclConfig/lcuConfiguration_0/mclLcuOutputConfiguration_0/lcuLogicOutput_ForceSignalConfiguration/lcuLogicOutput_ForceSignalSelect - lcuLogicOutput_ForceSignalSelect_0 
/Mcl/MclConfig/lcuConfiguration_0/mclLcuOutputConfiguration_0/lcuLogicOutput_ForceSignalConfiguration/lcuLogicOutput_ForceSignalSelect_0/lcuLogicOutput_ForceSignal - LCU_IP_FORCE_SEL_INPUT0 
/Mcl/MclConfig/lcuConfiguration_0/mclLcuOutputConfiguration_0/lcuLogicOutput_ForceSignalConfiguration/lcuLogicOutput_ForceSignalSelect_0/lcuLogicOutput_ForceSignalAffect - false 
/Mcl/MclConfig/lcuConfiguration_0/mclLcuOutputConfiguration_0/lcuLogicOutput_ForceSignalConfiguration/lcuLogicOutput_ForceSyncSelect - LCU_IP_SYNC_SEL_INPUT0 
/Mcl/MclConfig/lcuConfiguration_0/mclLcuOutputConfiguration_0/lcuLogicOutput_HwInstID - LCU_IP_HW_INST_0 
/Mcl/MclConfig/lcuConfiguration_0/mclLcuOutputConfiguration_0/lcuLogicOutput_HwLcID - LCU_IP_HW_LC_0 
/Mcl/MclConfig/lcuConfiguration_0/mclLcuOutputConfiguration_0/lcuLogicOutput_HwOutputID - LCU_IP_HW_OUTPUT_0 
/Mcl/MclConfig/lcuConfiguration_0/mclLcuOutputConfiguration_0/lcuLogicOutput_InterruptCallback - NULL_PTR 
/Mcl/MclConfig/lcuConfiguration_0/mclLcuOutputConfiguration_0/lcuLogicOutput_InvertOutput - false 
/Mcl/MclConfig/lcuConfiguration_0/mclLcuOutputConfiguration_0/lcuLogicOutput_LogicName - LCU_LOGIC_OUTPUT_0 
/Mcl/MclConfig/lcuConfiguration_0/mclLcuOutputConfiguration_0/lcuLogicOutput_LutControl - 0 
/Mcl/MclConfig/lcuConfiguration_0/mclLcuOutputConfiguration_0/lcuLogicOutput_LutDmaEnable - false 
/Mcl/MclConfig/lcuConfiguration_0/mclLcuOutputConfiguration_0/lcuLogicOutput_LutFallFilter - 0 
/Mcl/MclConfig/lcuConfiguration_0/mclLcuOutputConfiguration_0/lcuLogicOutput_LutIntEnable - false 
/Mcl/MclConfig/lcuConfiguration_0/mclLcuOutputConfiguration_0/lcuLogicOutput_LutRiseFilter - 0 
/Mcl/MclConfig/lcuConfiguration_0/mclLcuOutputConfiguration_0/lcuLogicOutput_UsingForceSignal - false 
/Mcl/MclConfig/trgmuxInstaceList - trgmuxInstaceList_0 
/Mcl/MclConfig/trgmuxInstaceList_0/trgmuxHardwareInstance - TRGMUX_IP_HW_INST_0 
/Mcl/MclConfig/trgmuxLogicGroup - trgmuxLogicGroup_0 
/Mcl/MclConfig/trgmuxLogicGroup_0/trgmuxLogicGroupHardwareInstance - TRGMUX_IP_HW_INST_0 
/Mcl/MclConfig/trgmuxLogicGroup_0/trgmuxLogicGroup_Lock - false 
/Mcl/MclConfig/trgmuxLogicGroup_0/trgmuxLogicGroup_Name - TRGMUX_IP_ADC12_0 
/Mcl/MclConfig/trgmuxLogicGroup_0/trgmuxLogicTrigger - trgmuxLogicTrigger_0 
/Mcl/MclConfig/trgmuxLogicGroup_0/trgmuxLogicTrigger_0/trgmuxLogicTrigger_EcucPartitionRef - /EcuC/EcuC/EcucPartitionCollection_0/EcucPartition_0 
/Mcl/MclConfig/trgmuxLogicGroup_0/trgmuxLogicTrigger_0/trgmuxLogicTrigger_Input - TRGMUX_IP_INPUT_LOGIC0_VSS 
/Mcl/MclConfig/trgmuxLogicGroup_0/trgmuxLogicTrigger_0/trgmuxLogicTrigger_Name - TRGMUX_LOGIC_GROUP_0_TRIGGER_0 
/Mcl/MclConfig/trgmuxLogicGroup_0/trgmuxLogicTrigger_0/trgmuxLogicTrigger_Output - TRGMUX_IP_OUTPUT_ADC12_0_EXTRG_NORMAL_CONV 
/Mcl/MclGeneral - MclGeneral 
/Mcl/MclGeneral/MclCache - MclCache 
/Mcl/MclGeneral/MclCache/MclEnableCache - true 
/Mcl/MclGeneral/MclDma - MclDma 
/Mcl/MclGeneral/MclDma/MclEnableDma - false 
/Mcl/MclGeneral/MclEcucPartitionRef - /EcuC/EcuC/EcucPartitionCollection_0/EcucPartition_0 
/Mcl/MclGeneral/MclEmiosCommon - MclEmiosCommon 
/Mcl/MclGeneral/MclEmiosCommon/MclEnableEmiosCommon - true 
/Mcl/MclGeneral/MclEnableDevErrorDetect - true 
/Mcl/MclGeneral/MclEnableMulticoreSupport - false 
/Mcl/MclGeneral/MclEnableUserModeSupport - false 
/Mcl/MclGeneral/MclEnableVirtualAddressMappingSupport - false 
/Mcl/MclGeneral/MclFlexioCommon - MclFlexioCommon 
/Mcl/MclGeneral/MclFlexioCommon/MclEnableFlexioCommon - true 
/Mcl/MclGeneral/MclLcuConfig - MclLcuConfig 
/Mcl/MclGeneral/MclLcuConfig/MclEnableLcu - true 
/Mcl/MclGeneral/MclLcuConfig/MclEnableLcuAsyncFunc - false 
/Mcl/MclGeneral/MclLcuConfig/MclEnableLcuSyncFunc - false 
/Mcl/MclGeneral/MclTrgMux - MclTrgMux 
/Mcl/MclGeneral/MclTrgMux/MclEnableTrgMux - true 
/Mcl/MclGeneral/Mcl_VersionInfoApi - true 
/Mcl/POST_BUILD_VARIANT_USED - true 

