Caler10/RBCM_S32K344_AUTOSAR_MBD/Firmware/S32K344_DAPlink/S32K344_LED/S32K344_LED_ert_rtw/MW_target_hardware_resources.h
*/
#define MW_DETAILS_MCL 
#define MW_OPEN_MCL 
#define MW_UPDATE_MCL 
#define MW_RESTORE_MCL 
#define MW_MCU_INFO /*
/Mcu - Mcu 
/Mcu/CommonPublishedInformation - CommonPublishedInformation 
/Mcu/IMPLEMENTATION-CONFIG-VARIANT - VARIANT-PRE-COMPILE 
/Mcu/McuCoreControlConfiguration - McuCoreControlConfiguration 
/Mcu/McuCoreControlConfiguration/McuCoreBootAddressControl - false 
/Mcu/McuDebugConfiguration - McuDebugConfiguration 
/Mcu/McuDebugConfiguration/McuDisableCmuApi - true 
/Mcu/McuDebugConfiguration/McuDisableDemReportErrorStatus - true 
/Mcu/McuDebugConfiguration/McuEmiosConfigureGprenApi - false 
/Mcu/McuDebugConfiguration/McuGetClockFrequencyApi - true 
/Mcu/McuDebugConfiguration/McuGetMidrStructureApi - false 
/Mcu/McuDebugConfiguration/McuGetPowerDomainApi - false 
/Mcu/McuDebugConfiguration/McuGetPowerModeStateApi - false 
/Mcu/McuDebugConfiguration/McuGetSystemStateApi - false 
/Mcu/McuDebugConfiguration/McuSscmGetMemConfigApi - false 
/Mcu/McuDebugConfiguration/McuSscmGetStatusApi - false 
/Mcu/McuDebugConfiguration/McuSscmGetUoptApi - false 
/Mcu/McuGeneralConfiguration - McuGeneralConfiguration 
/Mcu/McuGeneralConfiguration/McuAlternateResetIsrUsed - false 
/Mcu/McuGeneralConfiguration/McuCalloutBeforePerformReset - false 
/Mcu/McuGeneralConfiguration/McuCmuErrorIsrUsed - false 
/Mcu/McuGeneralConfiguration/McuControlledClocksConfiguration - McuControlledClocksConfiguration 
/Mcu/McuGeneralConfiguration/McuControlledClocksConfiguration/McuFircUnderMcuControl - true 
/Mcu/McuGeneralConfiguration/McuControlledClocksConfiguration/McuFxoscUnderMcuControl - true 
/Mcu/McuGeneralConfiguration/McuControlledClocksConfiguration/McuPll0UnderMcuControl - true 
/Mcu/McuGeneralConfiguration/McuControlledClocksConfiguration/McuSircUnderMcuControl - true 
/Mcu/McuGeneralConfiguration/McuControlledClocksConfiguration/McuSxoscUnderMcuControl - true 
/Mcu/McuGeneralConfiguration/McuDevErrorDetect - false 
/Mcu/McuGeneralConfiguration/McuDisableFlashWaitStatesConfig - true 
/Mcu/McuGeneralConfiguration/McuDisablePmcInit - false 
/Mcu/McuGeneralConfiguration/McuDisableRamWaitStatesConfig - true 
/Mcu/McuGeneralConfiguration/McuDisableRgmInit - false 
/Mcu/McuGeneralConfiguration/McuEnableUserModeSupport - false 
/Mcu/McuGeneralConfiguration/McuEnterLowPowerMode - true 
/Mcu/McuGeneralConfiguration/McuGetRamStateApi - false 
/Mcu/McuGeneralConfiguration/McuInitClock - true 
/Mcu/McuGeneralConfiguration/McuNoPll - false 
/Mcu/McuGeneralConfiguration/McuPerformResetApi - false 
/Mcu/McuGeneralConfiguration/McuPerformResetCallout - NULL_PTR 
/Mcu/McuGeneralConfiguration/McuRegisterValuesOptimization - DISABLED 
/Mcu/McuGeneralConfiguration/McuTimeout - 50000 
/Mcu/McuGeneralConfiguration/McuTimeoutMethod - OSIF_COUNTER_DUMMY 
/Mcu/McuGeneralConfiguration/McuVersionInfoApi - false 
/Mcu/McuGeneralConfiguration/McuVoltageErrorIsrUsed - false 
/Mcu/McuModuleConfiguration - McuModuleConfiguration 
/Mcu/McuModuleConfiguration/McuClockSettingConfig - McuClockSettingConfig_0 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/CORE_CLK/McuClockFrequencySelect - CORE_CLK 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/Configuration - McuClockSettingConfig_0 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/FLEXCAN_PE_CLK0_2/McuClockFrequencySelect - FLEXCAN_PE_CLK0_2 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/FLEXCAN_PE_CLK3_5/McuClockFrequencySelect - FLEXCAN_PE_CLK3_5 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/FLEXIO_CLK/McuClockFrequencySelect - CORE_CLK 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/GPT_CLK/McuClockFrequencySelect - AIPS_SLOW_CLK 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuCgm0SettingConfig - McuCgm0SettingConfig 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuCgm0SettingConfig/McuCgm0ClockMux0 - McuCgm0ClockMux0 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuCgm0SettingConfig/McuCgm0ClockMux0/McuClkMux0Div0Trigger - COMMON_TRIGGER_DIVIDER_UPDATE 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuCgm0SettingConfig/McuCgm0ClockMux0/McuClkMux0Div0_En - true 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuCgm0SettingConfig/McuCgm0ClockMux0/McuClkMux0Div1Trigger - COMMON_TRIGGER_DIVIDER_UPDATE 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuCgm0SettingConfig/McuCgm0ClockMux0/McuClkMux0Div1_En - true 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuCgm0SettingConfig/McuCgm0ClockMux0/McuClkMux0Div2Trigger - COMMON_TRIGGER_DIVIDER_UPDATE 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuCgm0SettingConfig/McuCgm0ClockMux0/McuClkMux0Div2_En - true 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuCgm0SettingConfig/McuCgm0ClockMux0/McuClkMux0Div3Trigger - COMMON_TRIGGER_DIVIDER_UPDATE 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuCgm0SettingConfig/McuCgm0ClockMux0/McuClkMux0Div3_En - true 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuCgm0SettingConfig/McuCgm0ClockMux0/McuClkMux0Div4Trigger - COMMON_TRIGGER_DIVIDER_UPDATE 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuCgm0SettingConfig/McuCgm0ClockMux0/McuClkMux0Div4_En - true 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuCgm0SettingConfig/McuCgm0ClockMux0/McuClkMux0Div5Trigger - COMMON_TRIGGER_DIVIDER_UPDATE 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuCgm0SettingConfig/McuCgm0ClockMux0/McuClkMux0Div5_En - true 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuCgm0SettingConfig/McuCgm0ClockMux0/McuClkMux0Div6Trigger - COMMON_TRIGGER_DIVIDER_UPDATE 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuCgm0SettingConfig/McuCgm0ClockMux0/McuClkMux0Div6_En - true 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuCgm0SettingConfig/McuCgm0ClockMux0/McuClkMux0_Source - PLL_PHI0_CLK 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuCgm0SettingConfig/McuCgm0ClockMux0/McuClockMuxUnderMcuControl - true 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuCgm0SettingConfig/McuCgm0ClockMux1 - McuCgm0ClockMux1 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuCgm0SettingConfig/McuCgm0ClockMux1/McuClkMux1Div0_En - true 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuCgm0SettingConfig/McuCgm0ClockMux1/McuClkMux1_Source - FIRC_CLK 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuCgm0SettingConfig/McuCgm0ClockMux1/McuClockMuxUnderMcuControl - true 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuCgm0SettingConfig/McuCgm0ClockMux10 - McuCgm0ClockMux10 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuCgm0SettingConfig/McuCgm0ClockMux10/McuClkMux10Div0_En - true 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuCgm0SettingConfig/McuCgm0ClockMux10/McuClkMux10_Source - FIRC_CLK 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuCgm0SettingConfig/McuCgm0ClockMux10/McuClockMuxUnderMcuControl - true 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuCgm0SettingConfig/McuCgm0ClockMux11 - McuCgm0ClockMux11 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuCgm0SettingConfig/McuCgm0ClockMux11/McuClkMux11Div0_En - true 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuCgm0SettingConfig/McuCgm0ClockMux11/McuClkMux11_Source - FIRC_CLK 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuCgm0SettingConfig/McuCgm0ClockMux11/McuClockMuxUnderMcuControl - true 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuCgm0SettingConfig/McuCgm0ClockMux2 - McuCgm0ClockMux2 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuCgm0SettingConfig/McuCgm0ClockMux2/McuClkMux2Div0_En - true 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuCgm0SettingConfig/McuCgm0ClockMux2/McuClkMux2_Source - FIRC_CLK 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuCgm0SettingConfig/McuCgm0ClockMux2/McuClockMuxUnderMcuControl - true 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuCgm0SettingConfig/McuCgm0ClockMux3 - McuCgm0ClockMux3 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuCgm0SettingConfig/McuCgm0ClockMux3/McuClkMux3Div0_En - true 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuCgm0SettingConfig/McuCgm0ClockMux3/McuClkMux3_Source - AIPS_PLAT_CLK 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuCgm0SettingConfig/McuCgm0ClockMux3/McuClockMuxUnderMcuControl - true 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuCgm0SettingConfig/McuCgm0ClockMux4 - McuCgm0ClockMux4 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuCgm0SettingConfig/McuCgm0ClockMux4/McuClkMux4Div0_En - true 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuCgm0SettingConfig/McuCgm0ClockMux4/McuClkMux4_Source - AIPS_PLAT_CLK 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuCgm0SettingConfig/McuCgm0ClockMux4/McuClockMuxUnderMcuControl - true 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuCgm0SettingConfig/McuCgm0ClockMux5 - McuCgm0ClockMux5 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuCgm0SettingConfig/McuCgm0ClockMux5/McuClkMux5Div0_En - true 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuCgm0SettingConfig/McuCgm0ClockMux5/McuClkMux5_Source - FIRC_CLK 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuCgm0SettingConfig/McuCgm0ClockMux5/McuClockMuxUnderMcuControl - true 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuCgm0SettingConfig/McuCgm0ClockMux6 - McuCgm0ClockMux6 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuCgm0SettingConfig/McuCgm0ClockMux6/McuClkMux6Div0_En - true 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuCgm0SettingConfig/McuCgm0ClockMux6/McuClkMux6_Source - FXOSC_CLK 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuCgm0SettingConfig/McuCgm0ClockMux6/McuClockMuxUnderMcuControl - true 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuCgm0SettingConfig/McuCgm0ClockMux7 - McuCgm0ClockMux7 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuCgm0SettingConfig/McuCgm0ClockMux7/McuClkMux7Div0_En - true 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuCgm0SettingConfig/McuCgm0ClockMux7/McuClkMux7_Source - FIRC_CLK 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuCgm0SettingConfig/McuCgm0ClockMux7/McuClockMuxUnderMcuControl - true 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuCgm0SettingConfig/McuCgm0ClockMux8 - McuCgm0ClockMux8 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuCgm0SettingConfig/McuCgm0ClockMux8/McuClkMux8Div0_En - true 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuCgm0SettingConfig/McuCgm0ClockMux8/McuClkMux8_Source - FIRC_CLK 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuCgm0SettingConfig/McuCgm0ClockMux8/McuClockMuxUnderMcuControl - true 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuCgm0SettingConfig/McuCgm0ClockMux9 - McuCgm0ClockMux9 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuCgm0SettingConfig/McuCgm0ClockMux9/McuClkMux9Div0_En - true 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuCgm0SettingConfig/McuCgm0ClockMux9/McuClkMux9_Source - FIRC_CLK 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuCgm0SettingConfig/McuCgm0ClockMux9/McuClockMuxUnderMcuControl - true 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuCgm0SettingConfig/McuCgm0PcfsConfig - McuCgm0PcfsConfig_0 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuCgm0SettingConfig/McuCgm0PcfsConfig_0/McuClockPcfsUnderMcuControl - false 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuCgm0SettingConfig/McuCgm0PcfsConfig_0/McuPCFS_Name - PCFS_8 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuClkMonitor - McuClkMonitor_0 McuClkMonitor_1 McuClkMonitor_2 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuClkMonitor_0/McuClkMonitorEn - false 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuClkMonitor_0/McuClockMonitorUnderMcuControl - true 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuClkMonitor_0/McuCmuName - CMU_FC_0_FXOSC_CLK 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuClkMonitor_0/McuFHHAsyncEventEn - false 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuClkMonitor_0/McuFHHInterruptEn - false 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuClkMonitor_0/McuFLLAsyncEventEn - false 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuClkMonitor_0/McuFLLInterruptEn - false 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuClkMonitor_1/McuClkMonitorEn - false 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuClkMonitor_1/McuClockMonitorUnderMcuControl - true 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuClkMonitor_1/McuCmuName - CMU_FC_3_CORE_CLK 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuClkMonitor_1/McuFHHAsyncEventEn - false 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuClkMonitor_1/McuFHHInterruptEn - false 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuClkMonitor_1/McuFLLAsyncEventEn - false 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuClkMonitor_1/McuFLLInterruptEn - false 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuClkMonitor_2/McuClkMonitorEn - false 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuClkMonitor_2/McuClockMonitorUnderMcuControl - true 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuClkMonitor_2/McuCmuName - CMU_FC_4_AIPS_PLAT_CLK 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuClkMonitor_2/McuFHHAsyncEventEn - false 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuClkMonitor_2/McuFHHInterruptEn - false 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuClkMonitor_2/McuFLLAsyncEventEn - false 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuClkMonitor_2/McuFLLInterruptEn - false 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuClockReferencePoint - CORE_CLK FLEXCAN_PE_CLK0_2 FLEXCAN_PE_CLK3_5 FLEXIO_CLK GPT_CLK SPI_CLK UART_CLK 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuFIRC - McuFIRC 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuFIRC/McuFircDivSel - Div_by_1 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuFIRC/McuFircStandbyEnable - false 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuFIRC/McuFircUnderMcuControl - true 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuFXOSC - McuFXOSC 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuFXOSC/McuFxoscBypass - false 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuFXOSC/McuFxoscMainComparator - true 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuFXOSC/McuFxoscPowerDownCtr - true 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuFXOSC/McuFxoscUnderMcuControl - true 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuPll_0 - McuPll_0 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuPll_0/McuPLLEnabled - true 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuPll_0/McuPLLUnderMcuControl - true 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuPll_0/McuPllClockSelection - FXOSC_CLK 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuPll_0/McuPll_Configuration - McuPll_Configuration 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuPll_0/McuPll_Configuration/McuPllFdSdm2 - false 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuPll_0/McuPll_Configuration/McuPllFdSdm3 - false 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuPll_0/McuPll_Configuration/McuPllFdSdmen - false 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuPll_0/McuPll_Configuration/McuPllFmSpreadctl - Center_Spread 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuPll_0/McuPll_Configuration/McuPllFmSscgbyp - true 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuPll_0/McuPll_Configuration/McuPllOdiv0_En - true 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuPll_0/McuPll_Configuration/McuPllOdiv1_En - true 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuPll_0/McuPll_Parameter - McuPll_Parameter 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuRtcClockSelect - McuRtcClockSelect 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuRtcClockSelect/McuClockMuxUnderMcuControl - true 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuRtcClockSelect/McuRtc_Source - SXOSC_CLK 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuSIRC - McuSIRC 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuSIRC/McuSircStandbyEnable - false 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuSIRC/McuSircUnderMcuControl - true 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuSXOSC - McuSXOSC 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuSXOSC/McuSxoscPowerDownCtr - true 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/McuSXOSC/McuSxoscUnderMcuControl - true 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/SPI_CLK/McuClockFrequencySelect - AIPS_SLOW_CLK 
/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/UART_CLK/McuClockFrequencySelect - AIPS_SLOW_CLK 
/Mcu/McuModuleConfiguration/McuClockSrcFailureNotification - DISABLED 
/Mcu/McuModuleConfiguration/McuModeSettingConf - McuModeSettingConf_0 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuCoreLockStepEnable - false 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuDcmGprConfiguration - McuDcmGprConfiguration 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuDcmGprConfiguration/McuBootBaseAddress - 0 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuDcmGprConfiguration/McuDCM_SCAN_BYP_STDBY_EXTControl - false 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuDcmGprConfiguration/McuDcmGprUnderMcuControl - false 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuDcmGprConfiguration/McuFIRC_TRIM_BYP_STDBY_EXTControl - false 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuDcmGprConfiguration/McuGlobalPadkeepingEnable - false 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuDcmGprConfiguration/McuPMC_TRIM_RGM_DCF_BYP_STDBY_EXTControl - false 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuDcmGprConfiguration/McuSIRC_TRIM_BYP_STDBY_EXTControl - false 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuEnableSleepOnExit - false 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuMainCoreSelect - CM7_0 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuMode - 0 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration - McuPartitionConfiguration 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPartition0Config - McuPartition0Config 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPartition0Config/McuCore0Configuration - McuCore0Configuration 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPartition0Config/McuCore0Configuration/McuCoreBootAddress - 0 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPartition0Config/McuCore0Configuration/McuCoreBootAddressLinkerSym -  
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPartition0Config/McuCore0Configuration/McuCoreClockEnable - false 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPartition0Config/McuCore0Configuration/McuCoreUnderMcuControl - true 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPartition0Config/McuPartitionClockEnable - true 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPartition0Config/McuPartitionPowerUnderMcuControl - true 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPartition0Config/McuPartitionUnderMcuControl - true 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPartition0Config/McuPrtnCofb1UnderMcuControl - true 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPartition1Config - McuPartition1Config 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPartition1Config/McuPartitionClockEnable - true 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPartition1Config/McuPartitionPowerUnderMcuControl - true 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPartition1Config/McuPartitionUnderMcuControl - true 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPartition1Config/McuPrtnCofb0UnderMcuControl - true 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPartition1Config/McuPrtnCofb1UnderMcuControl - true 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPartition1Config/McuPrtnCofb2UnderMcuControl - true 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPartition1Config/McuPrtnCofb3UnderMcuControl - true 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPartition2Config - McuPartition2Config 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPartition2Config/McuPartitionClockEnable - true 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPartition2Config/McuPartitionPowerUnderMcuControl - true 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPartition2Config/McuPartitionUnderMcuControl - true 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPartition2Config/McuPrtnCofb0UnderMcuControl - true 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPartition2Config/McuPrtnCofb1UnderMcuControl - true 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral - McuPeripheral_0 McuPeripheral_1 McuPeripheral_10 McuPeripheral_100 McuPeripheral_101 McuPeripheral_102 McuPeripheral_103 McuPeripheral_104 McuPeripheral_105 McuPeripheral_106 McuPeripheral_11 McuPeripheral_12 McuPeripheral_13 McuPeripheral_14 McuPeripheral_15 McuPeripheral_16 McuPeripheral_17 McuPeripheral_18 McuPeripheral_19 McuPeripheral_2 McuPeripheral_20 McuPeripheral_21 McuPeripheral_22 McuPeripheral_23 McuPeripheral_24 McuPeripheral_25 McuPeripheral_26 McuPeripheral_27 McuPeripheral_28 McuPeripheral_29 McuPeripheral_3 McuPeripheral_30 McuPeripheral_31 McuPeripheral_32 McuPeripheral_33 McuPeripheral_34 McuPeripheral_35 McuPeripheral_36 McuPeripheral_37 McuPeripheral_38 McuPeripheral_39 McuPeripheral_4 McuPeripheral_40 McuPeripheral_41 McuPeripheral_42 McuPeripheral_43 McuPeripheral_44 McuPeripheral_45 McuPeripheral_46 McuPeripheral_47 McuPeripheral_48 McuPeripheral_49 McuPeripheral_5 McuPeripheral_50 McuPeripheral_51 McuPeripheral_52 McuPeripheral_53 McuPeripheral_54 McuPeripheral_55 McuPeripheral_56 McuPeripheral_57 McuPeripheral_58 McuPeripheral_59 McuPeripheral_6 McuPeripheral_60 McuPeripheral_61 McuPeripheral_62 McuPeripheral_63 McuPeripheral_64 McuPeripheral_65 McuPeripheral_66 McuPeripheral_67 McuPeripheral_68 McuPeripheral_69 McuPeripheral_7 McuPeripheral_70 McuPeripheral_71 McuPeripheral_72 McuPeripheral_73 McuPeripheral_74 McuPeripheral_75 McuPeripheral_76 McuPeripheral_77 McuPeripheral_78 McuPeripheral_79 McuPeripheral_8 McuPeripheral_80 McuPeripheral_81 McuPeripheral_82 McuPeripheral_83 McuPeripheral_84 McuPeripheral_85 McuPeripheral_86 McuPeripheral_87 McuPeripheral_88 McuPeripheral_89 McuPeripheral_9 McuPeripheral_90 McuPeripheral_91 McuPeripheral_92 McuPeripheral_93 McuPeripheral_94 McuPeripheral_95 McuPeripheral_96 McuPeripheral_97 McuPeripheral_98 McuPeripheral_99 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_0/McuModeEntrySlot - PRTN0_COFB1_REQ32 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_0/McuPeripheralClockEnable - true 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_0/McuPeripheralName - TRGMUX 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_1/McuModeEntrySlot - PRTN0_COFB1_REQ33 
