Caler10/RBCM_S32K344_AUTOSAR_MBD/Firmware/S32K344_DAPlink/S32K344_LED/S32K344_LED_ert_rtw/MW_target_hardware_resources.h
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_1/McuPeripheralClockEnable - true 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_1/McuPeripheralName - BCTU 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_10/McuModeEntrySlot - PRTN0_COFB1_REQ44 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_10/McuPeripheralClockEnable - true 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_10/McuPeripheralName - PIT_0 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_100/McuModeEntrySlot - PRTN2_COFB1_REQ42 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_100/McuPeripheralClockEnable - false 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_100/McuPeripheralName - LPUART_15 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_101/McuModeEntrySlot - PRTN2_COFB1_REQ47 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_101/McuPeripheralClockEnable - true 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_101/McuPeripheralName - LPSPI_4 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_102/McuModeEntrySlot - PRTN2_COFB1_REQ48 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_102/McuPeripheralClockEnable - true 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_102/McuPeripheralName - LPSPI_5 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_103/McuModeEntrySlot - PRTN2_COFB1_REQ51 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_103/McuPeripheralClockEnable - false 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_103/McuPeripheralName - QuadSPI 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_104/McuModeEntrySlot - PRTN2_COFB1_REQ55 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_104/McuPeripheralClockEnable - false 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_104/McuPeripheralName - SAI_1 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_105/McuModeEntrySlot - PRTN2_COFB1_REQ58 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_105/McuPeripheralClockEnable - true 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_105/McuPeripheralName - LPCMP_2 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_106/McuModeEntrySlot - PRTN2_COFB1_REQ62 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_106/McuPeripheralClockEnable - true 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_106/McuPeripheralName - CM7_0_TCM 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_11/McuModeEntrySlot - PRTN0_COFB1_REQ45 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_11/McuPeripheralClockEnable - false 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_11/McuPeripheralName - PIT_1 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_12/McuModeEntrySlot - PRTN1_COFB0_REQ3 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_12/McuPeripheralClockEnable - false 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_12/McuPeripheralName - EDMA 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_13/McuModeEntrySlot - PRTN1_COFB0_REQ4 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_13/McuPeripheralClockEnable - false 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_13/McuPeripheralName - EDMA_TCD_0 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_14/McuModeEntrySlot - PRTN1_COFB0_REQ5 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_14/McuPeripheralClockEnable - false 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_14/McuPeripheralName - EDMA_TCD_1 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_15/McuModeEntrySlot - PRTN1_COFB0_REQ6 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_15/McuPeripheralClockEnable - false 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_15/McuPeripheralName - EDMA_TCD_2 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_16/McuModeEntrySlot - PRTN1_COFB0_REQ7 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_16/McuPeripheralClockEnable - false 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_16/McuPeripheralName - EDMA_TCD_3 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_17/McuModeEntrySlot - PRTN1_COFB0_REQ8 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_17/McuPeripheralClockEnable - false 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_17/McuPeripheralName - EDMA_TCD_4 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_18/McuModeEntrySlot - PRTN1_COFB0_REQ9 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_18/McuPeripheralClockEnable - false 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_18/McuPeripheralName - EDMA_TCD_5 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_19/McuModeEntrySlot - PRTN1_COFB0_REQ10 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_19/McuPeripheralClockEnable - false 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_19/McuPeripheralName - EDMA_TCD_6 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_2/McuModeEntrySlot - PRTN0_COFB1_REQ34 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_2/McuPeripheralClockEnable - true 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_2/McuPeripheralName - EMIOS_0 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_20/McuModeEntrySlot - PRTN1_COFB0_REQ11 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_20/McuPeripheralClockEnable - false 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_20/McuPeripheralName - EDMA_TCD_7 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_21/McuModeEntrySlot - PRTN1_COFB0_REQ12 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_21/McuPeripheralClockEnable - false 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_21/McuPeripheralName - EDMA_TCD_8 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_22/McuModeEntrySlot - PRTN1_COFB0_REQ13 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_22/McuPeripheralClockEnable - false 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_22/McuPeripheralName - EDMA_TCD_9 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_23/McuModeEntrySlot - PRTN1_COFB0_REQ14 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_23/McuPeripheralClockEnable - false 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_23/McuPeripheralName - EDMA_TCD_10 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_24/McuModeEntrySlot - PRTN1_COFB0_REQ15 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_24/McuPeripheralClockEnable - false 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_24/McuPeripheralName - EDMA_TCD_11 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_25/McuModeEntrySlot - PRTN1_COFB0_REQ21 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_25/McuPeripheralClockEnable - true 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_25/McuPeripheralName - SDA_AP 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_26/McuModeEntrySlot - PRTN1_COFB0_REQ22 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_26/McuPeripheralClockEnable - false 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_26/McuPeripheralName - EIM_0 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_27/McuModeEntrySlot - PRTN1_COFB0_REQ23 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_27/McuPeripheralClockEnable - false 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_27/McuPeripheralName - ERM_0 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_28/McuModeEntrySlot - PRTN1_COFB0_REQ24 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_28/McuPeripheralClockEnable - true 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_28/McuPeripheralName - MSCM 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_29/McuModeEntrySlot - PRTN1_COFB0_REQ28 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_29/McuPeripheralClockEnable - true 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_29/McuPeripheralName - SWT_0 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_3/McuModeEntrySlot - PRTN0_COFB1_REQ35 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_3/McuPeripheralClockEnable - true 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_3/McuPeripheralName - EMIOS_1 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_30/McuModeEntrySlot - PRTN1_COFB0_REQ29 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_30/McuPeripheralClockEnable - true 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_30/McuPeripheralName - STM_0 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_31/McuModeEntrySlot - PRTN1_COFB0_REQ31 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_31/McuPeripheralClockEnable - false 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_31/McuPeripheralName - INTM 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_32/McuModeEntrySlot - PRTN1_COFB1_REQ32 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_32/McuPeripheralClockEnable - false 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_32/McuPeripheralName - DMAMUX_0 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_33/McuModeEntrySlot - PRTN1_COFB1_REQ33 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_33/McuPeripheralClockEnable - false 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_33/McuPeripheralName - DMAMUX_1 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_34/McuModeEntrySlot - PRTN1_COFB1_REQ34 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_34/McuPeripheralClockEnable - true 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_34/McuPeripheralName - RTC 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_35/McuModeEntrySlot - PRTN1_COFB1_REQ42 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_35/McuPeripheralClockEnable - true 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_35/McuPeripheralName - SIUL2_VIRTWRAPPER_PDAC3 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_36/McuModeEntrySlot - PRTN1_COFB1_REQ45 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_36/McuPeripheralClockEnable - true 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_36/McuPeripheralName - WKPU 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_37/McuModeEntrySlot - PRTN1_COFB1_REQ47 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_37/McuPeripheralClockEnable - false 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_37/McuPeripheralName - CMUs 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_38/McuModeEntrySlot - PRTN1_COFB1_REQ49 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_38/McuPeripheralClockEnable - true 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_38/McuPeripheralName - TSPC 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_39/McuModeEntrySlot - PRTN1_COFB1_REQ51 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_39/McuPeripheralClockEnable - true 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_39/McuPeripheralName - SXOSC 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_4/McuModeEntrySlot - PRTN0_COFB1_REQ36 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_4/McuPeripheralClockEnable - true 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_4/McuPeripheralName - EMIOS_2 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_40/McuModeEntrySlot - PRTN1_COFB1_REQ53 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_40/McuPeripheralClockEnable - true 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_40/McuPeripheralName - FXOSC 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_41/McuModeEntrySlot - PRTN1_COFB1_REQ56 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_41/McuPeripheralClockEnable - true 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_41/McuPeripheralName - PLL 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_42/McuModeEntrySlot - PRTN1_COFB1_REQ63 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_42/McuPeripheralClockEnable - false 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_42/McuPeripheralName - PIT_2 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_43/McuModeEntrySlot - PRTN1_COFB2_REQ65 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_43/McuPeripheralClockEnable - true 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_43/McuPeripheralName - FlexCAN_0 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_44/McuModeEntrySlot - PRTN1_COFB2_REQ66 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_44/McuPeripheralClockEnable - true 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_44/McuPeripheralName - FlexCAN_1 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_45/McuModeEntrySlot - PRTN1_COFB2_REQ67 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_45/McuPeripheralClockEnable - true 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_45/McuPeripheralName - FlexCAN_2 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_46/McuModeEntrySlot - PRTN1_COFB2_REQ68 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_46/McuPeripheralClockEnable - true 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_46/McuPeripheralName - FlexCAN_3 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_47/McuModeEntrySlot - PRTN1_COFB2_REQ69 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_47/McuPeripheralClockEnable - true 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_47/McuPeripheralName - FlexCAN_4 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_48/McuModeEntrySlot - PRTN1_COFB2_REQ70 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_48/McuPeripheralClockEnable - true 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_48/McuPeripheralName - FlexCAN_5 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_49/McuModeEntrySlot - PRTN1_COFB2_REQ73 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_49/McuPeripheralClockEnable - true 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_49/McuPeripheralName - FlexIO 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_5/McuModeEntrySlot - PRTN0_COFB1_REQ38 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_5/McuPeripheralClockEnable - true 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_5/McuPeripheralName - LCU_0 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_50/McuModeEntrySlot - PRTN1_COFB2_REQ74 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_50/McuPeripheralClockEnable - false 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_50/McuPeripheralName - LPUART_0 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_51/McuModeEntrySlot - PRTN1_COFB2_REQ75 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_51/McuPeripheralClockEnable - false 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_51/McuPeripheralName - LPUART_1 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_52/McuModeEntrySlot - PRTN1_COFB2_REQ76 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_52/McuPeripheralClockEnable - false 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_52/McuPeripheralName - LPUART_2 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_53/McuModeEntrySlot - PRTN1_COFB2_REQ77 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_53/McuPeripheralClockEnable - false 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_53/McuPeripheralName - LPUART_3 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_54/McuModeEntrySlot - PRTN1_COFB2_REQ78 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_54/McuPeripheralClockEnable - false 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_54/McuPeripheralName - LPUART_4 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_55/McuModeEntrySlot - PRTN1_COFB2_REQ79 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_55/McuPeripheralClockEnable - true 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_55/McuPeripheralName - LPUART_5 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_56/McuModeEntrySlot - PRTN1_COFB2_REQ80 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_56/McuPeripheralClockEnable - true 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_56/McuPeripheralName - LPUART_6 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_57/McuModeEntrySlot - PRTN1_COFB2_REQ81 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_57/McuPeripheralClockEnable - false 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_57/McuPeripheralName - LPUART_7 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_58/McuModeEntrySlot - PRTN1_COFB2_REQ84 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_58/McuPeripheralClockEnable - true 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_58/McuPeripheralName - LPI2C_0 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_59/McuModeEntrySlot - PRTN1_COFB2_REQ85 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_59/McuPeripheralClockEnable - true 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_59/McuPeripheralName - LPI2C_1 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_6/McuModeEntrySlot - PRTN0_COFB1_REQ39 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_6/McuPeripheralClockEnable - true 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_6/McuPeripheralName - LCU_1 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_60/McuModeEntrySlot - PRTN1_COFB2_REQ86 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_60/McuPeripheralClockEnable - true 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_60/McuPeripheralName - LPSPI_0 
