Caler10/RBCM_S32K344_AUTOSAR_MBD/Firmware/S32K344_DAPlink/S32K344_LED/S32K344_LED_ert_rtw/MW_target_hardware_resources.h
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_61/McuModeEntrySlot - PRTN1_COFB2_REQ87 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_61/McuPeripheralClockEnable - true 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_61/McuPeripheralName - LPSPI_1 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_62/McuModeEntrySlot - PRTN1_COFB2_REQ88 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_62/McuPeripheralClockEnable - true 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_62/McuPeripheralName - LPSPI_2 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_63/McuModeEntrySlot - PRTN1_COFB2_REQ89 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_63/McuPeripheralClockEnable - true 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_63/McuPeripheralName - LPSPI_3 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_64/McuModeEntrySlot - PRTN1_COFB2_REQ91 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_64/McuPeripheralClockEnable - false 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_64/McuPeripheralName - SAI_0 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_65/McuModeEntrySlot - PRTN1_COFB2_REQ92 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_65/McuPeripheralClockEnable - true 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_65/McuPeripheralName - LPCMP_0 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_66/McuModeEntrySlot - PRTN1_COFB2_REQ93 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_66/McuPeripheralClockEnable - true 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_66/McuPeripheralName - LPCMP_1 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_67/McuModeEntrySlot - PRTN1_COFB2_REQ95 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_67/McuPeripheralClockEnable - false 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_67/McuPeripheralName - TEMPSENSE 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_68/McuModeEntrySlot - PRTN1_COFB3_REQ96 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_68/McuPeripheralClockEnable - false 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_68/McuPeripheralName - CRC 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_69/McuModeEntrySlot - PRTN1_COFB3_REQ104 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_69/McuPeripheralClockEnable - true 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_69/McuPeripheralName - STCU_2 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_7/McuModeEntrySlot - PRTN0_COFB1_REQ40 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_7/McuPeripheralClockEnable - true 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_7/McuPeripheralName - ADC_0 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_70/McuModeEntrySlot - PRTN2_COFB0_REQ4 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_70/McuPeripheralClockEnable - false 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_70/McuPeripheralName - EDMA_TCD_12 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_71/McuModeEntrySlot - PRTN2_COFB0_REQ5 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_71/McuPeripheralClockEnable - false 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_71/McuPeripheralName - EDMA_TCD_13 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_72/McuModeEntrySlot - PRTN2_COFB0_REQ6 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_72/McuPeripheralClockEnable - false 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_72/McuPeripheralName - EDMA_TCD_14 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_73/McuModeEntrySlot - PRTN2_COFB0_REQ7 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_73/McuPeripheralClockEnable - false 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_73/McuPeripheralName - EDMA_TCD_15 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_74/McuModeEntrySlot - PRTN2_COFB0_REQ8 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_74/McuPeripheralClockEnable - false 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_74/McuPeripheralName - EDMA_TCD_16 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_75/McuModeEntrySlot - PRTN2_COFB0_REQ9 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_75/McuPeripheralClockEnable - false 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_75/McuPeripheralName - EDMA_TCD_17 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_76/McuModeEntrySlot - PRTN2_COFB0_REQ10 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_76/McuPeripheralClockEnable - false 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_76/McuPeripheralName - EDMA_TCD_18 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_77/McuModeEntrySlot - PRTN2_COFB0_REQ11 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_77/McuPeripheralClockEnable - false 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_77/McuPeripheralName - EDMA_TCD_19 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_78/McuModeEntrySlot - PRTN2_COFB0_REQ12 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_78/McuPeripheralClockEnable - false 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_78/McuPeripheralName - EDMA_TCD_20 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_79/McuModeEntrySlot - PRTN2_COFB0_REQ13 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_79/McuPeripheralClockEnable - false 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_79/McuPeripheralName - EDMA_TCD_21 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_8/McuModeEntrySlot - PRTN0_COFB1_REQ41 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_8/McuPeripheralClockEnable - true 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_8/McuPeripheralName - ADC_1 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_80/McuModeEntrySlot - PRTN2_COFB0_REQ14 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_80/McuPeripheralClockEnable - false 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_80/McuPeripheralName - EDMA_TCD_22 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_81/McuModeEntrySlot - PRTN2_COFB0_REQ15 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_81/McuPeripheralClockEnable - false 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_81/McuPeripheralName - EDMA_TCD_23 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_82/McuModeEntrySlot - PRTN2_COFB0_REQ16 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_82/McuPeripheralClockEnable - false 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_82/McuPeripheralName - EDMA_TCD_24 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_83/McuModeEntrySlot - PRTN2_COFB0_REQ17 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_83/McuPeripheralClockEnable - false 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_83/McuPeripheralName - EDMA_TCD_25 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_84/McuModeEntrySlot - PRTN2_COFB0_REQ18 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_84/McuPeripheralClockEnable - false 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_84/McuPeripheralName - EDMA_TCD_26 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_85/McuModeEntrySlot - PRTN2_COFB0_REQ19 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_85/McuPeripheralClockEnable - false 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_85/McuPeripheralName - EDMA_TCD_27 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_86/McuModeEntrySlot - PRTN2_COFB0_REQ20 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_86/McuPeripheralClockEnable - false 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_86/McuPeripheralName - EDMA_TCD_28 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_87/McuModeEntrySlot - PRTN2_COFB0_REQ21 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_87/McuPeripheralClockEnable - false 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_87/McuPeripheralName - EDMA_TCD_29 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_88/McuModeEntrySlot - PRTN2_COFB0_REQ22 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_88/McuPeripheralClockEnable - false 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_88/McuPeripheralName - EDMA_TCD_30 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_89/McuModeEntrySlot - PRTN2_COFB0_REQ23 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_89/McuPeripheralClockEnable - false 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_89/McuPeripheralName - EDMA_TCD_31 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_9/McuModeEntrySlot - PRTN0_COFB1_REQ42 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_9/McuPeripheralClockEnable - true 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_9/McuPeripheralName - ADC_2 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_90/McuModeEntrySlot - PRTN2_COFB0_REQ24 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_90/McuPeripheralClockEnable - false 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_90/McuPeripheralName - SEMA_42 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_91/McuModeEntrySlot - PRTN2_COFB0_REQ29 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_91/McuPeripheralClockEnable - true 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_91/McuPeripheralName - STM_1 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_92/McuModeEntrySlot - PRTN2_COFB1_REQ32 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_92/McuPeripheralClockEnable - false 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_92/McuPeripheralName - EMAC 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_93/McuModeEntrySlot - PRTN2_COFB1_REQ35 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_93/McuPeripheralClockEnable - false 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_93/McuPeripheralName - LPUART_8 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_94/McuModeEntrySlot - PRTN2_COFB1_REQ36 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_94/McuPeripheralClockEnable - false 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_94/McuPeripheralName - LPUART_9 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_95/McuModeEntrySlot - PRTN2_COFB1_REQ37 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_95/McuPeripheralClockEnable - false 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_95/McuPeripheralName - LPUART_10 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_96/McuModeEntrySlot - PRTN2_COFB1_REQ38 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_96/McuPeripheralClockEnable - false 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_96/McuPeripheralName - LPUART_11 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_97/McuModeEntrySlot - PRTN2_COFB1_REQ39 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_97/McuPeripheralClockEnable - false 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_97/McuPeripheralName - LPUART_12 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_98/McuModeEntrySlot - PRTN2_COFB1_REQ40 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_98/McuPeripheralClockEnable - true 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_98/McuPeripheralName - LPUART_13 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_99/McuModeEntrySlot - PRTN2_COFB1_REQ41 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_99/McuPeripheralClockEnable - false 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPartitionConfiguration/McuPeripheral_99/McuPeripheralName - LPUART_14 
/Mcu/McuModuleConfiguration/McuModeSettingConf_0/McuPowerMode - RUN 
/Mcu/McuModuleConfiguration/McuPowerControl - McuPowerControl 
/Mcu/McuModuleConfiguration/McuPowerControl/McuPMC_Config - McuPMC_Config 
/Mcu/McuModuleConfiguration/McuPowerControl/McuPMC_Config/McuFASTRECEnable - false 
/Mcu/McuModuleConfiguration/McuPowerControl/McuPMC_Config/McuHVDIEEnable - false 
/Mcu/McuModuleConfiguration/McuPowerControl/McuPMC_Config/McuLMAUTOENEnable - false 
/Mcu/McuModuleConfiguration/McuPowerControl/McuPMC_Config/McuLMBCTLENEnable - true 
/Mcu/McuModuleConfiguration/McuPowerControl/McuPMC_Config/McuLMENEnable - true 
/Mcu/McuModuleConfiguration/McuPowerControl/McuPMC_Config/McuLPM25ENEnable - false 
/Mcu/McuModuleConfiguration/McuPowerControl/McuPMC_Config/McuLVDIEEnable - false 
/Mcu/McuModuleConfiguration/McuPowerControl/McuPMC_Config/McuLVRBLPENEnable - false 
/Mcu/McuModuleConfiguration/McuRamSectorSettingConf - McuRamSectorSettingConf_0 
/Mcu/McuModuleConfiguration/McuRamSectorSettingConf_0/McuRamDefaultValue - 0 
/Mcu/McuModuleConfiguration/McuRamSectorSettingConf_0/McuRamSectionBaseAddrLinkerSym -  
/Mcu/McuModuleConfiguration/McuRamSectorSettingConf_0/McuRamSectionBaseAddress - 541065216 
/Mcu/McuModuleConfiguration/McuRamSectorSettingConf_0/McuRamSectionSize - 327680 
/Mcu/McuModuleConfiguration/McuRamSectorSettingConf_0/McuRamSectionSizeLinkerSym -  
/Mcu/McuModuleConfiguration/McuRamSectorSettingConf_0/McuRamSectionWriteSize - 8 
/Mcu/McuModuleConfiguration/McuRamSectorSettingConf_0/McuRamSectorId - 0 
/Mcu/McuModuleConfiguration/McuResetConfig - McuResetConfig 
/Mcu/McuModuleConfiguration/McuResetConfig/McuDestResetEscThreshold - 0 
/Mcu/McuModuleConfiguration/McuResetConfig/McuFuncResetEscThreshold - 15 
/Mcu/McuModuleConfiguration/McuResetConfig/McuResetSourcesConfig - McuResetSourcesConfig 
/Mcu/McuModuleConfiguration/McuResetConfig/McuResetSourcesConfig/McuDEBUG_FUNC_ResetSource - McuDEBUG_FUNC_ResetSource 
/Mcu/McuModuleConfiguration/McuResetConfig/McuResetSourcesConfig/McuDEBUG_FUNC_ResetSource/McuDisableReset - false 
/Mcu/McuModuleConfiguration/McuResetConfig/McuResetSourcesConfig/McuFCCU_RST_ResetSource - McuFCCU_RST_ResetSource 
/Mcu/McuModuleConfiguration/McuResetConfig/McuResetSourcesConfig/McuFCCU_RST_ResetSource/McuDisableReset - false 
/Mcu/McuModuleConfiguration/McuResetConfig/McuResetSourcesConfig/McuJTAG_RST_ResetSource - McuJTAG_RST_ResetSource 
/Mcu/McuModuleConfiguration/McuResetConfig/McuResetSourcesConfig/McuJTAG_RST_ResetSource/McuDisableReset - false 
/Mcu/McuModuleConfiguration/McuResetConfig/McuResetSourcesConfig/McuSWT0_RST_ResetSource - McuSWT0_RST_ResetSource 
/Mcu/McuModuleConfiguration/McuResetConfig/McuResetSourcesConfig/McuSWT0_RST_ResetSource/McuDisableReset - false 
/Mcu/McuModuleConfiguration/McuResetConfig/McuResetType - FunctionalReset 
/Mcu/McuPublishedInformation - McuPublishedInformation 
/Mcu/McuPublishedInformation/MCU_AIPS_PLAT_CLK_FAIL_RESET/McuResetReason - 7 
/Mcu/McuPublishedInformation/MCU_CM7_CORE_CLK_FAIL_RESET/McuResetReason - 10 
/Mcu/McuPublishedInformation/MCU_CORE_CLK_FAIL_RESET/McuResetReason - 6 
/Mcu/McuPublishedInformation/MCU_DEBUG_DEST_RESET/McuResetReason - 14 
/Mcu/McuPublishedInformation/MCU_DEBUG_FUNC_RESET/McuResetReason - 27 
/Mcu/McuPublishedInformation/MCU_FCCU_FTR_RESET/McuResetReason - 1 
/Mcu/McuPublishedInformation/MCU_FCCU_RST_RESET/McuResetReason - 16 
/Mcu/McuPublishedInformation/MCU_FXOSC_FAIL_RESET/McuResetReason - 4 
/Mcu/McuPublishedInformation/MCU_F_EXR_RESET/McuResetReason - 15 
/Mcu/McuPublishedInformation/MCU_HSE_BOOT_RST_RESET/McuResetReason - 25 
/Mcu/McuPublishedInformation/MCU_HSE_CLK_FAIL_RESET/McuResetReason - 8 
/Mcu/McuPublishedInformation/MCU_HSE_SNVS_RST_RESET/McuResetReason - 12 
/Mcu/McuPublishedInformation/MCU_HSE_SWT_RST_RESET/McuResetReason - 24 
/Mcu/McuPublishedInformation/MCU_HSE_TMPR_RST_RESET/McuResetReason - 11 
/Mcu/McuPublishedInformation/MCU_JTAG_RST_RESET/McuResetReason - 21 
/Mcu/McuPublishedInformation/MCU_MC_RGM_FRE_RESET/McuResetReason - 3 
/Mcu/McuPublishedInformation/MCU_MULTIPLE_RESET_REASON/McuResetReason - 30 
/Mcu/McuPublishedInformation/MCU_NO_RESET_REASON/McuResetReason - 29 
/Mcu/McuPublishedInformation/MCU_PLL_AUX_RESET/McuResetReason - 23 
/Mcu/McuPublishedInformation/MCU_PLL_LOL_RESET/McuResetReason - 5 
/Mcu/McuPublishedInformation/MCU_POWER_ON_RESET/McuResetReason - 0 
/Mcu/McuPublishedInformation/MCU_RESET_UNDEFINED/McuResetReason - 31 
/Mcu/McuPublishedInformation/MCU_STCU_URF_RESET/McuResetReason - 2 
/Mcu/McuPublishedInformation/MCU_ST_DONE_RESET/McuResetReason - 17 
/Mcu/McuPublishedInformation/MCU_SWT0_RST_RESET/McuResetReason - 18 
/Mcu/McuPublishedInformation/MCU_SWT1_RST_RESET/McuResetReason - 19 
/Mcu/McuPublishedInformation/MCU_SWT2_RST_RESET/McuResetReason - 20 
/Mcu/McuPublishedInformation/MCU_SWT3_RST_RESET/McuResetReason - 22 
/Mcu/McuPublishedInformation/MCU_SW_DEST_RESET/McuResetReason - 13 
/Mcu/McuPublishedInformation/MCU_SW_FUNC_RESET/McuResetReason - 26 
/Mcu/McuPublishedInformation/MCU_SYS_DIV_FAIL_RESET/McuResetReason - 9 
/Mcu/McuPublishedInformation/MCU_WAKEUP_REASON/McuResetReason - 28 
/Mcu/McuPublishedInformation/McuResetReasonConf - MCU_AIPS_PLAT_CLK_FAIL_RESET MCU_CM7_CORE_CLK_FAIL_RESET MCU_CORE_CLK_FAIL_RESET MCU_DEBUG_DEST_RESET MCU_DEBUG_FUNC_RESET MCU_FCCU_FTR_RESET MCU_FCCU_RST_RESET MCU_FXOSC_FAIL_RESET MCU_F_EXR_RESET MCU_HSE_BOOT_RST_RESET MCU_HSE_CLK_FAIL_RESET MCU_HSE_SNVS_RST_RESET MCU_HSE_SWT_RST_RESET MCU_HSE_TMPR_RST_RESET MCU_JTAG_RST_RESET MCU_MC_RGM_FRE_RESET MCU_MULTIPLE_RESET_REASON MCU_NO_RESET_REASON MCU_PLL_AUX_RESET MCU_PLL_LOL_RESET MCU_POWER_ON_RESET MCU_RESET_UNDEFINED MCU_STCU_URF_RESET MCU_ST_DONE_RESET MCU_SWT0_RST_RESET MCU_SWT1_RST_RESET MCU_SWT2_RST_RESET MCU_SWT3_RST_RESET MCU_SW_DEST_RESET MCU_SW_FUNC_RESET MCU_SYS_DIV_FAIL_RESET MCU_WAKEUP_REASON 
/Mcu/POST_BUILD_VARIANT_USED - false 

