Caler10/RBCM_S32K344_AUTOSAR_MBD/Firmware/S32K344_DAPlink/S32K344_LED/S32K344_LED_ert_rtw/MW_target_hardware_resources.h
*/
#define MW_DETAILS_MCU 
#define MW_OPEN_MCU 
#define MW_UPDATE_MCU 
#define MW_RESTORE_MCU 
#define MW_MEM_43_INFLS_INFO /*
/Mem - Mem 
/Mem/CommonPublishedInformation - CommonPublishedInformation 
/Mem/CommonPublishedInformation/ArReleaseMajorVersion - 4 
/Mem/CommonPublishedInformation/ArReleaseMinorVersion - 7 
/Mem/CommonPublishedInformation/ArReleaseRevisionVersion - 0 
/Mem/CommonPublishedInformation/ModuleId - 91 
/Mem/CommonPublishedInformation/SwMajorVersion - 4 
/Mem/CommonPublishedInformation/SwMinorVersion - 0 
/Mem/CommonPublishedInformation/SwPatchVersion - 0 
/Mem/CommonPublishedInformation/VendorApiInfix - INFLS 
/Mem/CommonPublishedInformation/VendorId - 43 
/Mem/IMPLEMENTATION-CONFIG-VARIANT - VARIANT-PRE-COMPILE 
/Mem/MemAutosarExt - MemAutosarExt 
/Mem/MemAutosarExt/MemBlock4PipeSelect - MEM_COMMAND_PIPE_0 
/Mem/MemAutosarExt/MemEccDataErrorSuppression - true 
/Mem/MemAutosarExt/MemEnableUserModeSupport - false 
/Mem/MemAutosarExt/MemSynchronizeCache - true 
/Mem/MemAutosarExt/MemUsesAlterInterface - false 
/Mem/MemGeneral - MemGeneral 
/Mem/MemGeneral/MemAbortTimeout - 0 
/Mem/MemGeneral/MemAcCallback - MBDT_Mem_AccessCode_Callback 
/Mem/MemGeneral/MemAcErase - 0 
/Mem/MemGeneral/MemAcErasePointer - NULL_PTR 
/Mem/MemGeneral/MemAcLoadOnJobStart - false 
/Mem/MemGeneral/MemAcWrite - 0 
/Mem/MemGeneral/MemAcWritePointer - NULL_PTR 
/Mem/MemGeneral/MemCleanCacheAfterLoadAc - false 
/Mem/MemGeneral/MemDevErrorDetect - false 
/Mem/MemGeneral/MemEnableCheckCfgCrc - true 
/Mem/MemGeneral/MemEraseResumeTimeout - 0 
/Mem/MemGeneral/MemEraseSuspendTimeout - 0 
/Mem/MemGeneral/MemEraseTimeout - 0 
/Mem/MemGeneral/MemEraseVerificationEnabled - true 
/Mem/MemGeneral/MemFinishedFlashAccessNotif - MBDT_Mem_FinishedFlashAccess_Notification 
/Mem/MemGeneral/MemHwCompareService - true 
/Mem/MemGeneral/MemHwUtestModeService - false 
/Mem/MemGeneral/MemSectorSetLockApi - true 
/Mem/MemGeneral/MemStartFlashAccessNotif - MBDT_Mem_StartFlashAccess_Notification 
/Mem/MemGeneral/MemTimeoutMethod - OSIF_COUNTER_DUMMY 
/Mem/MemGeneral/MemTimeoutSupervisionEnabled - false 
/Mem/MemGeneral/MemUtestResumeTimeout - 0 
/Mem/MemGeneral/MemUtestSuspendTimeout - 0 
/Mem/MemGeneral/MemWriteTimeout - 0 
/Mem/MemGeneral/MemWriteVerificationEnabled - true 
/Mem/MemInstance - MemInstance_0 
/Mem/MemInstance_0/MemInstanceId - 0 
/Mem/MemInstance_0/MemSectorBatch - MemSectorBatch 
/Mem/MemInstance_0/MemSectorBatch/MemEraseSectorSize - 8192 
/Mem/MemInstance_0/MemSectorBatch/MemNumberOfSectors - 1 
/Mem/MemInstance_0/MemSectorBatch/MemPhysicalSector - FLS_DATA_ARRAY_0_BLOCK_4_S000 
/Mem/MemInstance_0/MemSectorBatch/MemReadPageSize - 1 
/Mem/MemInstance_0/MemSectorBatch/MemSpecifiedEraseCycles - 0 
/Mem/MemInstance_0/MemSectorBatch/MemStartAddress - 268435456 
/Mem/MemInstance_0/MemSectorBatch/MemWritePageSize - 8 
/Mem/MemPublishedInformation - MemPublishedInformation 
/Mem/MemPublishedInformation/MemECCValue - 1427461397 
/Mem/MemPublishedInformation/MemErasedValue - 4294967295 
/Mem/MemUtestConfig - MemUtestConfig_0 
/Mem/MemUtestConfig_0/MemUtestArrayIntegritySequence - C40_IP_PROPRIETARY_SEQUENCE 
/Mem/MemUtestConfig_0/MemUtestBlockToCheckIntegrity - C40_IP_CODE_BLOCK_0 
/Mem/MemUtestConfig_0/MemUtestBreakpoints - C40_IP_BREAKPOINTS_ON_DBD 
/Mem/MemUtestConfig_0/MemUtestInstanceIdRef - /Mem_43_INFLS/Mem/MemInstance_0 
/Mem/MemUtestConfig_0/MemUtestMarginLevels - C40_IP_MARGIN_LEVEL_PROGRAM 
/Mem/POST_BUILD_VARIANT_USED - false 

*/
#define MW_DETAILS_MEM_43_INFLS 
#define MW_OPEN_MEM_43_INFLS 
#define MW_UPDATE_MEM_43_INFLS 
#define MW_RESTORE_MEM_43_INFLS 
#define MW_PLATFORM_INFO /*
/Platform - Platform 
/Platform/CommonPublishedInformation - CommonPublishedInformation 
/Platform/CommonPublishedInformation/ArReleaseMajorVersion - 4 
/Platform/CommonPublishedInformation/ArReleaseMinorVersion - 7 
/Platform/CommonPublishedInformation/ArReleaseRevisionVersion - 0 
/Platform/CommonPublishedInformation/ModuleId - 255 
/Platform/CommonPublishedInformation/SwMajorVersion - 3 
/Platform/CommonPublishedInformation/SwMinorVersion - 0 
/Platform/CommonPublishedInformation/SwPatchVersion - 0 
/Platform/CommonPublishedInformation/VendorId - 43 
/Platform/GeneralConfiguration - GeneralConfiguration 
/Platform/GeneralConfiguration/PlatformDevErrorDetect - false 
/Platform/GeneralConfiguration/PlatformEnableUserModeSupport - false 
/Platform/GeneralConfiguration/PlatformIntmConfigurable - false 
/Platform/GeneralConfiguration/PlatformIpAPIsAvailable - false 
/Platform/GeneralConfiguration/PlatformMcmConfigurable - false 
/Platform/GeneralConfiguration/PlatformMpuM7Configurable - false 
/Platform/GeneralConfiguration/PlatformMulticoreSupport - false 
/Platform/IMPLEMENTATION-CONFIG-VARIANT - VARIANT-PRE-COMPILE 
/Platform/IntCtrlConfig - IntCtrlConfig 
/Platform/IntCtrlConfig/PlatformIsrConfig - PlatformIsrConfig_0 PlatformIsrConfig_1 PlatformIsrConfig_10 PlatformIsrConfig_100 PlatformIsrConfig_101 PlatformIsrConfig_102 PlatformIsrConfig_103 PlatformIsrConfig_104 PlatformIsrConfig_105 PlatformIsrConfig_106 PlatformIsrConfig_107 PlatformIsrConfig_108 PlatformIsrConfig_109 PlatformIsrConfig_11 PlatformIsrConfig_110 PlatformIsrConfig_111 PlatformIsrConfig_112 PlatformIsrConfig_113 PlatformIsrConfig_114 PlatformIsrConfig_115 PlatformIsrConfig_116 PlatformIsrConfig_117 PlatformIsrConfig_118 PlatformIsrConfig_119 PlatformIsrConfig_12 PlatformIsrConfig_120 PlatformIsrConfig_121 PlatformIsrConfig_122 PlatformIsrConfig_123 PlatformIsrConfig_124 PlatformIsrConfig_125 PlatformIsrConfig_126 PlatformIsrConfig_127 PlatformIsrConfig_128 PlatformIsrConfig_129 PlatformIsrConfig_13 PlatformIsrConfig_130 PlatformIsrConfig_131 PlatformIsrConfig_132 PlatformIsrConfig_133 PlatformIsrConfig_134 PlatformIsrConfig_135 PlatformIsrConfig_136 PlatformIsrConfig_137 PlatformIsrConfig_138 PlatformIsrConfig_139 PlatformIsrConfig_14 PlatformIsrConfig_140 PlatformIsrConfig_141 PlatformIsrConfig_142 PlatformIsrConfig_143 PlatformIsrConfig_144 PlatformIsrConfig_145 PlatformIsrConfig_146 PlatformIsrConfig_147 PlatformIsrConfig_15 PlatformIsrConfig_16 PlatformIsrConfig_17 PlatformIsrConfig_18 PlatformIsrConfig_19 PlatformIsrConfig_2 PlatformIsrConfig_20 PlatformIsrConfig_21 PlatformIsrConfig_22 PlatformIsrConfig_23 PlatformIsrConfig_24 PlatformIsrConfig_25 PlatformIsrConfig_26 PlatformIsrConfig_27 PlatformIsrConfig_28 PlatformIsrConfig_29 PlatformIsrConfig_3 PlatformIsrConfig_30 PlatformIsrConfig_31 PlatformIsrConfig_32 PlatformIsrConfig_33 PlatformIsrConfig_34 PlatformIsrConfig_35 PlatformIsrConfig_36 PlatformIsrConfig_37 PlatformIsrConfig_38 PlatformIsrConfig_39 PlatformIsrConfig_4 PlatformIsrConfig_40 PlatformIsrConfig_41 PlatformIsrConfig_43 PlatformIsrConfig_45 PlatformIsrConfig_46 PlatformIsrConfig_47 PlatformIsrConfig_48 PlatformIsrConfig_49 PlatformIsrConfig_5 PlatformIsrConfig_50 PlatformIsrConfig_51 PlatformIsrConfig_52 PlatformIsrConfig_53 PlatformIsrConfig_54 PlatformIsrConfig_55 PlatformIsrConfig_56 PlatformIsrConfig_57 PlatformIsrConfig_58 PlatformIsrConfig_59 PlatformIsrConfig_6 PlatformIsrConfig_60 PlatformIsrConfig_61 PlatformIsrConfig_62 PlatformIsrConfig_63 PlatformIsrConfig_64 PlatformIsrConfig_65 PlatformIsrConfig_66 PlatformIsrConfig_67 PlatformIsrConfig_68 PlatformIsrConfig_69 PlatformIsrConfig_7 PlatformIsrConfig_70 PlatformIsrConfig_71 PlatformIsrConfig_72 PlatformIsrConfig_73 PlatformIsrConfig_74 PlatformIsrConfig_75 PlatformIsrConfig_76 PlatformIsrConfig_77 PlatformIsrConfig_78 PlatformIsrConfig_79 PlatformIsrConfig_8 PlatformIsrConfig_80 PlatformIsrConfig_81 PlatformIsrConfig_82 PlatformIsrConfig_83 PlatformIsrConfig_84 PlatformIsrConfig_85 PlatformIsrConfig_86 PlatformIsrConfig_87 PlatformIsrConfig_88 PlatformIsrConfig_89 PlatformIsrConfig_9 PlatformIsrConfig_90 PlatformIsrConfig_91 PlatformIsrConfig_92 PlatformIsrConfig_93 PlatformIsrConfig_94 PlatformIsrConfig_95 PlatformIsrConfig_96 PlatformIsrConfig_97 PlatformIsrConfig_98 PlatformIsrConfig_99 
/Platform/IntCtrlConfig/PlatformIsrConfig_0/IsrEnabled - false 
/Platform/IntCtrlConfig/PlatformIsrConfig_0/IsrHandler - undefined_handler 
/Platform/IntCtrlConfig/PlatformIsrConfig_0/IsrName - INT0_IRQn 
/Platform/IntCtrlConfig/PlatformIsrConfig_0/IsrPriority - 0 
/Platform/IntCtrlConfig/PlatformIsrConfig_1/IsrEnabled - false 
/Platform/IntCtrlConfig/PlatformIsrConfig_1/IsrHandler - undefined_handler 
/Platform/IntCtrlConfig/PlatformIsrConfig_1/IsrName - INT1_IRQn 
/Platform/IntCtrlConfig/PlatformIsrConfig_1/IsrPriority - 0 
/Platform/IntCtrlConfig/PlatformIsrConfig_10/IsrEnabled - false 
/Platform/IntCtrlConfig/PlatformIsrConfig_10/IsrHandler - undefined_handler 
/Platform/IntCtrlConfig/PlatformIsrConfig_10/IsrName - DMATCD6_IRQn 
/Platform/IntCtrlConfig/PlatformIsrConfig_10/IsrPriority - 0 
/Platform/IntCtrlConfig/PlatformIsrConfig_100/IsrEnabled - true 
/Platform/IntCtrlConfig/PlatformIsrConfig_100/IsrHandler - CAN4_ORED_0_31_MB_IRQHandler 
/Platform/IntCtrlConfig/PlatformIsrConfig_100/IsrName - FlexCAN4_1_IRQn 
/Platform/IntCtrlConfig/PlatformIsrConfig_100/IsrPriority - 5 
/Platform/IntCtrlConfig/PlatformIsrConfig_101/IsrEnabled - false 
/Platform/IntCtrlConfig/PlatformIsrConfig_101/IsrHandler - undefined_handler 
/Platform/IntCtrlConfig/PlatformIsrConfig_101/IsrName - FlexCAN5_0_IRQn 
/Platform/IntCtrlConfig/PlatformIsrConfig_101/IsrPriority - 0 
/Platform/IntCtrlConfig/PlatformIsrConfig_102/IsrEnabled - false 
/Platform/IntCtrlConfig/PlatformIsrConfig_102/IsrHandler - undefined_handler 
/Platform/IntCtrlConfig/PlatformIsrConfig_102/IsrName - FlexCAN5_1_IRQn 
/Platform/IntCtrlConfig/PlatformIsrConfig_102/IsrPriority - 0 
/Platform/IntCtrlConfig/PlatformIsrConfig_103/IsrEnabled - true 
/Platform/IntCtrlConfig/PlatformIsrConfig_103/IsrHandler - MCL_FLEXIO_ISR 
/Platform/IntCtrlConfig/PlatformIsrConfig_103/IsrName - FLEXIO_IRQn 
/Platform/IntCtrlConfig/PlatformIsrConfig_103/IsrPriority - 5 
/Platform/IntCtrlConfig/PlatformIsrConfig_104/IsrEnabled - false 
/Platform/IntCtrlConfig/PlatformIsrConfig_104/IsrHandler - undefined_handler 
/Platform/IntCtrlConfig/PlatformIsrConfig_104/IsrName - LPUART0_IRQn 
/Platform/IntCtrlConfig/PlatformIsrConfig_104/IsrPriority - 0 
/Platform/IntCtrlConfig/PlatformIsrConfig_105/IsrEnabled - false 
/Platform/IntCtrlConfig/PlatformIsrConfig_105/IsrHandler - undefined_handler 
/Platform/IntCtrlConfig/PlatformIsrConfig_105/IsrName - LPUART1_IRQn 
/Platform/IntCtrlConfig/PlatformIsrConfig_105/IsrPriority - 0 
/Platform/IntCtrlConfig/PlatformIsrConfig_106/IsrEnabled - false 
/Platform/IntCtrlConfig/PlatformIsrConfig_106/IsrHandler - undefined_handler 
/Platform/IntCtrlConfig/PlatformIsrConfig_106/IsrName - LPUART2_IRQn 
/Platform/IntCtrlConfig/PlatformIsrConfig_106/IsrPriority - 0 
/Platform/IntCtrlConfig/PlatformIsrConfig_107/IsrEnabled - false 
/Platform/IntCtrlConfig/PlatformIsrConfig_107/IsrHandler - undefined_handler 
/Platform/IntCtrlConfig/PlatformIsrConfig_107/IsrName - LPUART3_IRQn 
/Platform/IntCtrlConfig/PlatformIsrConfig_107/IsrPriority - 0 
/Platform/IntCtrlConfig/PlatformIsrConfig_108/IsrEnabled - false 
/Platform/IntCtrlConfig/PlatformIsrConfig_108/IsrHandler - undefined_handler 
/Platform/IntCtrlConfig/PlatformIsrConfig_108/IsrName - LPUART4_IRQn 
/Platform/IntCtrlConfig/PlatformIsrConfig_108/IsrPriority - 0 
/Platform/IntCtrlConfig/PlatformIsrConfig_109/IsrEnabled - true 
/Platform/IntCtrlConfig/PlatformIsrConfig_109/IsrHandler - LPUART5_LIN_IP_RxTx_IRQHandler 
/Platform/IntCtrlConfig/PlatformIsrConfig_109/IsrName - LPUART5_IRQn 
/Platform/IntCtrlConfig/PlatformIsrConfig_109/IsrPriority - 5 
/Platform/IntCtrlConfig/PlatformIsrConfig_11/IsrEnabled - false 
/Platform/IntCtrlConfig/PlatformIsrConfig_11/IsrHandler - undefined_handler 
/Platform/IntCtrlConfig/PlatformIsrConfig_11/IsrName - DMATCD7_IRQn 
/Platform/IntCtrlConfig/PlatformIsrConfig_11/IsrPriority - 0 
/Platform/IntCtrlConfig/PlatformIsrConfig_110/IsrEnabled - true 
/Platform/IntCtrlConfig/PlatformIsrConfig_110/IsrHandler - LPUART_UART_IP_6_IRQHandler 
/Platform/IntCtrlConfig/PlatformIsrConfig_110/IsrName - LPUART6_IRQn 
/Platform/IntCtrlConfig/PlatformIsrConfig_110/IsrPriority - 5 
/Platform/IntCtrlConfig/PlatformIsrConfig_111/IsrEnabled - false 
/Platform/IntCtrlConfig/PlatformIsrConfig_111/IsrHandler - undefined_handler 
/Platform/IntCtrlConfig/PlatformIsrConfig_111/IsrName - LPUART7_IRQn 
/Platform/IntCtrlConfig/PlatformIsrConfig_111/IsrPriority - 0 
/Platform/IntCtrlConfig/PlatformIsrConfig_112/IsrEnabled - false 
/Platform/IntCtrlConfig/PlatformIsrConfig_112/IsrHandler - undefined_handler 
/Platform/IntCtrlConfig/PlatformIsrConfig_112/IsrName - LPUART8_IRQn 
/Platform/IntCtrlConfig/PlatformIsrConfig_112/IsrPriority - 0 
/Platform/IntCtrlConfig/PlatformIsrConfig_113/IsrEnabled - false 
/Platform/IntCtrlConfig/PlatformIsrConfig_113/IsrHandler - undefined_handler 
/Platform/IntCtrlConfig/PlatformIsrConfig_113/IsrName - LPUART9_IRQn 
/Platform/IntCtrlConfig/PlatformIsrConfig_113/IsrPriority - 0 
/Platform/IntCtrlConfig/PlatformIsrConfig_114/IsrEnabled - false 
/Platform/IntCtrlConfig/PlatformIsrConfig_114/IsrHandler - undefined_handler 
/Platform/IntCtrlConfig/PlatformIsrConfig_114/IsrName - LPUART10_IRQn 
/Platform/IntCtrlConfig/PlatformIsrConfig_114/IsrPriority - 0 
/Platform/IntCtrlConfig/PlatformIsrConfig_115/IsrEnabled - false 
/Platform/IntCtrlConfig/PlatformIsrConfig_115/IsrHandler - undefined_handler 
/Platform/IntCtrlConfig/PlatformIsrConfig_115/IsrName - LPUART11_IRQn 
/Platform/IntCtrlConfig/PlatformIsrConfig_115/IsrPriority - 0 
/Platform/IntCtrlConfig/PlatformIsrConfig_116/IsrEnabled - false 
/Platform/IntCtrlConfig/PlatformIsrConfig_116/IsrHandler - undefined_handler 
/Platform/IntCtrlConfig/PlatformIsrConfig_116/IsrName - LPUART12_IRQn 
/Platform/IntCtrlConfig/PlatformIsrConfig_116/IsrPriority - 0 
/Platform/IntCtrlConfig/PlatformIsrConfig_117/IsrEnabled - true 
/Platform/IntCtrlConfig/PlatformIsrConfig_117/IsrHandler - LPUART_UART_IP_13_IRQHandler 
/Platform/IntCtrlConfig/PlatformIsrConfig_117/IsrName - LPUART13_IRQn 
/Platform/IntCtrlConfig/PlatformIsrConfig_117/IsrPriority - 5 
/Platform/IntCtrlConfig/PlatformIsrConfig_118/IsrEnabled - false 
/Platform/IntCtrlConfig/PlatformIsrConfig_118/IsrHandler - undefined_handler 
/Platform/IntCtrlConfig/PlatformIsrConfig_118/IsrName - LPUART14_IRQn 
/Platform/IntCtrlConfig/PlatformIsrConfig_118/IsrPriority - 0 
/Platform/IntCtrlConfig/PlatformIsrConfig_119/IsrEnabled - false 
/Platform/IntCtrlConfig/PlatformIsrConfig_119/IsrHandler - undefined_handler 
/Platform/IntCtrlConfig/PlatformIsrConfig_119/IsrName - LPUART15_IRQn 
/Platform/IntCtrlConfig/PlatformIsrConfig_119/IsrPriority - 0 
/Platform/IntCtrlConfig/PlatformIsrConfig_12/IsrEnabled - false 
/Platform/IntCtrlConfig/PlatformIsrConfig_12/IsrHandler - undefined_handler 
/Platform/IntCtrlConfig/PlatformIsrConfig_12/IsrName - DMATCD8_IRQn 
/Platform/IntCtrlConfig/PlatformIsrConfig_12/IsrPriority - 0 
/Platform/IntCtrlConfig/PlatformIsrConfig_120/IsrEnabled - true 
/Platform/IntCtrlConfig/PlatformIsrConfig_120/IsrHandler - LPI2C0_Master_Slave_IRQHandler 
/Platform/IntCtrlConfig/PlatformIsrConfig_120/IsrName - LPI2C0_IRQn 
/Platform/IntCtrlConfig/PlatformIsrConfig_120/IsrPriority - 5 
/Platform/IntCtrlConfig/PlatformIsrConfig_121/IsrEnabled - true 
/Platform/IntCtrlConfig/PlatformIsrConfig_121/IsrHandler - LPI2C1_Master_Slave_IRQHandler 
/Platform/IntCtrlConfig/PlatformIsrConfig_121/IsrName - LPI2C1_IRQn 
/Platform/IntCtrlConfig/PlatformIsrConfig_121/IsrPriority - 5 
/Platform/IntCtrlConfig/PlatformIsrConfig_122/IsrEnabled - false 
/Platform/IntCtrlConfig/PlatformIsrConfig_122/IsrHandler - undefined_handler 
/Platform/IntCtrlConfig/PlatformIsrConfig_122/IsrName - LPSPI0_IRQn 
/Platform/IntCtrlConfig/PlatformIsrConfig_122/IsrPriority - 0 
/Platform/IntCtrlConfig/PlatformIsrConfig_123/IsrEnabled - true 
/Platform/IntCtrlConfig/PlatformIsrConfig_123/IsrHandler - Lpspi_Ip_LPSPI_1_IRQHandler 
/Platform/IntCtrlConfig/PlatformIsrConfig_123/IsrName - LPSPI1_IRQn 
/Platform/IntCtrlConfig/PlatformIsrConfig_123/IsrPriority - 4 
/Platform/IntCtrlConfig/PlatformIsrConfig_124/IsrEnabled - true 
/Platform/IntCtrlConfig/PlatformIsrConfig_124/IsrHandler - Lpspi_Ip_LPSPI_2_IRQHandler 
/Platform/IntCtrlConfig/PlatformIsrConfig_124/IsrName - LPSPI2_IRQn 
/Platform/IntCtrlConfig/PlatformIsrConfig_124/IsrPriority - 5 
/Platform/IntCtrlConfig/PlatformIsrConfig_125/IsrEnabled - false 
/Platform/IntCtrlConfig/PlatformIsrConfig_125/IsrHandler - undefined_handler 
/Platform/IntCtrlConfig/PlatformIsrConfig_125/IsrName - LPSPI3_IRQn 
/Platform/IntCtrlConfig/PlatformIsrConfig_125/IsrPriority - 0 
/Platform/IntCtrlConfig/PlatformIsrConfig_126/IsrEnabled - false 
/Platform/IntCtrlConfig/PlatformIsrConfig_126/IsrHandler - undefined_handler 
/Platform/IntCtrlConfig/PlatformIsrConfig_126/IsrName - LPSPI4_IRQn 
/Platform/IntCtrlConfig/PlatformIsrConfig_126/IsrPriority - 0 
/Platform/IntCtrlConfig/PlatformIsrConfig_127/IsrEnabled - false 
/Platform/IntCtrlConfig/PlatformIsrConfig_127/IsrHandler - undefined_handler 
/Platform/IntCtrlConfig/PlatformIsrConfig_127/IsrName - LPSPI5_IRQn 
/Platform/IntCtrlConfig/PlatformIsrConfig_127/IsrPriority - 0 
/Platform/IntCtrlConfig/PlatformIsrConfig_128/IsrEnabled - false 
/Platform/IntCtrlConfig/PlatformIsrConfig_128/IsrHandler - undefined_handler 
/Platform/IntCtrlConfig/PlatformIsrConfig_128/IsrName - QSPI_IRQn 
/Platform/IntCtrlConfig/PlatformIsrConfig_128/IsrPriority - 0 
/Platform/IntCtrlConfig/PlatformIsrConfig_129/IsrEnabled - false 
/Platform/IntCtrlConfig/PlatformIsrConfig_129/IsrHandler - undefined_handler 
/Platform/IntCtrlConfig/PlatformIsrConfig_129/IsrName - SAI0_IRQn 
/Platform/IntCtrlConfig/PlatformIsrConfig_129/IsrPriority - 0 
/Platform/IntCtrlConfig/PlatformIsrConfig_13/IsrEnabled - false 
/Platform/IntCtrlConfig/PlatformIsrConfig_13/IsrHandler - undefined_handler 
/Platform/IntCtrlConfig/PlatformIsrConfig_13/IsrName - DMATCD9_IRQn 
/Platform/IntCtrlConfig/PlatformIsrConfig_13/IsrPriority - 0 
/Platform/IntCtrlConfig/PlatformIsrConfig_130/IsrEnabled - false 
/Platform/IntCtrlConfig/PlatformIsrConfig_130/IsrHandler - undefined_handler 
/Platform/IntCtrlConfig/PlatformIsrConfig_130/IsrName - SAI1_IRQn 
/Platform/IntCtrlConfig/PlatformIsrConfig_130/IsrPriority - 0 
/Platform/IntCtrlConfig/PlatformIsrConfig_131/IsrEnabled - false 
/Platform/IntCtrlConfig/PlatformIsrConfig_131/IsrHandler - undefined_handler 
/Platform/IntCtrlConfig/PlatformIsrConfig_131/IsrName - JDC_IRQn 
/Platform/IntCtrlConfig/PlatformIsrConfig_131/IsrPriority - 0 
/Platform/IntCtrlConfig/PlatformIsrConfig_132/IsrEnabled - true 
/Platform/IntCtrlConfig/PlatformIsrConfig_132/IsrHandler - Adc_Sar_0_Isr 
/Platform/IntCtrlConfig/PlatformIsrConfig_132/IsrName - ADC0_IRQn 
/Platform/IntCtrlConfig/PlatformIsrConfig_132/IsrPriority - 5 
/Platform/IntCtrlConfig/PlatformIsrConfig_133/IsrEnabled - true 
/Platform/IntCtrlConfig/PlatformIsrConfig_133/IsrHandler - Adc_Sar_1_Isr 
/Platform/IntCtrlConfig/PlatformIsrConfig_133/IsrName - ADC1_IRQn 
/Platform/IntCtrlConfig/PlatformIsrConfig_133/IsrPriority - 5 
/Platform/IntCtrlConfig/PlatformIsrConfig_134/IsrEnabled - true 
/Platform/IntCtrlConfig/PlatformIsrConfig_134/IsrHandler - Adc_Sar_2_Isr 
/Platform/IntCtrlConfig/PlatformIsrConfig_134/IsrName - ADC2_IRQn 
/Platform/IntCtrlConfig/PlatformIsrConfig_134/IsrPriority - 5 
/Platform/IntCtrlConfig/PlatformIsrConfig_135/IsrEnabled - false 
/Platform/IntCtrlConfig/PlatformIsrConfig_135/IsrHandler - undefined_handler 
/Platform/IntCtrlConfig/PlatformIsrConfig_135/IsrName - LPCMP0_IRQn 
/Platform/IntCtrlConfig/PlatformIsrConfig_135/IsrPriority - 0 
/Platform/IntCtrlConfig/PlatformIsrConfig_136/IsrEnabled - false 
/Platform/IntCtrlConfig/PlatformIsrConfig_136/IsrHandler - undefined_handler 
/Platform/IntCtrlConfig/PlatformIsrConfig_136/IsrName - LPCMP1_IRQn 
/Platform/IntCtrlConfig/PlatformIsrConfig_136/IsrPriority - 0 
/Platform/IntCtrlConfig/PlatformIsrConfig_137/IsrEnabled - false 
/Platform/IntCtrlConfig/PlatformIsrConfig_137/IsrHandler - undefined_handler 
/Platform/IntCtrlConfig/PlatformIsrConfig_137/IsrName - LPCMP2_IRQn 
/Platform/IntCtrlConfig/PlatformIsrConfig_137/IsrPriority - 0 
/Platform/IntCtrlConfig/PlatformIsrConfig_138/IsrEnabled - false 
/Platform/IntCtrlConfig/PlatformIsrConfig_138/IsrHandler - undefined_handler 
/Platform/IntCtrlConfig/PlatformIsrConfig_138/IsrName - FCCU_0_IRQn 
/Platform/IntCtrlConfig/PlatformIsrConfig_138/IsrPriority - 0 
/Platform/IntCtrlConfig/PlatformIsrConfig_139/IsrEnabled - false 
/Platform/IntCtrlConfig/PlatformIsrConfig_139/IsrHandler - undefined_handler 
/Platform/IntCtrlConfig/PlatformIsrConfig_139/IsrName - FCCU_1_IRQn 
/Platform/IntCtrlConfig/PlatformIsrConfig_139/IsrPriority - 0 
/Platform/IntCtrlConfig/PlatformIsrConfig_14/IsrEnabled - false 
/Platform/IntCtrlConfig/PlatformIsrConfig_14/IsrHandler - undefined_handler 
/Platform/IntCtrlConfig/PlatformIsrConfig_14/IsrName - DMATCD10_IRQn 
/Platform/IntCtrlConfig/PlatformIsrConfig_14/IsrPriority - 0 
/Platform/IntCtrlConfig/PlatformIsrConfig_140/IsrEnabled - false 
/Platform/IntCtrlConfig/PlatformIsrConfig_140/IsrHandler - undefined_handler 
/Platform/IntCtrlConfig/PlatformIsrConfig_140/IsrName - STCU_LBIST_MBIST_IRQn 
/Platform/IntCtrlConfig/PlatformIsrConfig_140/IsrPriority - 0 
/Platform/IntCtrlConfig/PlatformIsrConfig_141/IsrEnabled - false 
/Platform/IntCtrlConfig/PlatformIsrConfig_141/IsrHandler - undefined_handler 
/Platform/IntCtrlConfig/PlatformIsrConfig_141/IsrName - HSE_MU0_TX_IRQn 
/Platform/IntCtrlConfig/PlatformIsrConfig_141/IsrPriority - 0 
/Platform/IntCtrlConfig/PlatformIsrConfig_142/IsrEnabled - false 
/Platform/IntCtrlConfig/PlatformIsrConfig_142/IsrHandler - undefined_handler 
/Platform/IntCtrlConfig/PlatformIsrConfig_142/IsrName - HSE_MU0_RX_IRQn 
/Platform/IntCtrlConfig/PlatformIsrConfig_142/IsrPriority - 0 
/Platform/IntCtrlConfig/PlatformIsrConfig_143/IsrEnabled - false 
/Platform/IntCtrlConfig/PlatformIsrConfig_143/IsrHandler - undefined_handler 
/Platform/IntCtrlConfig/PlatformIsrConfig_143/IsrName - HSE_MU0_ORED_IRQn 
/Platform/IntCtrlConfig/PlatformIsrConfig_143/IsrPriority - 0 
/Platform/IntCtrlConfig/PlatformIsrConfig_144/IsrEnabled - false 
/Platform/IntCtrlConfig/PlatformIsrConfig_144/IsrHandler - undefined_handler 
/Platform/IntCtrlConfig/PlatformIsrConfig_144/IsrName - HSE_MU1_TX_IRQn 
/Platform/IntCtrlConfig/PlatformIsrConfig_144/IsrPriority - 0 
/Platform/IntCtrlConfig/PlatformIsrConfig_145/IsrEnabled - false 
/Platform/IntCtrlConfig/PlatformIsrConfig_145/IsrHandler - undefined_handler 
/Platform/IntCtrlConfig/PlatformIsrConfig_145/IsrName - HSE_MU1_RX_IRQn 
/Platform/IntCtrlConfig/PlatformIsrConfig_145/IsrPriority - 0 
/Platform/IntCtrlConfig/PlatformIsrConfig_146/IsrEnabled - false 
/Platform/IntCtrlConfig/PlatformIsrConfig_146/IsrHandler - undefined_handler 
/Platform/IntCtrlConfig/PlatformIsrConfig_146/IsrName - HSE_MU1_ORED_IRQn 
/Platform/IntCtrlConfig/PlatformIsrConfig_146/IsrPriority - 0 
/Platform/IntCtrlConfig/PlatformIsrConfig_147/IsrEnabled - false 
/Platform/IntCtrlConfig/PlatformIsrConfig_147/IsrHandler - undefined_handler 
/Platform/IntCtrlConfig/PlatformIsrConfig_147/IsrName - SoC_PLL_IRQn 
/Platform/IntCtrlConfig/PlatformIsrConfig_147/IsrPriority - 0 
/Platform/IntCtrlConfig/PlatformIsrConfig_15/IsrEnabled - false 
/Platform/IntCtrlConfig/PlatformIsrConfig_15/IsrHandler - undefined_handler 
/Platform/IntCtrlConfig/PlatformIsrConfig_15/IsrName - DMATCD11_IRQn 
/Platform/IntCtrlConfig/PlatformIsrConfig_15/IsrPriority - 0 
/Platform/IntCtrlConfig/PlatformIsrConfig_16/IsrEnabled - false 
/Platform/IntCtrlConfig/PlatformIsrConfig_16/IsrHandler - undefined_handler 
/Platform/IntCtrlConfig/PlatformIsrConfig_16/IsrName - DMATCD12_IRQn 
/Platform/IntCtrlConfig/PlatformIsrConfig_16/IsrPriority - 0 
/Platform/IntCtrlConfig/PlatformIsrConfig_17/IsrEnabled - false 
/Platform/IntCtrlConfig/PlatformIsrConfig_17/IsrHandler - undefined_handler 
/Platform/IntCtrlConfig/PlatformIsrConfig_17/IsrName - DMATCD13_IRQn 
