Caler10/RBCM_S32K344_AUTOSAR_MBD/Firmware/S32K344_DAPlink/S32K344_LED/S32K344_LED_ert_rtw/MW_target_hardware_resources.h
/Platform/IntCtrlConfig/PlatformIsrConfig_99/IsrPriority - 5 
/Platform/IntmConfig - IntmConfig 
/Platform/MPU_M7_Configuration - MPU_M7_Configuration 
/Platform/POST_BUILD_VARIANT_USED - false 

*/
#define MW_DETAILS_PLATFORM 
#define MW_OPEN_PLATFORM 
#define MW_UPDATE_PLATFORM 
#define MW_RESTORE_PLATFORM 
#define MW_PORT_INFO /*
/Port - Port 
/Port/CommonPublishedInformation - CommonPublishedInformation 
/Port/CommonPublishedInformation/ArReleaseMajorVersion - 4 
/Port/CommonPublishedInformation/ArReleaseMinorVersion - 7 
/Port/CommonPublishedInformation/ArReleaseRevisionVersion - 0 
/Port/CommonPublishedInformation/ModuleId - 124 
/Port/CommonPublishedInformation/SwMajorVersion - 4 
/Port/CommonPublishedInformation/SwMinorVersion - 0 
/Port/CommonPublishedInformation/SwPatchVersion - 0 
/Port/CommonPublishedInformation/VendorApiInfix -  
/Port/CommonPublishedInformation/VendorId - 43 
/Port/IMPLEMENTATION-CONFIG-VARIANT - VARIANT-POST-BUILD 
/Port/POST_BUILD_VARIANT_USED - true 
/Port/PortConfigSet - PortConfigSet 
/Port/PortConfigSet/Adc_Pins/ADC_POT0/ImcrPdacSlot - VIRTUAL_WRAPPER_PDAC0 
/Port/PortConfigSet/Adc_Pins/ADC_POT0/MscrPdacSlot - VIRTUAL_WRAPPER_PDAC0 
/Port/PortConfigSet/Adc_Pins/ADC_POT0/OBEGroupSelect - NO_OBE_GROUP 
/Port/PortConfigSet/Adc_Pins/ADC_POT0/PortPinDirectionChangeable - true 
/Port/PortConfigSet/Adc_Pins/ADC_POT0/PortPinDse - false 
/Port/PortConfigSet/Adc_Pins/ADC_POT0/PortPinId - 1 
/Port/PortConfigSet/Adc_Pins/ADC_POT0/PortPinIfe - false 
/Port/PortConfigSet/Adc_Pins/ADC_POT0/PortPinInitialMode - PORT_GPIO_MODE 
/Port/PortConfigSet/Adc_Pins/ADC_POT0/PortPinInvertControl - false 
/Port/PortConfigSet/Adc_Pins/ADC_POT0/PortPinModeChangeable - true 
/Port/PortConfigSet/Adc_Pins/ADC_POT0/PortPinPcr - 11 
/Port/PortConfigSet/Adc_Pins/ADC_POT0/PortPinPke - false 
/Port/PortConfigSet/Adc_Pins/ADC_POT0/PortPinPue - false 
/Port/PortConfigSet/Adc_Pins/ADC_POT0/PortPinPus - false 
/Port/PortConfigSet/Adc_Pins/ADC_POT0/PortPinSafeMode - false 
/Port/PortConfigSet/Adc_Pins/ADC_POT0/PortPinSiul2Instance - SIUL2_0 
/Port/PortConfigSet/Adc_Pins/ADC_POT0/PortPinWithReadBack - false 
/Port/PortConfigSet/Adc_Pins/ADC_POT1/ImcrPdacSlot - VIRTUAL_WRAPPER_PDAC0 
/Port/PortConfigSet/Adc_Pins/ADC_POT1/MscrPdacSlot - VIRTUAL_WRAPPER_PDAC0 
/Port/PortConfigSet/Adc_Pins/ADC_POT1/OBEGroupSelect - NO_OBE_GROUP 
/Port/PortConfigSet/Adc_Pins/ADC_POT1/PortPinDirectionChangeable - true 
/Port/PortConfigSet/Adc_Pins/ADC_POT1/PortPinDse - false 
/Port/PortConfigSet/Adc_Pins/ADC_POT1/PortPinId - 2 
/Port/PortConfigSet/Adc_Pins/ADC_POT1/PortPinIfe - false 
/Port/PortConfigSet/Adc_Pins/ADC_POT1/PortPinInitialMode - PORT_GPIO_MODE 
/Port/PortConfigSet/Adc_Pins/ADC_POT1/PortPinInvertControl - false 
/Port/PortConfigSet/Adc_Pins/ADC_POT1/PortPinModeChangeable - true 
/Port/PortConfigSet/Adc_Pins/ADC_POT1/PortPinPcr - 17 
/Port/PortConfigSet/Adc_Pins/ADC_POT1/PortPinPke - false 
/Port/PortConfigSet/Adc_Pins/ADC_POT1/PortPinPue - false 
/Port/PortConfigSet/Adc_Pins/ADC_POT1/PortPinPus - false 
/Port/PortConfigSet/Adc_Pins/ADC_POT1/PortPinSafeMode - false 
/Port/PortConfigSet/Adc_Pins/ADC_POT1/PortPinSiul2Instance - SIUL2_0 
/Port/PortConfigSet/Adc_Pins/ADC_POT1/PortPinWithReadBack - false 
/Port/PortConfigSet/Adc_Pins/PortPin - ADC_POT0 ADC_POT1 
/Port/PortConfigSet/Can_Pins/CAN0_EN/ImcrPdacSlot - VIRTUAL_WRAPPER_PDAC0 
/Port/PortConfigSet/Can_Pins/CAN0_EN/MscrPdacSlot - VIRTUAL_WRAPPER_PDAC0 
/Port/PortConfigSet/Can_Pins/CAN0_EN/OBEGroupSelect - NO_OBE_GROUP 
/Port/PortConfigSet/Can_Pins/CAN0_EN/PortPinDirectionChangeable - true 
/Port/PortConfigSet/Can_Pins/CAN0_EN/PortPinDse - false 
/Port/PortConfigSet/Can_Pins/CAN0_EN/PortPinId - 5 
/Port/PortConfigSet/Can_Pins/CAN0_EN/PortPinIfe - false 
/Port/PortConfigSet/Can_Pins/CAN0_EN/PortPinInitialMode - PORT_GPIO_MODE 
/Port/PortConfigSet/Can_Pins/CAN0_EN/PortPinInvertControl - false 
/Port/PortConfigSet/Can_Pins/CAN0_EN/PortPinModeChangeable - true 
/Port/PortConfigSet/Can_Pins/CAN0_EN/PortPinPcr - 85 
/Port/PortConfigSet/Can_Pins/CAN0_EN/PortPinPke - false 
/Port/PortConfigSet/Can_Pins/CAN0_EN/PortPinPue - false 
/Port/PortConfigSet/Can_Pins/CAN0_EN/PortPinPus - false 
/Port/PortConfigSet/Can_Pins/CAN0_EN/PortPinSafeMode - false 
/Port/PortConfigSet/Can_Pins/CAN0_EN/PortPinSiul2Instance - SIUL2_0 
/Port/PortConfigSet/Can_Pins/CAN0_EN/PortPinWithReadBack - false 
/Port/PortConfigSet/Can_Pins/CAN0_ERRN/ImcrPdacSlot - VIRTUAL_WRAPPER_PDAC0 
/Port/PortConfigSet/Can_Pins/CAN0_ERRN/MscrPdacSlot - VIRTUAL_WRAPPER_PDAC0 
/Port/PortConfigSet/Can_Pins/CAN0_ERRN/OBEGroupSelect - NO_OBE_GROUP 
/Port/PortConfigSet/Can_Pins/CAN0_ERRN/PortPinDirectionChangeable - true 
/Port/PortConfigSet/Can_Pins/CAN0_ERRN/PortPinDse - false 
/Port/PortConfigSet/Can_Pins/CAN0_ERRN/PortPinId - 7 
/Port/PortConfigSet/Can_Pins/CAN0_ERRN/PortPinIfe - false 
/Port/PortConfigSet/Can_Pins/CAN0_ERRN/PortPinInitialMode - PORT_GPIO_MODE 
/Port/PortConfigSet/Can_Pins/CAN0_ERRN/PortPinInvertControl - false 
/Port/PortConfigSet/Can_Pins/CAN0_ERRN/PortPinModeChangeable - true 
/Port/PortConfigSet/Can_Pins/CAN0_ERRN/PortPinPcr - 87 
/Port/PortConfigSet/Can_Pins/CAN0_ERRN/PortPinPke - false 
/Port/PortConfigSet/Can_Pins/CAN0_ERRN/PortPinPue - false 
/Port/PortConfigSet/Can_Pins/CAN0_ERRN/PortPinPus - false 
/Port/PortConfigSet/Can_Pins/CAN0_ERRN/PortPinSafeMode - false 
/Port/PortConfigSet/Can_Pins/CAN0_ERRN/PortPinSiul2Instance - SIUL2_0 
/Port/PortConfigSet/Can_Pins/CAN0_ERRN/PortPinWithReadBack - false 
/Port/PortConfigSet/Can_Pins/CAN0_RX/ImcrPdacSlot - VIRTUAL_WRAPPER_PDAC0 
/Port/PortConfigSet/Can_Pins/CAN0_RX/MscrPdacSlot - VIRTUAL_WRAPPER_PDAC0 
/Port/PortConfigSet/Can_Pins/CAN0_RX/OBEGroupSelect - NO_OBE_GROUP 
/Port/PortConfigSet/Can_Pins/CAN0_RX/PortPinDirectionChangeable - true 
/Port/PortConfigSet/Can_Pins/CAN0_RX/PortPinDse - false 
/Port/PortConfigSet/Can_Pins/CAN0_RX/PortPinId - 3 
/Port/PortConfigSet/Can_Pins/CAN0_RX/PortPinIfe - false 
/Port/PortConfigSet/Can_Pins/CAN0_RX/PortPinInitialMode - PORT_GPIO_MODE 
/Port/PortConfigSet/Can_Pins/CAN0_RX/PortPinInvertControl - false 
/Port/PortConfigSet/Can_Pins/CAN0_RX/PortPinModeChangeable - true 
/Port/PortConfigSet/Can_Pins/CAN0_RX/PortPinPcr - 6 
/Port/PortConfigSet/Can_Pins/CAN0_RX/PortPinPke - false 
/Port/PortConfigSet/Can_Pins/CAN0_RX/PortPinPue - false 
/Port/PortConfigSet/Can_Pins/CAN0_RX/PortPinPus - false 
/Port/PortConfigSet/Can_Pins/CAN0_RX/PortPinSafeMode - false 
/Port/PortConfigSet/Can_Pins/CAN0_RX/PortPinSiul2Instance - SIUL2_0 
/Port/PortConfigSet/Can_Pins/CAN0_RX/PortPinWithReadBack - false 
/Port/PortConfigSet/Can_Pins/CAN0_STB/ImcrPdacSlot - VIRTUAL_WRAPPER_PDAC0 
/Port/PortConfigSet/Can_Pins/CAN0_STB/MscrPdacSlot - VIRTUAL_WRAPPER_PDAC0 
/Port/PortConfigSet/Can_Pins/CAN0_STB/OBEGroupSelect - NO_OBE_GROUP 
/Port/PortConfigSet/Can_Pins/CAN0_STB/PortPinDirectionChangeable - true 
/Port/PortConfigSet/Can_Pins/CAN0_STB/PortPinDse - false 
/Port/PortConfigSet/Can_Pins/CAN0_STB/PortPinId - 6 
/Port/PortConfigSet/Can_Pins/CAN0_STB/PortPinIfe - false 
/Port/PortConfigSet/Can_Pins/CAN0_STB/PortPinInitialMode - PORT_GPIO_MODE 
/Port/PortConfigSet/Can_Pins/CAN0_STB/PortPinInvertControl - false 
/Port/PortConfigSet/Can_Pins/CAN0_STB/PortPinModeChangeable - true 
/Port/PortConfigSet/Can_Pins/CAN0_STB/PortPinPcr - 84 
/Port/PortConfigSet/Can_Pins/CAN0_STB/PortPinPke - false 
/Port/PortConfigSet/Can_Pins/CAN0_STB/PortPinPue - false 
/Port/PortConfigSet/Can_Pins/CAN0_STB/PortPinPus - false 
/Port/PortConfigSet/Can_Pins/CAN0_STB/PortPinSafeMode - false 
/Port/PortConfigSet/Can_Pins/CAN0_STB/PortPinSiul2Instance - SIUL2_0 
/Port/PortConfigSet/Can_Pins/CAN0_STB/PortPinWithReadBack - false 
/Port/PortConfigSet/Can_Pins/CAN0_TX/ImcrPdacSlot - VIRTUAL_WRAPPER_PDAC0 
/Port/PortConfigSet/Can_Pins/CAN0_TX/MscrPdacSlot - VIRTUAL_WRAPPER_PDAC0 
/Port/PortConfigSet/Can_Pins/CAN0_TX/OBEGroupSelect - NO_OBE_GROUP 
/Port/PortConfigSet/Can_Pins/CAN0_TX/PortPinDirectionChangeable - true 
/Port/PortConfigSet/Can_Pins/CAN0_TX/PortPinDse - false 
/Port/PortConfigSet/Can_Pins/CAN0_TX/PortPinId - 4 
/Port/PortConfigSet/Can_Pins/CAN0_TX/PortPinIfe - false 
/Port/PortConfigSet/Can_Pins/CAN0_TX/PortPinInitialMode - PORT_GPIO_MODE 
/Port/PortConfigSet/Can_Pins/CAN0_TX/PortPinInvertControl - false 
/Port/PortConfigSet/Can_Pins/CAN0_TX/PortPinModeChangeable - true 
/Port/PortConfigSet/Can_Pins/CAN0_TX/PortPinPcr - 7 
/Port/PortConfigSet/Can_Pins/CAN0_TX/PortPinPke - false 
/Port/PortConfigSet/Can_Pins/CAN0_TX/PortPinPue - false 
/Port/PortConfigSet/Can_Pins/CAN0_TX/PortPinPus - false 
/Port/PortConfigSet/Can_Pins/CAN0_TX/PortPinSafeMode - false 
/Port/PortConfigSet/Can_Pins/CAN0_TX/PortPinSiul2Instance - SIUL2_0 
/Port/PortConfigSet/Can_Pins/CAN0_TX/PortPinWithReadBack - false 
/Port/PortConfigSet/Can_Pins/CAN4_EN/ImcrPdacSlot - VIRTUAL_WRAPPER_PDAC0 
/Port/PortConfigSet/Can_Pins/CAN4_EN/MscrPdacSlot - VIRTUAL_WRAPPER_PDAC0 
/Port/PortConfigSet/Can_Pins/CAN4_EN/OBEGroupSelect - NO_OBE_GROUP 
/Port/PortConfigSet/Can_Pins/CAN4_EN/PortPinDirectionChangeable - true 
/Port/PortConfigSet/Can_Pins/CAN4_EN/PortPinDse - false 
/Port/PortConfigSet/Can_Pins/CAN4_EN/PortPinId - 10 
/Port/PortConfigSet/Can_Pins/CAN4_EN/PortPinIfe - false 
/Port/PortConfigSet/Can_Pins/CAN4_EN/PortPinInitialMode - PORT_GPIO_MODE 
/Port/PortConfigSet/Can_Pins/CAN4_EN/PortPinInvertControl - false 
/Port/PortConfigSet/Can_Pins/CAN4_EN/PortPinModeChangeable - true 
/Port/PortConfigSet/Can_Pins/CAN4_EN/PortPinPcr - 111 
/Port/PortConfigSet/Can_Pins/CAN4_EN/PortPinPke - false 
/Port/PortConfigSet/Can_Pins/CAN4_EN/PortPinPue - false 
/Port/PortConfigSet/Can_Pins/CAN4_EN/PortPinPus - false 
/Port/PortConfigSet/Can_Pins/CAN4_EN/PortPinSafeMode - false 
/Port/PortConfigSet/Can_Pins/CAN4_EN/PortPinSiul2Instance - SIUL2_0 
/Port/PortConfigSet/Can_Pins/CAN4_EN/PortPinWithReadBack - false 
/Port/PortConfigSet/Can_Pins/CAN4_ERRN/ImcrPdacSlot - VIRTUAL_WRAPPER_PDAC0 
/Port/PortConfigSet/Can_Pins/CAN4_ERRN/MscrPdacSlot - VIRTUAL_WRAPPER_PDAC0 
/Port/PortConfigSet/Can_Pins/CAN4_ERRN/OBEGroupSelect - NO_OBE_GROUP 
/Port/PortConfigSet/Can_Pins/CAN4_ERRN/PortPinDirectionChangeable - true 
/Port/PortConfigSet/Can_Pins/CAN4_ERRN/PortPinDse - false 
/Port/PortConfigSet/Can_Pins/CAN4_ERRN/PortPinId - 12 
/Port/PortConfigSet/Can_Pins/CAN4_ERRN/PortPinIfe - false 
/Port/PortConfigSet/Can_Pins/CAN4_ERRN/PortPinInitialMode - PORT_GPIO_MODE 
/Port/PortConfigSet/Can_Pins/CAN4_ERRN/PortPinInvertControl - false 
/Port/PortConfigSet/Can_Pins/CAN4_ERRN/PortPinModeChangeable - true 
/Port/PortConfigSet/Can_Pins/CAN4_ERRN/PortPinPcr - 136 
/Port/PortConfigSet/Can_Pins/CAN4_ERRN/PortPinPke - false 
/Port/PortConfigSet/Can_Pins/CAN4_ERRN/PortPinPue - false 
/Port/PortConfigSet/Can_Pins/CAN4_ERRN/PortPinPus - false 
/Port/PortConfigSet/Can_Pins/CAN4_ERRN/PortPinSafeMode - false 
/Port/PortConfigSet/Can_Pins/CAN4_ERRN/PortPinSiul2Instance - SIUL2_0 
/Port/PortConfigSet/Can_Pins/CAN4_ERRN/PortPinWithReadBack - false 
/Port/PortConfigSet/Can_Pins/CAN4_RX/ImcrPdacSlot - VIRTUAL_WRAPPER_PDAC0 
/Port/PortConfigSet/Can_Pins/CAN4_RX/MscrPdacSlot - VIRTUAL_WRAPPER_PDAC0 
/Port/PortConfigSet/Can_Pins/CAN4_RX/OBEGroupSelect - NO_OBE_GROUP 
/Port/PortConfigSet/Can_Pins/CAN4_RX/PortPinDirectionChangeable - true 
/Port/PortConfigSet/Can_Pins/CAN4_RX/PortPinDse - false 
/Port/PortConfigSet/Can_Pins/CAN4_RX/PortPinId - 8 
/Port/PortConfigSet/Can_Pins/CAN4_RX/PortPinIfe - false 
/Port/PortConfigSet/Can_Pins/CAN4_RX/PortPinInitialMode - PORT_GPIO_MODE 
/Port/PortConfigSet/Can_Pins/CAN4_RX/PortPinInvertControl - false 
/Port/PortConfigSet/Can_Pins/CAN4_RX/PortPinModeChangeable - true 
/Port/PortConfigSet/Can_Pins/CAN4_RX/PortPinPcr - 142 
/Port/PortConfigSet/Can_Pins/CAN4_RX/PortPinPke - false 
/Port/PortConfigSet/Can_Pins/CAN4_RX/PortPinPue - false 
/Port/PortConfigSet/Can_Pins/CAN4_RX/PortPinPus - false 
/Port/PortConfigSet/Can_Pins/CAN4_RX/PortPinSafeMode - false 
/Port/PortConfigSet/Can_Pins/CAN4_RX/PortPinSiul2Instance - SIUL2_0 
/Port/PortConfigSet/Can_Pins/CAN4_RX/PortPinWithReadBack - false 
/Port/PortConfigSet/Can_Pins/CAN4_STB/ImcrPdacSlot - VIRTUAL_WRAPPER_PDAC0 
/Port/PortConfigSet/Can_Pins/CAN4_STB/MscrPdacSlot - VIRTUAL_WRAPPER_PDAC0 
/Port/PortConfigSet/Can_Pins/CAN4_STB/OBEGroupSelect - NO_OBE_GROUP 
/Port/PortConfigSet/Can_Pins/CAN4_STB/PortPinDirectionChangeable - true 
/Port/PortConfigSet/Can_Pins/CAN4_STB/PortPinDse - false 
/Port/PortConfigSet/Can_Pins/CAN4_STB/PortPinId - 11 
/Port/PortConfigSet/Can_Pins/CAN4_STB/PortPinIfe - false 
/Port/PortConfigSet/Can_Pins/CAN4_STB/PortPinInitialMode - PORT_GPIO_MODE 
/Port/PortConfigSet/Can_Pins/CAN4_STB/PortPinInvertControl - false 
/Port/PortConfigSet/Can_Pins/CAN4_STB/PortPinModeChangeable - true 
/Port/PortConfigSet/Can_Pins/CAN4_STB/PortPinPcr - 109 
/Port/PortConfigSet/Can_Pins/CAN4_STB/PortPinPke - false 
/Port/PortConfigSet/Can_Pins/CAN4_STB/PortPinPue - false 
/Port/PortConfigSet/Can_Pins/CAN4_STB/PortPinPus - false 
/Port/PortConfigSet/Can_Pins/CAN4_STB/PortPinSafeMode - false 
/Port/PortConfigSet/Can_Pins/CAN4_STB/PortPinSiul2Instance - SIUL2_0 
/Port/PortConfigSet/Can_Pins/CAN4_STB/PortPinWithReadBack - false 
/Port/PortConfigSet/Can_Pins/CAN4_TX/ImcrPdacSlot - VIRTUAL_WRAPPER_PDAC0 
/Port/PortConfigSet/Can_Pins/CAN4_TX/MscrPdacSlot - VIRTUAL_WRAPPER_PDAC0 
/Port/PortConfigSet/Can_Pins/CAN4_TX/OBEGroupSelect - NO_OBE_GROUP 
/Port/PortConfigSet/Can_Pins/CAN4_TX/PortPinDirectionChangeable - true 
/Port/PortConfigSet/Can_Pins/CAN4_TX/PortPinDse - false 
/Port/PortConfigSet/Can_Pins/CAN4_TX/PortPinId - 9 
/Port/PortConfigSet/Can_Pins/CAN4_TX/PortPinIfe - false 
/Port/PortConfigSet/Can_Pins/CAN4_TX/PortPinInitialMode - PORT_GPIO_MODE 
/Port/PortConfigSet/Can_Pins/CAN4_TX/PortPinInvertControl - false 
/Port/PortConfigSet/Can_Pins/CAN4_TX/PortPinModeChangeable - true 
/Port/PortConfigSet/Can_Pins/CAN4_TX/PortPinPcr - 131 
/Port/PortConfigSet/Can_Pins/CAN4_TX/PortPinPke - false 
/Port/PortConfigSet/Can_Pins/CAN4_TX/PortPinPue - false 
/Port/PortConfigSet/Can_Pins/CAN4_TX/PortPinPus - false 
/Port/PortConfigSet/Can_Pins/CAN4_TX/PortPinSafeMode - false 
/Port/PortConfigSet/Can_Pins/CAN4_TX/PortPinSiul2Instance - SIUL2_0 
/Port/PortConfigSet/Can_Pins/CAN4_TX/PortPinWithReadBack - false 
/Port/PortConfigSet/Can_Pins/PortPin - CAN0_EN CAN0_ERRN CAN0_RX CAN0_STB CAN0_TX CAN4_EN CAN4_ERRN CAN4_RX CAN4_STB CAN4_TX 
/Port/PortConfigSet/Dio_Pins/PortPin - RGBLED0_BLUE RGBLED0_GREEN RGBLED0_RED RGBLED1_BLUE RGBLED1_GREEN RGBLED1_RED USER_SW0 USER_SW1 
/Port/PortConfigSet/Dio_Pins/RGBLED0_BLUE/ImcrPdacSlot - VIRTUAL_WRAPPER_PDAC0 
/Port/PortConfigSet/Dio_Pins/RGBLED0_BLUE/MscrPdacSlot - VIRTUAL_WRAPPER_PDAC0 
/Port/PortConfigSet/Dio_Pins/RGBLED0_BLUE/OBEGroupSelect - NO_OBE_GROUP 
/Port/PortConfigSet/Dio_Pins/RGBLED0_BLUE/PortPinDirectionChangeable - true 
/Port/PortConfigSet/Dio_Pins/RGBLED0_BLUE/PortPinDse - false 
/Port/PortConfigSet/Dio_Pins/RGBLED0_BLUE/PortPinId - 15 
/Port/PortConfigSet/Dio_Pins/RGBLED0_BLUE/PortPinIfe - false 
/Port/PortConfigSet/Dio_Pins/RGBLED0_BLUE/PortPinInitialMode - PORT_GPIO_MODE 
/Port/PortConfigSet/Dio_Pins/RGBLED0_BLUE/PortPinInvertControl - false 
/Port/PortConfigSet/Dio_Pins/RGBLED0_BLUE/PortPinModeChangeable - true 
/Port/PortConfigSet/Dio_Pins/RGBLED0_BLUE/PortPinPcr - 31 
/Port/PortConfigSet/Dio_Pins/RGBLED0_BLUE/PortPinPke - false 
/Port/PortConfigSet/Dio_Pins/RGBLED0_BLUE/PortPinPue - false 
/Port/PortConfigSet/Dio_Pins/RGBLED0_BLUE/PortPinPus - false 
/Port/PortConfigSet/Dio_Pins/RGBLED0_BLUE/PortPinSafeMode - false 
/Port/PortConfigSet/Dio_Pins/RGBLED0_BLUE/PortPinSiul2Instance - SIUL2_0 
/Port/PortConfigSet/Dio_Pins/RGBLED0_BLUE/PortPinWithReadBack - false 
/Port/PortConfigSet/Dio_Pins/RGBLED0_GREEN/ImcrPdacSlot - VIRTUAL_WRAPPER_PDAC0 
/Port/PortConfigSet/Dio_Pins/RGBLED0_GREEN/MscrPdacSlot - VIRTUAL_WRAPPER_PDAC0 
/Port/PortConfigSet/Dio_Pins/RGBLED0_GREEN/OBEGroupSelect - NO_OBE_GROUP 
/Port/PortConfigSet/Dio_Pins/RGBLED0_GREEN/PortPinDirectionChangeable - true 
/Port/PortConfigSet/Dio_Pins/RGBLED0_GREEN/PortPinDse - false 
/Port/PortConfigSet/Dio_Pins/RGBLED0_GREEN/PortPinId - 14 
/Port/PortConfigSet/Dio_Pins/RGBLED0_GREEN/PortPinIfe - false 
/Port/PortConfigSet/Dio_Pins/RGBLED0_GREEN/PortPinInitialMode - PORT_GPIO_MODE 
/Port/PortConfigSet/Dio_Pins/RGBLED0_GREEN/PortPinInvertControl - false 
/Port/PortConfigSet/Dio_Pins/RGBLED0_GREEN/PortPinModeChangeable - true 
/Port/PortConfigSet/Dio_Pins/RGBLED0_GREEN/PortPinPcr - 30 
/Port/PortConfigSet/Dio_Pins/RGBLED0_GREEN/PortPinPke - false 
/Port/PortConfigSet/Dio_Pins/RGBLED0_GREEN/PortPinPue - false 
/Port/PortConfigSet/Dio_Pins/RGBLED0_GREEN/PortPinPus - false 
/Port/PortConfigSet/Dio_Pins/RGBLED0_GREEN/PortPinSafeMode - false 
/Port/PortConfigSet/Dio_Pins/RGBLED0_GREEN/PortPinSiul2Instance - SIUL2_0 
/Port/PortConfigSet/Dio_Pins/RGBLED0_GREEN/PortPinWithReadBack - false 
/Port/PortConfigSet/Dio_Pins/RGBLED0_RED/ImcrPdacSlot - VIRTUAL_WRAPPER_PDAC0 
/Port/PortConfigSet/Dio_Pins/RGBLED0_RED/MscrPdacSlot - VIRTUAL_WRAPPER_PDAC0 
/Port/PortConfigSet/Dio_Pins/RGBLED0_RED/OBEGroupSelect - NO_OBE_GROUP 
/Port/PortConfigSet/Dio_Pins/RGBLED0_RED/PortPinDirectionChangeable - true 
/Port/PortConfigSet/Dio_Pins/RGBLED0_RED/PortPinDse - false 
/Port/PortConfigSet/Dio_Pins/RGBLED0_RED/PortPinId - 13 
/Port/PortConfigSet/Dio_Pins/RGBLED0_RED/PortPinIfe - false 
/Port/PortConfigSet/Dio_Pins/RGBLED0_RED/PortPinInitialMode - PORT_GPIO_MODE 
/Port/PortConfigSet/Dio_Pins/RGBLED0_RED/PortPinInvertControl - false 
/Port/PortConfigSet/Dio_Pins/RGBLED0_RED/PortPinModeChangeable - true 
/Port/PortConfigSet/Dio_Pins/RGBLED0_RED/PortPinPcr - 29 
/Port/PortConfigSet/Dio_Pins/RGBLED0_RED/PortPinPke - false 
/Port/PortConfigSet/Dio_Pins/RGBLED0_RED/PortPinPue - false 
/Port/PortConfigSet/Dio_Pins/RGBLED0_RED/PortPinPus - false 
/Port/PortConfigSet/Dio_Pins/RGBLED0_RED/PortPinSafeMode - false 
/Port/PortConfigSet/Dio_Pins/RGBLED0_RED/PortPinSiul2Instance - SIUL2_0 
/Port/PortConfigSet/Dio_Pins/RGBLED0_RED/PortPinWithReadBack - false 
/Port/PortConfigSet/Dio_Pins/RGBLED1_BLUE/ImcrPdacSlot - VIRTUAL_WRAPPER_PDAC0 
/Port/PortConfigSet/Dio_Pins/RGBLED1_BLUE/MscrPdacSlot - VIRTUAL_WRAPPER_PDAC0 
/Port/PortConfigSet/Dio_Pins/RGBLED1_BLUE/OBEGroupSelect - NO_OBE_GROUP 
/Port/PortConfigSet/Dio_Pins/RGBLED1_BLUE/PortPinDirectionChangeable - true 
/Port/PortConfigSet/Dio_Pins/RGBLED1_BLUE/PortPinDse - false 
/Port/PortConfigSet/Dio_Pins/RGBLED1_BLUE/PortPinId - 18 
/Port/PortConfigSet/Dio_Pins/RGBLED1_BLUE/PortPinIfe - false 
/Port/PortConfigSet/Dio_Pins/RGBLED1_BLUE/PortPinInitialMode - PORT_GPIO_MODE 
/Port/PortConfigSet/Dio_Pins/RGBLED1_BLUE/PortPinInvertControl - false 
/Port/PortConfigSet/Dio_Pins/RGBLED1_BLUE/PortPinModeChangeable - true 
/Port/PortConfigSet/Dio_Pins/RGBLED1_BLUE/PortPinPcr - 140 
/Port/PortConfigSet/Dio_Pins/RGBLED1_BLUE/PortPinPke - false 
/Port/PortConfigSet/Dio_Pins/RGBLED1_BLUE/PortPinPue - false 
/Port/PortConfigSet/Dio_Pins/RGBLED1_BLUE/PortPinPus - false 
/Port/PortConfigSet/Dio_Pins/RGBLED1_BLUE/PortPinSafeMode - false 
/Port/PortConfigSet/Dio_Pins/RGBLED1_BLUE/PortPinSiul2Instance - SIUL2_0 
/Port/PortConfigSet/Dio_Pins/RGBLED1_BLUE/PortPinWithReadBack - false 
/Port/PortConfigSet/Dio_Pins/RGBLED1_GREEN/ImcrPdacSlot - VIRTUAL_WRAPPER_PDAC0 
/Port/PortConfigSet/Dio_Pins/RGBLED1_GREEN/MscrPdacSlot - VIRTUAL_WRAPPER_PDAC0 
/Port/PortConfigSet/Dio_Pins/RGBLED1_GREEN/OBEGroupSelect - NO_OBE_GROUP 
/Port/PortConfigSet/Dio_Pins/RGBLED1_GREEN/PortPinDirectionChangeable - true 
/Port/PortConfigSet/Dio_Pins/RGBLED1_GREEN/PortPinDse - false 
/Port/PortConfigSet/Dio_Pins/RGBLED1_GREEN/PortPinId - 17 
/Port/PortConfigSet/Dio_Pins/RGBLED1_GREEN/PortPinIfe - false 
/Port/PortConfigSet/Dio_Pins/RGBLED1_GREEN/PortPinInitialMode - PORT_GPIO_MODE 
/Port/PortConfigSet/Dio_Pins/RGBLED1_GREEN/PortPinInvertControl - false 
/Port/PortConfigSet/Dio_Pins/RGBLED1_GREEN/PortPinModeChangeable - true 
/Port/PortConfigSet/Dio_Pins/RGBLED1_GREEN/PortPinPcr - 57 
/Port/PortConfigSet/Dio_Pins/RGBLED1_GREEN/PortPinPke - false 
/Port/PortConfigSet/Dio_Pins/RGBLED1_GREEN/PortPinPue - false 
/Port/PortConfigSet/Dio_Pins/RGBLED1_GREEN/PortPinPus - false 
/Port/PortConfigSet/Dio_Pins/RGBLED1_GREEN/PortPinSafeMode - false 
/Port/PortConfigSet/Dio_Pins/RGBLED1_GREEN/PortPinSiul2Instance - SIUL2_0 
/Port/PortConfigSet/Dio_Pins/RGBLED1_GREEN/PortPinWithReadBack - false 
/Port/PortConfigSet/Dio_Pins/RGBLED1_RED/ImcrPdacSlot - VIRTUAL_WRAPPER_PDAC0 
/Port/PortConfigSet/Dio_Pins/RGBLED1_RED/MscrPdacSlot - VIRTUAL_WRAPPER_PDAC0 
/Port/PortConfigSet/Dio_Pins/RGBLED1_RED/OBEGroupSelect - NO_OBE_GROUP 
/Port/PortConfigSet/Dio_Pins/RGBLED1_RED/PortPinDirectionChangeable - true 
/Port/PortConfigSet/Dio_Pins/RGBLED1_RED/PortPinDse - false 
/Port/PortConfigSet/Dio_Pins/RGBLED1_RED/PortPinId - 16 
/Port/PortConfigSet/Dio_Pins/RGBLED1_RED/PortPinIfe - false 
/Port/PortConfigSet/Dio_Pins/RGBLED1_RED/PortPinInitialMode - PORT_GPIO_MODE 
/Port/PortConfigSet/Dio_Pins/RGBLED1_RED/PortPinInvertControl - false 
/Port/PortConfigSet/Dio_Pins/RGBLED1_RED/PortPinModeChangeable - true 
/Port/PortConfigSet/Dio_Pins/RGBLED1_RED/PortPinPcr - 50 
/Port/PortConfigSet/Dio_Pins/RGBLED1_RED/PortPinPke - false 
/Port/PortConfigSet/Dio_Pins/RGBLED1_RED/PortPinPue - false 
/Port/PortConfigSet/Dio_Pins/RGBLED1_RED/PortPinPus - false 
/Port/PortConfigSet/Dio_Pins/RGBLED1_RED/PortPinSafeMode - false 
/Port/PortConfigSet/Dio_Pins/RGBLED1_RED/PortPinSiul2Instance - SIUL2_0 
/Port/PortConfigSet/Dio_Pins/RGBLED1_RED/PortPinWithReadBack - false 
/Port/PortConfigSet/Dio_Pins/USER_SW0/ImcrPdacSlot - VIRTUAL_WRAPPER_PDAC0 
/Port/PortConfigSet/Dio_Pins/USER_SW0/MscrPdacSlot - VIRTUAL_WRAPPER_PDAC0 
/Port/PortConfigSet/Dio_Pins/USER_SW0/OBEGroupSelect - NO_OBE_GROUP 
/Port/PortConfigSet/Dio_Pins/USER_SW0/PortPinDirectionChangeable - true 
/Port/PortConfigSet/Dio_Pins/USER_SW0/PortPinDse - false 
/Port/PortConfigSet/Dio_Pins/USER_SW0/PortPinId - 19 
/Port/PortConfigSet/Dio_Pins/USER_SW0/PortPinIfe - false 
/Port/PortConfigSet/Dio_Pins/USER_SW0/PortPinInitialMode - PORT_GPIO_MODE 
/Port/PortConfigSet/Dio_Pins/USER_SW0/PortPinInvertControl - false 
/Port/PortConfigSet/Dio_Pins/USER_SW0/PortPinModeChangeable - true 
/Port/PortConfigSet/Dio_Pins/USER_SW0/PortPinPcr - 58 
/Port/PortConfigSet/Dio_Pins/USER_SW0/PortPinPke - false 
/Port/PortConfigSet/Dio_Pins/USER_SW0/PortPinPue - false 
/Port/PortConfigSet/Dio_Pins/USER_SW0/PortPinPus - false 
/Port/PortConfigSet/Dio_Pins/USER_SW0/PortPinSafeMode - false 
/Port/PortConfigSet/Dio_Pins/USER_SW0/PortPinSiul2Instance - SIUL2_0 
/Port/PortConfigSet/Dio_Pins/USER_SW0/PortPinWithReadBack - false 
/Port/PortConfigSet/Dio_Pins/USER_SW1/ImcrPdacSlot - VIRTUAL_WRAPPER_PDAC0 
/Port/PortConfigSet/Dio_Pins/USER_SW1/MscrPdacSlot - VIRTUAL_WRAPPER_PDAC0 
/Port/PortConfigSet/Dio_Pins/USER_SW1/OBEGroupSelect - NO_OBE_GROUP 
/Port/PortConfigSet/Dio_Pins/USER_SW1/PortPinDirectionChangeable - true 
/Port/PortConfigSet/Dio_Pins/USER_SW1/PortPinDse - false 
/Port/PortConfigSet/Dio_Pins/USER_SW1/PortPinId - 20 
/Port/PortConfigSet/Dio_Pins/USER_SW1/PortPinIfe - false 
/Port/PortConfigSet/Dio_Pins/USER_SW1/PortPinInitialMode - PORT_GPIO_MODE 
/Port/PortConfigSet/Dio_Pins/USER_SW1/PortPinInvertControl - false 
/Port/PortConfigSet/Dio_Pins/USER_SW1/PortPinModeChangeable - true 
/Port/PortConfigSet/Dio_Pins/USER_SW1/PortPinPcr - 51 
/Port/PortConfigSet/Dio_Pins/USER_SW1/PortPinPke - false 
/Port/PortConfigSet/Dio_Pins/USER_SW1/PortPinPue - false 
/Port/PortConfigSet/Dio_Pins/USER_SW1/PortPinPus - false 
/Port/PortConfigSet/Dio_Pins/USER_SW1/PortPinSafeMode - false 
/Port/PortConfigSet/Dio_Pins/USER_SW1/PortPinSiul2Instance - SIUL2_0 
/Port/PortConfigSet/Dio_Pins/USER_SW1/PortPinWithReadBack - false 
/Port/PortConfigSet/Flexio_Pins/FLEXIO_RX/ImcrPdacSlot - VIRTUAL_WRAPPER_PDAC0 
/Port/PortConfigSet/Flexio_Pins/FLEXIO_RX/MscrPdacSlot - VIRTUAL_WRAPPER_PDAC0 
