Caler10/RBCM_S32K344_AUTOSAR_MBD/Firmware/S32K344_DAPlink/S32K344_LED/S32K344_LED_ert_rtw/MW_target_hardware_resources.h
/Port/PortConfigSet/Flexio_Pins/FLEXIO_RX/OBEGroupSelect - NO_OBE_GROUP 
/Port/PortConfigSet/Flexio_Pins/FLEXIO_RX/PortPinDirectionChangeable - true 
/Port/PortConfigSet/Flexio_Pins/FLEXIO_RX/PortPinDse - false 
/Port/PortConfigSet/Flexio_Pins/FLEXIO_RX/PortPinId - 44 
/Port/PortConfigSet/Flexio_Pins/FLEXIO_RX/PortPinIfe - false 
/Port/PortConfigSet/Flexio_Pins/FLEXIO_RX/PortPinInitialMode - PORT_GPIO_MODE 
/Port/PortConfigSet/Flexio_Pins/FLEXIO_RX/PortPinInvertControl - false 
/Port/PortConfigSet/Flexio_Pins/FLEXIO_RX/PortPinModeChangeable - true 
/Port/PortConfigSet/Flexio_Pins/FLEXIO_RX/PortPinPcr - 41 
/Port/PortConfigSet/Flexio_Pins/FLEXIO_RX/PortPinPke - false 
/Port/PortConfigSet/Flexio_Pins/FLEXIO_RX/PortPinPue - false 
/Port/PortConfigSet/Flexio_Pins/FLEXIO_RX/PortPinPus - false 
/Port/PortConfigSet/Flexio_Pins/FLEXIO_RX/PortPinSafeMode - false 
/Port/PortConfigSet/Flexio_Pins/FLEXIO_RX/PortPinSiul2Instance - SIUL2_0 
/Port/PortConfigSet/Flexio_Pins/FLEXIO_RX/PortPinWithReadBack - false 
/Port/PortConfigSet/Flexio_Pins/FLEXIO_SCL/ImcrPdacSlot - VIRTUAL_WRAPPER_PDAC0 
/Port/PortConfigSet/Flexio_Pins/FLEXIO_SCL/MscrPdacSlot - VIRTUAL_WRAPPER_PDAC0 
/Port/PortConfigSet/Flexio_Pins/FLEXIO_SCL/OBEGroupSelect - NO_OBE_GROUP 
/Port/PortConfigSet/Flexio_Pins/FLEXIO_SCL/PortPinDirectionChangeable - true 
/Port/PortConfigSet/Flexio_Pins/FLEXIO_SCL/PortPinDse - false 
/Port/PortConfigSet/Flexio_Pins/FLEXIO_SCL/PortPinId - 46 
/Port/PortConfigSet/Flexio_Pins/FLEXIO_SCL/PortPinIfe - false 
/Port/PortConfigSet/Flexio_Pins/FLEXIO_SCL/PortPinInitialMode - PORT_GPIO_MODE 
/Port/PortConfigSet/Flexio_Pins/FLEXIO_SCL/PortPinInvertControl - false 
/Port/PortConfigSet/Flexio_Pins/FLEXIO_SCL/PortPinModeChangeable - true 
/Port/PortConfigSet/Flexio_Pins/FLEXIO_SCL/PortPinPcr - 180 
/Port/PortConfigSet/Flexio_Pins/FLEXIO_SCL/PortPinPke - false 
/Port/PortConfigSet/Flexio_Pins/FLEXIO_SCL/PortPinPue - false 
/Port/PortConfigSet/Flexio_Pins/FLEXIO_SCL/PortPinPus - false 
/Port/PortConfigSet/Flexio_Pins/FLEXIO_SCL/PortPinSafeMode - false 
/Port/PortConfigSet/Flexio_Pins/FLEXIO_SCL/PortPinSiul2Instance - SIUL2_0 
/Port/PortConfigSet/Flexio_Pins/FLEXIO_SCL/PortPinWithReadBack - false 
/Port/PortConfigSet/Flexio_Pins/FLEXIO_SDA/ImcrPdacSlot - VIRTUAL_WRAPPER_PDAC0 
/Port/PortConfigSet/Flexio_Pins/FLEXIO_SDA/MscrPdacSlot - VIRTUAL_WRAPPER_PDAC0 
/Port/PortConfigSet/Flexio_Pins/FLEXIO_SDA/OBEGroupSelect - NO_OBE_GROUP 
/Port/PortConfigSet/Flexio_Pins/FLEXIO_SDA/PortPinDirectionChangeable - true 
/Port/PortConfigSet/Flexio_Pins/FLEXIO_SDA/PortPinDse - false 
/Port/PortConfigSet/Flexio_Pins/FLEXIO_SDA/PortPinId - 47 
/Port/PortConfigSet/Flexio_Pins/FLEXIO_SDA/PortPinIfe - false 
/Port/PortConfigSet/Flexio_Pins/FLEXIO_SDA/PortPinInitialMode - PORT_GPIO_MODE 
/Port/PortConfigSet/Flexio_Pins/FLEXIO_SDA/PortPinInvertControl - false 
/Port/PortConfigSet/Flexio_Pins/FLEXIO_SDA/PortPinModeChangeable - true 
/Port/PortConfigSet/Flexio_Pins/FLEXIO_SDA/PortPinPcr - 181 
/Port/PortConfigSet/Flexio_Pins/FLEXIO_SDA/PortPinPke - false 
/Port/PortConfigSet/Flexio_Pins/FLEXIO_SDA/PortPinPue - false 
/Port/PortConfigSet/Flexio_Pins/FLEXIO_SDA/PortPinPus - false 
/Port/PortConfigSet/Flexio_Pins/FLEXIO_SDA/PortPinSafeMode - false 
/Port/PortConfigSet/Flexio_Pins/FLEXIO_SDA/PortPinSiul2Instance - SIUL2_0 
/Port/PortConfigSet/Flexio_Pins/FLEXIO_SDA/PortPinWithReadBack - false 
/Port/PortConfigSet/Flexio_Pins/FLEXIO_TX/ImcrPdacSlot - VIRTUAL_WRAPPER_PDAC0 
/Port/PortConfigSet/Flexio_Pins/FLEXIO_TX/MscrPdacSlot - VIRTUAL_WRAPPER_PDAC0 
/Port/PortConfigSet/Flexio_Pins/FLEXIO_TX/OBEGroupSelect - NO_OBE_GROUP 
/Port/PortConfigSet/Flexio_Pins/FLEXIO_TX/PortPinDirectionChangeable - true 
/Port/PortConfigSet/Flexio_Pins/FLEXIO_TX/PortPinDse - false 
/Port/PortConfigSet/Flexio_Pins/FLEXIO_TX/PortPinId - 45 
/Port/PortConfigSet/Flexio_Pins/FLEXIO_TX/PortPinIfe - false 
/Port/PortConfigSet/Flexio_Pins/FLEXIO_TX/PortPinInitialMode - PORT_GPIO_MODE 
/Port/PortConfigSet/Flexio_Pins/FLEXIO_TX/PortPinInvertControl - false 
/Port/PortConfigSet/Flexio_Pins/FLEXIO_TX/PortPinModeChangeable - true 
/Port/PortConfigSet/Flexio_Pins/FLEXIO_TX/PortPinPcr - 42 
/Port/PortConfigSet/Flexio_Pins/FLEXIO_TX/PortPinPke - false 
/Port/PortConfigSet/Flexio_Pins/FLEXIO_TX/PortPinPue - false 
/Port/PortConfigSet/Flexio_Pins/FLEXIO_TX/PortPinPus - false 
/Port/PortConfigSet/Flexio_Pins/FLEXIO_TX/PortPinSafeMode - false 
/Port/PortConfigSet/Flexio_Pins/FLEXIO_TX/PortPinSiul2Instance - SIUL2_0 
/Port/PortConfigSet/Flexio_Pins/FLEXIO_TX/PortPinWithReadBack - false 
/Port/PortConfigSet/Flexio_Pins/PortPin - FLEXIO_RX FLEXIO_SCL FLEXIO_SDA FLEXIO_TX 
/Port/PortConfigSet/I2c_Pins/LPI2C1_SCL/ImcrPdacSlot - VIRTUAL_WRAPPER_PDAC0 
/Port/PortConfigSet/I2c_Pins/LPI2C1_SCL/MscrPdacSlot - VIRTUAL_WRAPPER_PDAC0 
/Port/PortConfigSet/I2c_Pins/LPI2C1_SCL/OBEGroupSelect - NO_OBE_GROUP 
/Port/PortConfigSet/I2c_Pins/LPI2C1_SCL/PortPinDirectionChangeable - true 
/Port/PortConfigSet/I2c_Pins/LPI2C1_SCL/PortPinDse - false 
/Port/PortConfigSet/I2c_Pins/LPI2C1_SCL/PortPinId - 49 
/Port/PortConfigSet/I2c_Pins/LPI2C1_SCL/PortPinIfe - false 
/Port/PortConfigSet/I2c_Pins/LPI2C1_SCL/PortPinInitialMode - PORT_GPIO_MODE 
/Port/PortConfigSet/I2c_Pins/LPI2C1_SCL/PortPinInvertControl - false 
/Port/PortConfigSet/I2c_Pins/LPI2C1_SCL/PortPinModeChangeable - true 
/Port/PortConfigSet/I2c_Pins/LPI2C1_SCL/PortPinPcr - 71 
/Port/PortConfigSet/I2c_Pins/LPI2C1_SCL/PortPinPke - false 
/Port/PortConfigSet/I2c_Pins/LPI2C1_SCL/PortPinPue - false 
/Port/PortConfigSet/I2c_Pins/LPI2C1_SCL/PortPinPus - false 
/Port/PortConfigSet/I2c_Pins/LPI2C1_SCL/PortPinSafeMode - false 
/Port/PortConfigSet/I2c_Pins/LPI2C1_SCL/PortPinSiul2Instance - SIUL2_0 
/Port/PortConfigSet/I2c_Pins/LPI2C1_SCL/PortPinWithReadBack - false 
/Port/PortConfigSet/I2c_Pins/LPI2C1_SDA/ImcrPdacSlot - VIRTUAL_WRAPPER_PDAC0 
/Port/PortConfigSet/I2c_Pins/LPI2C1_SDA/MscrPdacSlot - VIRTUAL_WRAPPER_PDAC0 
/Port/PortConfigSet/I2c_Pins/LPI2C1_SDA/OBEGroupSelect - NO_OBE_GROUP 
/Port/PortConfigSet/I2c_Pins/LPI2C1_SDA/PortPinDirectionChangeable - true 
/Port/PortConfigSet/I2c_Pins/LPI2C1_SDA/PortPinDse - false 
/Port/PortConfigSet/I2c_Pins/LPI2C1_SDA/PortPinId - 48 
/Port/PortConfigSet/I2c_Pins/LPI2C1_SDA/PortPinIfe - false 
/Port/PortConfigSet/I2c_Pins/LPI2C1_SDA/PortPinInitialMode - PORT_GPIO_MODE 
/Port/PortConfigSet/I2c_Pins/LPI2C1_SDA/PortPinInvertControl - false 
/Port/PortConfigSet/I2c_Pins/LPI2C1_SDA/PortPinModeChangeable - true 
/Port/PortConfigSet/I2c_Pins/LPI2C1_SDA/PortPinPcr - 70 
/Port/PortConfigSet/I2c_Pins/LPI2C1_SDA/PortPinPke - false 
/Port/PortConfigSet/I2c_Pins/LPI2C1_SDA/PortPinPue - false 
/Port/PortConfigSet/I2c_Pins/LPI2C1_SDA/PortPinPus - false 
/Port/PortConfigSet/I2c_Pins/LPI2C1_SDA/PortPinSafeMode - false 
/Port/PortConfigSet/I2c_Pins/LPI2C1_SDA/PortPinSiul2Instance - SIUL2_0 
/Port/PortConfigSet/I2c_Pins/LPI2C1_SDA/PortPinWithReadBack - false 
/Port/PortConfigSet/I2c_Pins/PortPin - LPI2C1_SCL LPI2C1_SDA 
/Port/PortConfigSet/Icu_Pins/PTA19/ImcrPdacSlot - VIRTUAL_WRAPPER_PDAC0 
/Port/PortConfigSet/Icu_Pins/PTA19/MscrPdacSlot - VIRTUAL_WRAPPER_PDAC0 
/Port/PortConfigSet/Icu_Pins/PTA19/OBEGroupSelect - NO_OBE_GROUP 
/Port/PortConfigSet/Icu_Pins/PTA19/PortPinDirectionChangeable - true 
/Port/PortConfigSet/Icu_Pins/PTA19/PortPinDse - false 
/Port/PortConfigSet/Icu_Pins/PTA19/PortPinId - 50 
/Port/PortConfigSet/Icu_Pins/PTA19/PortPinIfe - false 
/Port/PortConfigSet/Icu_Pins/PTA19/PortPinInitialMode - PORT_GPIO_MODE 
/Port/PortConfigSet/Icu_Pins/PTA19/PortPinInvertControl - false 
/Port/PortConfigSet/Icu_Pins/PTA19/PortPinModeChangeable - true 
/Port/PortConfigSet/Icu_Pins/PTA19/PortPinPcr - 19 
/Port/PortConfigSet/Icu_Pins/PTA19/PortPinPke - false 
/Port/PortConfigSet/Icu_Pins/PTA19/PortPinPue - false 
/Port/PortConfigSet/Icu_Pins/PTA19/PortPinPus - false 
/Port/PortConfigSet/Icu_Pins/PTA19/PortPinSafeMode - false 
/Port/PortConfigSet/Icu_Pins/PTA19/PortPinSiul2Instance - SIUL2_0 
/Port/PortConfigSet/Icu_Pins/PTA19/PortPinWithReadBack - false 
/Port/PortConfigSet/Icu_Pins/PTA20/ImcrPdacSlot - VIRTUAL_WRAPPER_PDAC0 
/Port/PortConfigSet/Icu_Pins/PTA20/MscrPdacSlot - VIRTUAL_WRAPPER_PDAC0 
/Port/PortConfigSet/Icu_Pins/PTA20/OBEGroupSelect - NO_OBE_GROUP 
/Port/PortConfigSet/Icu_Pins/PTA20/PortPinDirectionChangeable - true 
/Port/PortConfigSet/Icu_Pins/PTA20/PortPinDse - false 
/Port/PortConfigSet/Icu_Pins/PTA20/PortPinId - 51 
/Port/PortConfigSet/Icu_Pins/PTA20/PortPinIfe - false 
/Port/PortConfigSet/Icu_Pins/PTA20/PortPinInitialMode - PORT_GPIO_MODE 
/Port/PortConfigSet/Icu_Pins/PTA20/PortPinInvertControl - false 
/Port/PortConfigSet/Icu_Pins/PTA20/PortPinModeChangeable - true 
/Port/PortConfigSet/Icu_Pins/PTA20/PortPinPcr - 20 
/Port/PortConfigSet/Icu_Pins/PTA20/PortPinPke - false 
/Port/PortConfigSet/Icu_Pins/PTA20/PortPinPue - false 
/Port/PortConfigSet/Icu_Pins/PTA20/PortPinPus - false 
/Port/PortConfigSet/Icu_Pins/PTA20/PortPinSafeMode - false 
/Port/PortConfigSet/Icu_Pins/PTA20/PortPinSiul2Instance - SIUL2_0 
/Port/PortConfigSet/Icu_Pins/PTA20/PortPinWithReadBack - false 
/Port/PortConfigSet/Icu_Pins/PTD1/ImcrPdacSlot - VIRTUAL_WRAPPER_PDAC0 
/Port/PortConfigSet/Icu_Pins/PTD1/MscrPdacSlot - VIRTUAL_WRAPPER_PDAC0 
/Port/PortConfigSet/Icu_Pins/PTD1/OBEGroupSelect - NO_OBE_GROUP 
/Port/PortConfigSet/Icu_Pins/PTD1/PortPinDirectionChangeable - true 
/Port/PortConfigSet/Icu_Pins/PTD1/PortPinDse - false 
/Port/PortConfigSet/Icu_Pins/PTD1/PortPinId - 52 
/Port/PortConfigSet/Icu_Pins/PTD1/PortPinIfe - false 
/Port/PortConfigSet/Icu_Pins/PTD1/PortPinInitialMode - PORT_GPIO_MODE 
/Port/PortConfigSet/Icu_Pins/PTD1/PortPinInvertControl - false 
/Port/PortConfigSet/Icu_Pins/PTD1/PortPinModeChangeable - true 
/Port/PortConfigSet/Icu_Pins/PTD1/PortPinPcr - 97 
/Port/PortConfigSet/Icu_Pins/PTD1/PortPinPke - false 
/Port/PortConfigSet/Icu_Pins/PTD1/PortPinPue - false 
/Port/PortConfigSet/Icu_Pins/PTD1/PortPinPus - false 
/Port/PortConfigSet/Icu_Pins/PTD1/PortPinSafeMode - false 
/Port/PortConfigSet/Icu_Pins/PTD1/PortPinSiul2Instance - SIUL2_0 
/Port/PortConfigSet/Icu_Pins/PTD1/PortPinWithReadBack - false 
/Port/PortConfigSet/Icu_Pins/PortPin - PTA19 PTA20 PTD1 
/Port/PortConfigSet/NotUsedPortPin - NotUsedPortPin 
/Port/PortConfigSet/NotUsedPortPin/PortPinDirection - PORT_PIN_IN 
/Port/PortConfigSet/NotUsedPortPin/PortPinLevelValue - PORT_PIN_LEVEL_LOW 
/Port/PortConfigSet/NotUsedPortPin/PortPinPue - false 
/Port/PortConfigSet/NotUsedPortPin/PortPinPus - false 
/Port/PortConfigSet/PortContainer - Adc_Pins Can_Pins Dio_Pins Flexio_Pins I2c_Pins Icu_Pins Pwm_Pins Spi_Pins Uart_Pins 
/Port/PortConfigSet/Pwm_Pins/PTA0/ImcrPdacSlot - VIRTUAL_WRAPPER_PDAC0 
/Port/PortConfigSet/Pwm_Pins/PTA0/MscrPdacSlot - VIRTUAL_WRAPPER_PDAC0 
/Port/PortConfigSet/Pwm_Pins/PTA0/OBEGroupSelect - NO_OBE_GROUP 
/Port/PortConfigSet/Pwm_Pins/PTA0/PortPinDirectionChangeable - true 
/Port/PortConfigSet/Pwm_Pins/PTA0/PortPinDse - false 
/Port/PortConfigSet/Pwm_Pins/PTA0/PortPinId - 29 
/Port/PortConfigSet/Pwm_Pins/PTA0/PortPinIfe - false 
/Port/PortConfigSet/Pwm_Pins/PTA0/PortPinInitialMode - PORT_GPIO_MODE 
/Port/PortConfigSet/Pwm_Pins/PTA0/PortPinInvertControl - false 
/Port/PortConfigSet/Pwm_Pins/PTA0/PortPinModeChangeable - true 
/Port/PortConfigSet/Pwm_Pins/PTA0/PortPinPcr - 0 
/Port/PortConfigSet/Pwm_Pins/PTA0/PortPinPke - false 
/Port/PortConfigSet/Pwm_Pins/PTA0/PortPinPue - false 
/Port/PortConfigSet/Pwm_Pins/PTA0/PortPinPus - false 
/Port/PortConfigSet/Pwm_Pins/PTA0/PortPinSafeMode - false 
/Port/PortConfigSet/Pwm_Pins/PTA0/PortPinSiul2Instance - SIUL2_0 
/Port/PortConfigSet/Pwm_Pins/PTA0/PortPinWithReadBack - false 
/Port/PortConfigSet/Pwm_Pins/PTA1/ImcrPdacSlot - VIRTUAL_WRAPPER_PDAC0 
/Port/PortConfigSet/Pwm_Pins/PTA1/MscrPdacSlot - VIRTUAL_WRAPPER_PDAC0 
/Port/PortConfigSet/Pwm_Pins/PTA1/OBEGroupSelect - NO_OBE_GROUP 
/Port/PortConfigSet/Pwm_Pins/PTA1/PortPinDirectionChangeable - true 
/Port/PortConfigSet/Pwm_Pins/PTA1/PortPinDse - false 
/Port/PortConfigSet/Pwm_Pins/PTA1/PortPinId - 30 
/Port/PortConfigSet/Pwm_Pins/PTA1/PortPinIfe - false 
/Port/PortConfigSet/Pwm_Pins/PTA1/PortPinInitialMode - PORT_GPIO_MODE 
/Port/PortConfigSet/Pwm_Pins/PTA1/PortPinInvertControl - false 
/Port/PortConfigSet/Pwm_Pins/PTA1/PortPinModeChangeable - true 
/Port/PortConfigSet/Pwm_Pins/PTA1/PortPinPcr - 1 
/Port/PortConfigSet/Pwm_Pins/PTA1/PortPinPke - false 
/Port/PortConfigSet/Pwm_Pins/PTA1/PortPinPue - false 
/Port/PortConfigSet/Pwm_Pins/PTA1/PortPinPus - false 
/Port/PortConfigSet/Pwm_Pins/PTA1/PortPinSafeMode - false 
/Port/PortConfigSet/Pwm_Pins/PTA1/PortPinSiul2Instance - SIUL2_0 
/Port/PortConfigSet/Pwm_Pins/PTA1/PortPinWithReadBack - false 
/Port/PortConfigSet/Pwm_Pins/PTA2/ImcrPdacSlot - VIRTUAL_WRAPPER_PDAC0 
/Port/PortConfigSet/Pwm_Pins/PTA2/MscrPdacSlot - VIRTUAL_WRAPPER_PDAC0 
/Port/PortConfigSet/Pwm_Pins/PTA2/OBEGroupSelect - NO_OBE_GROUP 
/Port/PortConfigSet/Pwm_Pins/PTA2/PortPinDirectionChangeable - true 
/Port/PortConfigSet/Pwm_Pins/PTA2/PortPinDse - false 
/Port/PortConfigSet/Pwm_Pins/PTA2/PortPinId - 31 
/Port/PortConfigSet/Pwm_Pins/PTA2/PortPinIfe - false 
/Port/PortConfigSet/Pwm_Pins/PTA2/PortPinInitialMode - PORT_GPIO_MODE 
/Port/PortConfigSet/Pwm_Pins/PTA2/PortPinInvertControl - false 
/Port/PortConfigSet/Pwm_Pins/PTA2/PortPinModeChangeable - true 
/Port/PortConfigSet/Pwm_Pins/PTA2/PortPinPcr - 2 
/Port/PortConfigSet/Pwm_Pins/PTA2/PortPinPke - false 
/Port/PortConfigSet/Pwm_Pins/PTA2/PortPinPue - false 
/Port/PortConfigSet/Pwm_Pins/PTA2/PortPinPus - false 
/Port/PortConfigSet/Pwm_Pins/PTA2/PortPinSafeMode - false 
/Port/PortConfigSet/Pwm_Pins/PTA2/PortPinSiul2Instance - SIUL2_0 
/Port/PortConfigSet/Pwm_Pins/PTA2/PortPinWithReadBack - false 
/Port/PortConfigSet/Pwm_Pins/PTA3/ImcrPdacSlot - VIRTUAL_WRAPPER_PDAC0 
/Port/PortConfigSet/Pwm_Pins/PTA3/MscrPdacSlot - VIRTUAL_WRAPPER_PDAC0 
/Port/PortConfigSet/Pwm_Pins/PTA3/OBEGroupSelect - NO_OBE_GROUP 
/Port/PortConfigSet/Pwm_Pins/PTA3/PortPinDirectionChangeable - true 
/Port/PortConfigSet/Pwm_Pins/PTA3/PortPinDse - false 
/Port/PortConfigSet/Pwm_Pins/PTA3/PortPinId - 32 
/Port/PortConfigSet/Pwm_Pins/PTA3/PortPinIfe - false 
/Port/PortConfigSet/Pwm_Pins/PTA3/PortPinInitialMode - PORT_GPIO_MODE 
/Port/PortConfigSet/Pwm_Pins/PTA3/PortPinInvertControl - false 
/Port/PortConfigSet/Pwm_Pins/PTA3/PortPinModeChangeable - true 
/Port/PortConfigSet/Pwm_Pins/PTA3/PortPinPcr - 3 
/Port/PortConfigSet/Pwm_Pins/PTA3/PortPinPke - false 
/Port/PortConfigSet/Pwm_Pins/PTA3/PortPinPue - false 
/Port/PortConfigSet/Pwm_Pins/PTA3/PortPinPus - false 
/Port/PortConfigSet/Pwm_Pins/PTA3/PortPinSafeMode - false 
/Port/PortConfigSet/Pwm_Pins/PTA3/PortPinSiul2Instance - SIUL2_0 
/Port/PortConfigSet/Pwm_Pins/PTA3/PortPinWithReadBack - false 
/Port/PortConfigSet/Pwm_Pins/PTC10/ImcrPdacSlot - VIRTUAL_WRAPPER_PDAC0 
/Port/PortConfigSet/Pwm_Pins/PTC10/MscrPdacSlot - VIRTUAL_WRAPPER_PDAC0 
/Port/PortConfigSet/Pwm_Pins/PTC10/OBEGroupSelect - NO_OBE_GROUP 
/Port/PortConfigSet/Pwm_Pins/PTC10/PortPinDirectionChangeable - true 
/Port/PortConfigSet/Pwm_Pins/PTC10/PortPinDse - false 
/Port/PortConfigSet/Pwm_Pins/PTC10/PortPinId - 33 
/Port/PortConfigSet/Pwm_Pins/PTC10/PortPinIfe - false 
/Port/PortConfigSet/Pwm_Pins/PTC10/PortPinInitialMode - PORT_GPIO_MODE 
/Port/PortConfigSet/Pwm_Pins/PTC10/PortPinInvertControl - false 
/Port/PortConfigSet/Pwm_Pins/PTC10/PortPinModeChangeable - true 
/Port/PortConfigSet/Pwm_Pins/PTC10/PortPinPcr - 74 
/Port/PortConfigSet/Pwm_Pins/PTC10/PortPinPke - false 
/Port/PortConfigSet/Pwm_Pins/PTC10/PortPinPue - false 
/Port/PortConfigSet/Pwm_Pins/PTC10/PortPinPus - false 
/Port/PortConfigSet/Pwm_Pins/PTC10/PortPinSafeMode - false 
/Port/PortConfigSet/Pwm_Pins/PTC10/PortPinSiul2Instance - SIUL2_0 
/Port/PortConfigSet/Pwm_Pins/PTC10/PortPinWithReadBack - false 
/Port/PortConfigSet/Pwm_Pins/PTC11/ImcrPdacSlot - VIRTUAL_WRAPPER_PDAC0 
/Port/PortConfigSet/Pwm_Pins/PTC11/MscrPdacSlot - VIRTUAL_WRAPPER_PDAC0 
/Port/PortConfigSet/Pwm_Pins/PTC11/OBEGroupSelect - NO_OBE_GROUP 
/Port/PortConfigSet/Pwm_Pins/PTC11/PortPinDirectionChangeable - true 
/Port/PortConfigSet/Pwm_Pins/PTC11/PortPinDse - false 
/Port/PortConfigSet/Pwm_Pins/PTC11/PortPinId - 34 
/Port/PortConfigSet/Pwm_Pins/PTC11/PortPinIfe - false 
/Port/PortConfigSet/Pwm_Pins/PTC11/PortPinInitialMode - PORT_GPIO_MODE 
/Port/PortConfigSet/Pwm_Pins/PTC11/PortPinInvertControl - false 
/Port/PortConfigSet/Pwm_Pins/PTC11/PortPinModeChangeable - true 
/Port/PortConfigSet/Pwm_Pins/PTC11/PortPinPcr - 75 
/Port/PortConfigSet/Pwm_Pins/PTC11/PortPinPke - false 
/Port/PortConfigSet/Pwm_Pins/PTC11/PortPinPue - false 
/Port/PortConfigSet/Pwm_Pins/PTC11/PortPinPus - false 
/Port/PortConfigSet/Pwm_Pins/PTC11/PortPinSafeMode - false 
/Port/PortConfigSet/Pwm_Pins/PTC11/PortPinSiul2Instance - SIUL2_0 
/Port/PortConfigSet/Pwm_Pins/PTC11/PortPinWithReadBack - false 
/Port/PortConfigSet/Pwm_Pins/PTD2/ImcrPdacSlot - VIRTUAL_WRAPPER_PDAC0 
/Port/PortConfigSet/Pwm_Pins/PTD2/MscrPdacSlot - VIRTUAL_WRAPPER_PDAC0 
/Port/PortConfigSet/Pwm_Pins/PTD2/OBEGroupSelect - NO_OBE_GROUP 
/Port/PortConfigSet/Pwm_Pins/PTD2/PortPinDirectionChangeable - true 
/Port/PortConfigSet/Pwm_Pins/PTD2/PortPinDse - false 
/Port/PortConfigSet/Pwm_Pins/PTD2/PortPinId - 36 
/Port/PortConfigSet/Pwm_Pins/PTD2/PortPinIfe - false 
/Port/PortConfigSet/Pwm_Pins/PTD2/PortPinInitialMode - PORT_GPIO_MODE 
/Port/PortConfigSet/Pwm_Pins/PTD2/PortPinInvertControl - false 
/Port/PortConfigSet/Pwm_Pins/PTD2/PortPinModeChangeable - true 
/Port/PortConfigSet/Pwm_Pins/PTD2/PortPinPcr - 98 
/Port/PortConfigSet/Pwm_Pins/PTD2/PortPinPke - false 
/Port/PortConfigSet/Pwm_Pins/PTD2/PortPinPue - false 
/Port/PortConfigSet/Pwm_Pins/PTD2/PortPinPus - false 
/Port/PortConfigSet/Pwm_Pins/PTD2/PortPinSafeMode - false 
/Port/PortConfigSet/Pwm_Pins/PTD2/PortPinSiul2Instance - SIUL2_0 
/Port/PortConfigSet/Pwm_Pins/PTD2/PortPinWithReadBack - false 
/Port/PortConfigSet/Pwm_Pins/PTD26/ImcrPdacSlot - VIRTUAL_WRAPPER_PDAC0 
/Port/PortConfigSet/Pwm_Pins/PTD26/MscrPdacSlot - VIRTUAL_WRAPPER_PDAC0 
/Port/PortConfigSet/Pwm_Pins/PTD26/OBEGroupSelect - NO_OBE_GROUP 
/Port/PortConfigSet/Pwm_Pins/PTD26/PortPinDirectionChangeable - true 
/Port/PortConfigSet/Pwm_Pins/PTD26/PortPinDse - false 
/Port/PortConfigSet/Pwm_Pins/PTD26/PortPinId - 37 
/Port/PortConfigSet/Pwm_Pins/PTD26/PortPinIfe - false 
/Port/PortConfigSet/Pwm_Pins/PTD26/PortPinInitialMode - PORT_GPIO_MODE 
/Port/PortConfigSet/Pwm_Pins/PTD26/PortPinInvertControl - false 
/Port/PortConfigSet/Pwm_Pins/PTD26/PortPinModeChangeable - true 
/Port/PortConfigSet/Pwm_Pins/PTD26/PortPinPcr - 122 
/Port/PortConfigSet/Pwm_Pins/PTD26/PortPinPke - false 
/Port/PortConfigSet/Pwm_Pins/PTD26/PortPinPue - false 
/Port/PortConfigSet/Pwm_Pins/PTD26/PortPinPus - false 
/Port/PortConfigSet/Pwm_Pins/PTD26/PortPinSafeMode - false 
/Port/PortConfigSet/Pwm_Pins/PTD26/PortPinSiul2Instance - SIUL2_0 
/Port/PortConfigSet/Pwm_Pins/PTD26/PortPinWithReadBack - false 
/Port/PortConfigSet/Pwm_Pins/PTD3/ImcrPdacSlot - VIRTUAL_WRAPPER_PDAC0 
/Port/PortConfigSet/Pwm_Pins/PTD3/MscrPdacSlot - VIRTUAL_WRAPPER_PDAC0 
/Port/PortConfigSet/Pwm_Pins/PTD3/OBEGroupSelect - NO_OBE_GROUP 
/Port/PortConfigSet/Pwm_Pins/PTD3/PortPinDirectionChangeable - true 
/Port/PortConfigSet/Pwm_Pins/PTD3/PortPinDse - false 
/Port/PortConfigSet/Pwm_Pins/PTD3/PortPinId - 35 
/Port/PortConfigSet/Pwm_Pins/PTD3/PortPinIfe - false 
/Port/PortConfigSet/Pwm_Pins/PTD3/PortPinInitialMode - PORT_GPIO_MODE 
/Port/PortConfigSet/Pwm_Pins/PTD3/PortPinInvertControl - false 
/Port/PortConfigSet/Pwm_Pins/PTD3/PortPinModeChangeable - true 
/Port/PortConfigSet/Pwm_Pins/PTD3/PortPinPcr - 99 
/Port/PortConfigSet/Pwm_Pins/PTD3/PortPinPke - false 
/Port/PortConfigSet/Pwm_Pins/PTD3/PortPinPue - false 
/Port/PortConfigSet/Pwm_Pins/PTD3/PortPinPus - false 
/Port/PortConfigSet/Pwm_Pins/PTD3/PortPinSafeMode - false 
/Port/PortConfigSet/Pwm_Pins/PTD3/PortPinSiul2Instance - SIUL2_0 
/Port/PortConfigSet/Pwm_Pins/PTD3/PortPinWithReadBack - false 
/Port/PortConfigSet/Pwm_Pins/PortPin - PTA0 PTA1 PTA2 PTA3 PTC10 PTC11 PTD2 PTD26 PTD3 
/Port/PortConfigSet/Spi_Pins/LPSPI1PCS3/ImcrPdacSlot - VIRTUAL_WRAPPER_PDAC0 
/Port/PortConfigSet/Spi_Pins/LPSPI1PCS3/MscrPdacSlot - VIRTUAL_WRAPPER_PDAC0 
/Port/PortConfigSet/Spi_Pins/LPSPI1PCS3/OBEGroupSelect - NO_OBE_GROUP 
/Port/PortConfigSet/Spi_Pins/LPSPI1PCS3/PortPinDirectionChangeable - true 
/Port/PortConfigSet/Spi_Pins/LPSPI1PCS3/PortPinDse - false 
/Port/PortConfigSet/Spi_Pins/LPSPI1PCS3/PortPinId - 28 
/Port/PortConfigSet/Spi_Pins/LPSPI1PCS3/PortPinIfe - false 
/Port/PortConfigSet/Spi_Pins/LPSPI1PCS3/PortPinInitialMode - PORT_GPIO_MODE 
/Port/PortConfigSet/Spi_Pins/LPSPI1PCS3/PortPinInvertControl - false 
/Port/PortConfigSet/Spi_Pins/LPSPI1PCS3/PortPinModeChangeable - true 
/Port/PortConfigSet/Spi_Pins/LPSPI1PCS3/PortPinPcr - 49 
/Port/PortConfigSet/Spi_Pins/LPSPI1PCS3/PortPinPke - false 
/Port/PortConfigSet/Spi_Pins/LPSPI1PCS3/PortPinPue - false 
/Port/PortConfigSet/Spi_Pins/LPSPI1PCS3/PortPinPus - false 
/Port/PortConfigSet/Spi_Pins/LPSPI1PCS3/PortPinSafeMode - false 
/Port/PortConfigSet/Spi_Pins/LPSPI1PCS3/PortPinSiul2Instance - SIUL2_0 
/Port/PortConfigSet/Spi_Pins/LPSPI1PCS3/PortPinWithReadBack - false 
/Port/PortConfigSet/Spi_Pins/LPSPI1SCK/ImcrPdacSlot - VIRTUAL_WRAPPER_PDAC0 
/Port/PortConfigSet/Spi_Pins/LPSPI1SCK/MscrPdacSlot - VIRTUAL_WRAPPER_PDAC0 
/Port/PortConfigSet/Spi_Pins/LPSPI1SCK/OBEGroupSelect - NO_OBE_GROUP 
/Port/PortConfigSet/Spi_Pins/LPSPI1SCK/PortPinDirectionChangeable - true 
/Port/PortConfigSet/Spi_Pins/LPSPI1SCK/PortPinDse - false 
/Port/PortConfigSet/Spi_Pins/LPSPI1SCK/PortPinId - 25 
/Port/PortConfigSet/Spi_Pins/LPSPI1SCK/PortPinIfe - false 
/Port/PortConfigSet/Spi_Pins/LPSPI1SCK/PortPinInitialMode - PORT_GPIO_MODE 
/Port/PortConfigSet/Spi_Pins/LPSPI1SCK/PortPinInvertControl - false 
/Port/PortConfigSet/Spi_Pins/LPSPI1SCK/PortPinModeChangeable - true 
/Port/PortConfigSet/Spi_Pins/LPSPI1SCK/PortPinPcr - 46 
/Port/PortConfigSet/Spi_Pins/LPSPI1SCK/PortPinPke - false 
/Port/PortConfigSet/Spi_Pins/LPSPI1SCK/PortPinPue - false 
/Port/PortConfigSet/Spi_Pins/LPSPI1SCK/PortPinPus - false 
/Port/PortConfigSet/Spi_Pins/LPSPI1SCK/PortPinSafeMode - false 
/Port/PortConfigSet/Spi_Pins/LPSPI1SCK/PortPinSiul2Instance - SIUL2_0 
/Port/PortConfigSet/Spi_Pins/LPSPI1SCK/PortPinWithReadBack - false 
/Port/PortConfigSet/Spi_Pins/LPSPI1SIN/ImcrPdacSlot - VIRTUAL_WRAPPER_PDAC0 
/Port/PortConfigSet/Spi_Pins/LPSPI1SIN/MscrPdacSlot - VIRTUAL_WRAPPER_PDAC0 
/Port/PortConfigSet/Spi_Pins/LPSPI1SIN/OBEGroupSelect - NO_OBE_GROUP 
/Port/PortConfigSet/Spi_Pins/LPSPI1SIN/PortPinDirectionChangeable - true 
/Port/PortConfigSet/Spi_Pins/LPSPI1SIN/PortPinDse - false 
/Port/PortConfigSet/Spi_Pins/LPSPI1SIN/PortPinId - 26 
/Port/PortConfigSet/Spi_Pins/LPSPI1SIN/PortPinIfe - false 
/Port/PortConfigSet/Spi_Pins/LPSPI1SIN/PortPinInitialMode - PORT_GPIO_MODE 
/Port/PortConfigSet/Spi_Pins/LPSPI1SIN/PortPinInvertControl - false 
/Port/PortConfigSet/Spi_Pins/LPSPI1SIN/PortPinModeChangeable - true 
/Port/PortConfigSet/Spi_Pins/LPSPI1SIN/PortPinPcr - 47 
/Port/PortConfigSet/Spi_Pins/LPSPI1SIN/PortPinPke - false 
/Port/PortConfigSet/Spi_Pins/LPSPI1SIN/PortPinPue - false 
/Port/PortConfigSet/Spi_Pins/LPSPI1SIN/PortPinPus - false 
/Port/PortConfigSet/Spi_Pins/LPSPI1SIN/PortPinSafeMode - false 
/Port/PortConfigSet/Spi_Pins/LPSPI1SIN/PortPinSiul2Instance - SIUL2_0 
/Port/PortConfigSet/Spi_Pins/LPSPI1SIN/PortPinWithReadBack - false 
/Port/PortConfigSet/Spi_Pins/LPSPI1SOUT/ImcrPdacSlot - VIRTUAL_WRAPPER_PDAC0 
/Port/PortConfigSet/Spi_Pins/LPSPI1SOUT/MscrPdacSlot - VIRTUAL_WRAPPER_PDAC0 
/Port/PortConfigSet/Spi_Pins/LPSPI1SOUT/OBEGroupSelect - NO_OBE_GROUP 
/Port/PortConfigSet/Spi_Pins/LPSPI1SOUT/PortPinDirectionChangeable - true 
/Port/PortConfigSet/Spi_Pins/LPSPI1SOUT/PortPinDse - false 
/Port/PortConfigSet/Spi_Pins/LPSPI1SOUT/PortPinId - 27 
/Port/PortConfigSet/Spi_Pins/LPSPI1SOUT/PortPinIfe - false 
