Caler10/RBCM_S32K344_AUTOSAR_MBD/Firmware/S32K344_DAPlink/S32K344_LED/S32K344_LED_ert_rtw/MW_target_hardware_resources.h
/Port/PortConfigSet/Spi_Pins/LPSPI1SOUT/PortPinInitialMode - PORT_GPIO_MODE 
/Port/PortConfigSet/Spi_Pins/LPSPI1SOUT/PortPinInvertControl - false 
/Port/PortConfigSet/Spi_Pins/LPSPI1SOUT/PortPinModeChangeable - true 
/Port/PortConfigSet/Spi_Pins/LPSPI1SOUT/PortPinPcr - 48 
/Port/PortConfigSet/Spi_Pins/LPSPI1SOUT/PortPinPke - false 
/Port/PortConfigSet/Spi_Pins/LPSPI1SOUT/PortPinPue - false 
/Port/PortConfigSet/Spi_Pins/LPSPI1SOUT/PortPinPus - false 
/Port/PortConfigSet/Spi_Pins/LPSPI1SOUT/PortPinSafeMode - false 
/Port/PortConfigSet/Spi_Pins/LPSPI1SOUT/PortPinSiul2Instance - SIUL2_0 
/Port/PortConfigSet/Spi_Pins/LPSPI1SOUT/PortPinWithReadBack - false 
/Port/PortConfigSet/Spi_Pins/LPSPI2PCS0/ImcrPdacSlot - VIRTUAL_WRAPPER_PDAC0 
/Port/PortConfigSet/Spi_Pins/LPSPI2PCS0/MscrPdacSlot - VIRTUAL_WRAPPER_PDAC0 
/Port/PortConfigSet/Spi_Pins/LPSPI2PCS0/OBEGroupSelect - NO_OBE_GROUP 
/Port/PortConfigSet/Spi_Pins/LPSPI2PCS0/PortPinDirectionChangeable - true 
/Port/PortConfigSet/Spi_Pins/LPSPI2PCS0/PortPinDse - false 
/Port/PortConfigSet/Spi_Pins/LPSPI2PCS0/PortPinId - 24 
/Port/PortConfigSet/Spi_Pins/LPSPI2PCS0/PortPinIfe - false 
/Port/PortConfigSet/Spi_Pins/LPSPI2PCS0/PortPinInitialMode - PORT_GPIO_MODE 
/Port/PortConfigSet/Spi_Pins/LPSPI2PCS0/PortPinInvertControl - false 
/Port/PortConfigSet/Spi_Pins/LPSPI2PCS0/PortPinModeChangeable - true 
/Port/PortConfigSet/Spi_Pins/LPSPI2PCS0/PortPinPcr - 163 
/Port/PortConfigSet/Spi_Pins/LPSPI2PCS0/PortPinPke - false 
/Port/PortConfigSet/Spi_Pins/LPSPI2PCS0/PortPinPue - false 
/Port/PortConfigSet/Spi_Pins/LPSPI2PCS0/PortPinPus - false 
/Port/PortConfigSet/Spi_Pins/LPSPI2PCS0/PortPinSafeMode - false 
/Port/PortConfigSet/Spi_Pins/LPSPI2PCS0/PortPinSiul2Instance - SIUL2_0 
/Port/PortConfigSet/Spi_Pins/LPSPI2PCS0/PortPinWithReadBack - false 
/Port/PortConfigSet/Spi_Pins/LPSPI2SCK/ImcrPdacSlot - VIRTUAL_WRAPPER_PDAC0 
/Port/PortConfigSet/Spi_Pins/LPSPI2SCK/MscrPdacSlot - VIRTUAL_WRAPPER_PDAC0 
/Port/PortConfigSet/Spi_Pins/LPSPI2SCK/OBEGroupSelect - NO_OBE_GROUP 
/Port/PortConfigSet/Spi_Pins/LPSPI2SCK/PortPinDirectionChangeable - true 
/Port/PortConfigSet/Spi_Pins/LPSPI2SCK/PortPinDse - false 
/Port/PortConfigSet/Spi_Pins/LPSPI2SCK/PortPinId - 21 
/Port/PortConfigSet/Spi_Pins/LPSPI2SCK/PortPinIfe - false 
/Port/PortConfigSet/Spi_Pins/LPSPI2SCK/PortPinInitialMode - PORT_GPIO_MODE 
/Port/PortConfigSet/Spi_Pins/LPSPI2SCK/PortPinInvertControl - false 
/Port/PortConfigSet/Spi_Pins/LPSPI2SCK/PortPinModeChangeable - true 
/Port/PortConfigSet/Spi_Pins/LPSPI2SCK/PortPinPcr - 160 
/Port/PortConfigSet/Spi_Pins/LPSPI2SCK/PortPinPke - false 
/Port/PortConfigSet/Spi_Pins/LPSPI2SCK/PortPinPue - false 
/Port/PortConfigSet/Spi_Pins/LPSPI2SCK/PortPinPus - false 
/Port/PortConfigSet/Spi_Pins/LPSPI2SCK/PortPinSafeMode - false 
/Port/PortConfigSet/Spi_Pins/LPSPI2SCK/PortPinSiul2Instance - SIUL2_0 
/Port/PortConfigSet/Spi_Pins/LPSPI2SCK/PortPinWithReadBack - false 
/Port/PortConfigSet/Spi_Pins/LPSPI2SIN/ImcrPdacSlot - VIRTUAL_WRAPPER_PDAC0 
/Port/PortConfigSet/Spi_Pins/LPSPI2SIN/MscrPdacSlot - VIRTUAL_WRAPPER_PDAC0 
/Port/PortConfigSet/Spi_Pins/LPSPI2SIN/OBEGroupSelect - NO_OBE_GROUP 
/Port/PortConfigSet/Spi_Pins/LPSPI2SIN/PortPinDirectionChangeable - true 
/Port/PortConfigSet/Spi_Pins/LPSPI2SIN/PortPinDse - false 
/Port/PortConfigSet/Spi_Pins/LPSPI2SIN/PortPinId - 22 
/Port/PortConfigSet/Spi_Pins/LPSPI2SIN/PortPinIfe - false 
/Port/PortConfigSet/Spi_Pins/LPSPI2SIN/PortPinInitialMode - PORT_GPIO_MODE 
/Port/PortConfigSet/Spi_Pins/LPSPI2SIN/PortPinInvertControl - false 
/Port/PortConfigSet/Spi_Pins/LPSPI2SIN/PortPinModeChangeable - true 
/Port/PortConfigSet/Spi_Pins/LPSPI2SIN/PortPinPcr - 161 
/Port/PortConfigSet/Spi_Pins/LPSPI2SIN/PortPinPke - false 
/Port/PortConfigSet/Spi_Pins/LPSPI2SIN/PortPinPue - false 
/Port/PortConfigSet/Spi_Pins/LPSPI2SIN/PortPinPus - false 
/Port/PortConfigSet/Spi_Pins/LPSPI2SIN/PortPinSafeMode - false 
/Port/PortConfigSet/Spi_Pins/LPSPI2SIN/PortPinSiul2Instance - SIUL2_0 
/Port/PortConfigSet/Spi_Pins/LPSPI2SIN/PortPinWithReadBack - false 
/Port/PortConfigSet/Spi_Pins/LPSPI2SOUT/ImcrPdacSlot - VIRTUAL_WRAPPER_PDAC0 
/Port/PortConfigSet/Spi_Pins/LPSPI2SOUT/MscrPdacSlot - VIRTUAL_WRAPPER_PDAC0 
/Port/PortConfigSet/Spi_Pins/LPSPI2SOUT/OBEGroupSelect - NO_OBE_GROUP 
/Port/PortConfigSet/Spi_Pins/LPSPI2SOUT/PortPinDirectionChangeable - true 
/Port/PortConfigSet/Spi_Pins/LPSPI2SOUT/PortPinDse - false 
/Port/PortConfigSet/Spi_Pins/LPSPI2SOUT/PortPinId - 23 
/Port/PortConfigSet/Spi_Pins/LPSPI2SOUT/PortPinIfe - false 
/Port/PortConfigSet/Spi_Pins/LPSPI2SOUT/PortPinInitialMode - PORT_GPIO_MODE 
/Port/PortConfigSet/Spi_Pins/LPSPI2SOUT/PortPinInvertControl - false 
/Port/PortConfigSet/Spi_Pins/LPSPI2SOUT/PortPinModeChangeable - true 
/Port/PortConfigSet/Spi_Pins/LPSPI2SOUT/PortPinPcr - 162 
/Port/PortConfigSet/Spi_Pins/LPSPI2SOUT/PortPinPke - false 
/Port/PortConfigSet/Spi_Pins/LPSPI2SOUT/PortPinPue - false 
/Port/PortConfigSet/Spi_Pins/LPSPI2SOUT/PortPinPus - false 
/Port/PortConfigSet/Spi_Pins/LPSPI2SOUT/PortPinSafeMode - false 
/Port/PortConfigSet/Spi_Pins/LPSPI2SOUT/PortPinSiul2Instance - SIUL2_0 
/Port/PortConfigSet/Spi_Pins/LPSPI2SOUT/PortPinWithReadBack - false 
/Port/PortConfigSet/Spi_Pins/PortPin - LPSPI1PCS3 LPSPI1SCK LPSPI1SIN LPSPI1SOUT LPSPI2PCS0 LPSPI2SCK LPSPI2SIN LPSPI2SOUT 
/Port/PortConfigSet/Uart_Pins/PortPin - UART13_RX UART13_TX UART5_RX UART5_TX UART6_RX UART6_TX 
/Port/PortConfigSet/Uart_Pins/UART13_RX/ImcrPdacSlot - VIRTUAL_WRAPPER_PDAC0 
/Port/PortConfigSet/Uart_Pins/UART13_RX/MscrPdacSlot - VIRTUAL_WRAPPER_PDAC0 
/Port/PortConfigSet/Uart_Pins/UART13_RX/OBEGroupSelect - NO_OBE_GROUP 
/Port/PortConfigSet/Uart_Pins/UART13_RX/PortPinDirectionChangeable - true 
/Port/PortConfigSet/Uart_Pins/UART13_RX/PortPinDse - false 
/Port/PortConfigSet/Uart_Pins/UART13_RX/PortPinId - 40 
/Port/PortConfigSet/Uart_Pins/UART13_RX/PortPinIfe - false 
/Port/PortConfigSet/Uart_Pins/UART13_RX/PortPinInitialMode - PORT_GPIO_MODE 
/Port/PortConfigSet/Uart_Pins/UART13_RX/PortPinInvertControl - false 
/Port/PortConfigSet/Uart_Pins/UART13_RX/PortPinModeChangeable - true 
/Port/PortConfigSet/Uart_Pins/UART13_RX/PortPinPcr - 91 
/Port/PortConfigSet/Uart_Pins/UART13_RX/PortPinPke - false 
/Port/PortConfigSet/Uart_Pins/UART13_RX/PortPinPue - false 
/Port/PortConfigSet/Uart_Pins/UART13_RX/PortPinPus - false 
/Port/PortConfigSet/Uart_Pins/UART13_RX/PortPinSafeMode - false 
/Port/PortConfigSet/Uart_Pins/UART13_RX/PortPinSiul2Instance - SIUL2_0 
/Port/PortConfigSet/Uart_Pins/UART13_RX/PortPinWithReadBack - false 
/Port/PortConfigSet/Uart_Pins/UART13_TX/ImcrPdacSlot - VIRTUAL_WRAPPER_PDAC0 
/Port/PortConfigSet/Uart_Pins/UART13_TX/MscrPdacSlot - VIRTUAL_WRAPPER_PDAC0 
/Port/PortConfigSet/Uart_Pins/UART13_TX/OBEGroupSelect - NO_OBE_GROUP 
/Port/PortConfigSet/Uart_Pins/UART13_TX/PortPinDirectionChangeable - true 
/Port/PortConfigSet/Uart_Pins/UART13_TX/PortPinDse - false 
/Port/PortConfigSet/Uart_Pins/UART13_TX/PortPinId - 41 
/Port/PortConfigSet/Uart_Pins/UART13_TX/PortPinIfe - false 
/Port/PortConfigSet/Uart_Pins/UART13_TX/PortPinInitialMode - PORT_GPIO_MODE 
/Port/PortConfigSet/Uart_Pins/UART13_TX/PortPinInvertControl - false 
/Port/PortConfigSet/Uart_Pins/UART13_TX/PortPinModeChangeable - true 
/Port/PortConfigSet/Uart_Pins/UART13_TX/PortPinPcr - 90 
/Port/PortConfigSet/Uart_Pins/UART13_TX/PortPinPke - false 
/Port/PortConfigSet/Uart_Pins/UART13_TX/PortPinPue - false 
/Port/PortConfigSet/Uart_Pins/UART13_TX/PortPinPus - false 
/Port/PortConfigSet/Uart_Pins/UART13_TX/PortPinSafeMode - false 
/Port/PortConfigSet/Uart_Pins/UART13_TX/PortPinSiul2Instance - SIUL2_0 
/Port/PortConfigSet/Uart_Pins/UART13_TX/PortPinWithReadBack - false 
/Port/PortConfigSet/Uart_Pins/UART5_RX/ImcrPdacSlot - VIRTUAL_WRAPPER_PDAC0 
/Port/PortConfigSet/Uart_Pins/UART5_RX/MscrPdacSlot - VIRTUAL_WRAPPER_PDAC0 
/Port/PortConfigSet/Uart_Pins/UART5_RX/OBEGroupSelect - NO_OBE_GROUP 
/Port/PortConfigSet/Uart_Pins/UART5_RX/PortPinDirectionChangeable - true 
/Port/PortConfigSet/Uart_Pins/UART5_RX/PortPinDse - false 
/Port/PortConfigSet/Uart_Pins/UART5_RX/PortPinId - 42 
/Port/PortConfigSet/Uart_Pins/UART5_RX/PortPinIfe - false 
/Port/PortConfigSet/Uart_Pins/UART5_RX/PortPinInitialMode - PORT_GPIO_MODE 
/Port/PortConfigSet/Uart_Pins/UART5_RX/PortPinInvertControl - false 
/Port/PortConfigSet/Uart_Pins/UART5_RX/PortPinModeChangeable - true 
/Port/PortConfigSet/Uart_Pins/UART5_RX/PortPinPcr - 60 
/Port/PortConfigSet/Uart_Pins/UART5_RX/PortPinPke - false 
/Port/PortConfigSet/Uart_Pins/UART5_RX/PortPinPue - false 
/Port/PortConfigSet/Uart_Pins/UART5_RX/PortPinPus - false 
/Port/PortConfigSet/Uart_Pins/UART5_RX/PortPinSafeMode - false 
/Port/PortConfigSet/Uart_Pins/UART5_RX/PortPinSiul2Instance - SIUL2_0 
/Port/PortConfigSet/Uart_Pins/UART5_RX/PortPinWithReadBack - false 
/Port/PortConfigSet/Uart_Pins/UART5_TX/ImcrPdacSlot - VIRTUAL_WRAPPER_PDAC0 
/Port/PortConfigSet/Uart_Pins/UART5_TX/MscrPdacSlot - VIRTUAL_WRAPPER_PDAC0 
/Port/PortConfigSet/Uart_Pins/UART5_TX/OBEGroupSelect - NO_OBE_GROUP 
/Port/PortConfigSet/Uart_Pins/UART5_TX/PortPinDirectionChangeable - true 
/Port/PortConfigSet/Uart_Pins/UART5_TX/PortPinDse - false 
/Port/PortConfigSet/Uart_Pins/UART5_TX/PortPinId - 43 
/Port/PortConfigSet/Uart_Pins/UART5_TX/PortPinIfe - false 
/Port/PortConfigSet/Uart_Pins/UART5_TX/PortPinInitialMode - PORT_GPIO_MODE 
/Port/PortConfigSet/Uart_Pins/UART5_TX/PortPinInvertControl - false 
/Port/PortConfigSet/Uart_Pins/UART5_TX/PortPinModeChangeable - true 
/Port/PortConfigSet/Uart_Pins/UART5_TX/PortPinPcr - 59 
/Port/PortConfigSet/Uart_Pins/UART5_TX/PortPinPke - false 
/Port/PortConfigSet/Uart_Pins/UART5_TX/PortPinPue - false 
/Port/PortConfigSet/Uart_Pins/UART5_TX/PortPinPus - false 
/Port/PortConfigSet/Uart_Pins/UART5_TX/PortPinSafeMode - false 
/Port/PortConfigSet/Uart_Pins/UART5_TX/PortPinSiul2Instance - SIUL2_0 
/Port/PortConfigSet/Uart_Pins/UART5_TX/PortPinWithReadBack - false 
/Port/PortConfigSet/Uart_Pins/UART6_RX/ImcrPdacSlot - VIRTUAL_WRAPPER_PDAC0 
/Port/PortConfigSet/Uart_Pins/UART6_RX/MscrPdacSlot - VIRTUAL_WRAPPER_PDAC0 
/Port/PortConfigSet/Uart_Pins/UART6_RX/OBEGroupSelect - NO_OBE_GROUP 
/Port/PortConfigSet/Uart_Pins/UART6_RX/PortPinDirectionChangeable - true 
/Port/PortConfigSet/Uart_Pins/UART6_RX/PortPinDse - false 
/Port/PortConfigSet/Uart_Pins/UART6_RX/PortPinId - 38 
/Port/PortConfigSet/Uart_Pins/UART6_RX/PortPinIfe - false 
/Port/PortConfigSet/Uart_Pins/UART6_RX/PortPinInitialMode - PORT_GPIO_MODE 
/Port/PortConfigSet/Uart_Pins/UART6_RX/PortPinInvertControl - false 
/Port/PortConfigSet/Uart_Pins/UART6_RX/PortPinModeChangeable - true 
/Port/PortConfigSet/Uart_Pins/UART6_RX/PortPinPcr - 15 
/Port/PortConfigSet/Uart_Pins/UART6_RX/PortPinPke - false 
/Port/PortConfigSet/Uart_Pins/UART6_RX/PortPinPue - false 
/Port/PortConfigSet/Uart_Pins/UART6_RX/PortPinPus - false 
/Port/PortConfigSet/Uart_Pins/UART6_RX/PortPinSafeMode - false 
/Port/PortConfigSet/Uart_Pins/UART6_RX/PortPinSiul2Instance - SIUL2_0 
/Port/PortConfigSet/Uart_Pins/UART6_RX/PortPinWithReadBack - false 
/Port/PortConfigSet/Uart_Pins/UART6_TX/ImcrPdacSlot - VIRTUAL_WRAPPER_PDAC0 
/Port/PortConfigSet/Uart_Pins/UART6_TX/MscrPdacSlot - VIRTUAL_WRAPPER_PDAC0 
/Port/PortConfigSet/Uart_Pins/UART6_TX/OBEGroupSelect - NO_OBE_GROUP 
/Port/PortConfigSet/Uart_Pins/UART6_TX/PortPinDirectionChangeable - true 
/Port/PortConfigSet/Uart_Pins/UART6_TX/PortPinDse - false 
/Port/PortConfigSet/Uart_Pins/UART6_TX/PortPinId - 39 
/Port/PortConfigSet/Uart_Pins/UART6_TX/PortPinIfe - false 
/Port/PortConfigSet/Uart_Pins/UART6_TX/PortPinInitialMode - PORT_GPIO_MODE 
/Port/PortConfigSet/Uart_Pins/UART6_TX/PortPinInvertControl - false 
/Port/PortConfigSet/Uart_Pins/UART6_TX/PortPinModeChangeable - true 
/Port/PortConfigSet/Uart_Pins/UART6_TX/PortPinPcr - 16 
/Port/PortConfigSet/Uart_Pins/UART6_TX/PortPinPke - false 
/Port/PortConfigSet/Uart_Pins/UART6_TX/PortPinPue - false 
/Port/PortConfigSet/Uart_Pins/UART6_TX/PortPinPus - false 
/Port/PortConfigSet/Uart_Pins/UART6_TX/PortPinSafeMode - false 
/Port/PortConfigSet/Uart_Pins/UART6_TX/PortPinSiul2Instance - SIUL2_0 
/Port/PortConfigSet/Uart_Pins/UART6_TX/PortPinWithReadBack - false 
/Port/PortConfigSet/UnTouchedPortPin - UnTouchedPortPin_0 UnTouchedPortPin_1 UnTouchedPortPin_2 UnTouchedPortPin_3 
/Port/PortConfigSet/UnTouchedPortPin_0/PortPinPcr - 4 
/Port/PortConfigSet/UnTouchedPortPin_0/PortPinSiul2Instance - SIUL2_0 
/Port/PortConfigSet/UnTouchedPortPin_1/PortPinPcr - 10 
/Port/PortConfigSet/UnTouchedPortPin_1/PortPinSiul2Instance - SIUL2_0 
/Port/PortConfigSet/UnTouchedPortPin_2/PortPinPcr - 68 
/Port/PortConfigSet/UnTouchedPortPin_2/PortPinSiul2Instance - SIUL2_0 
/Port/PortConfigSet/UnTouchedPortPin_3/PortPinPcr - 69 
/Port/PortConfigSet/UnTouchedPortPin_3/PortPinSiul2Instance - SIUL2_0 
/Port/PortGeneral - PortGeneral 
/Port/PortGeneral/PortCodeSizeOptimization - false 
/Port/PortGeneral/PortDevErrorDetect - false 
/Port/PortGeneral/PortEnableUserModeSupport - false 
/Port/PortGeneral/PortMulticoreSupport - false 
/Port/PortGeneral/PortResetPinModeApi - false 
/Port/PortGeneral/PortSetAsUnusedPinApi - false 
/Port/PortGeneral/PortSetPinDirectionApi - true 
/Port/PortGeneral/PortSetPinModeApi - true 
/Port/PortGeneral/PortSetPinModeDoesNotTouchGpioLevel - false 
/Port/PortGeneral/PortTspcSupport - false 
/Port/PortGeneral/PortVersionInfoApi - true 
/Port/PortGeneral/SIUL2PortIPDevErrorDetect - false 
/Port/PortGeneral/SignalInversionConfigEnable - false 
/Port/PortGeneral/VirtWrapperSupport - false 

