Caler10/RBCM_S32K344_AUTOSAR_MBD/Firmware/S32K344_DAPlink/S32K344_LED/S32K344_LED_ert_rtw/MW_target_hardware_resources.h
*/
#define MW_DETAILS_PORT 
#define MW_OPEN_PORT 
#define MW_UPDATE_PORT 
#define MW_RESTORE_PORT 
#define MW_PWM_INFO /*
/Pwm/CommonPublishedInformation - CommonPublishedInformation Pwm 
/Pwm/CommonPublishedInformation/ArReleaseMajorVersion - 4 
/Pwm/CommonPublishedInformation/ArReleaseMinorVersion - 4 
/Pwm/CommonPublishedInformation/ArReleaseRevisionVersion - 0 
/Pwm/CommonPublishedInformation/ModuleId - 121 
/Pwm/CommonPublishedInformation/SwMajorVersion - 2 
/Pwm/CommonPublishedInformation/SwMinorVersion - 0 
/Pwm/CommonPublishedInformation/SwPatchVersion - 0 
/Pwm/CommonPublishedInformation/VendorId - 43 
/Pwm/FlexPwm - PwmChannelConfigSet 
/Pwm/IMPLEMENTATION-CONFIG-VARIANT - VARIANT-POST-BUILD 
/Pwm/POST_BUILD_VARIANT_USED - true 
/Pwm/PwmChannel - PwmChannel_0 PwmChannel_1 PwmChannel_2 PwmChannel_3 PwmChannel_4 PwmChannel_5 PwmChannel_6 PwmChannel_7 PwmChannel_8 
/Pwm/PwmChannel_0/PwmChannelId - 0 
/Pwm/PwmChannel_0/PwmDutycycleDefault - 2048 
/Pwm/PwmChannel_0/PwmHwChannel - /Pwm/Pwm/PwmChannelConfigSet/PwmEmios_0/PwmEmiosChannels_9 
/Pwm/PwmChannel_0/PwmIdleState - PWM_LOW 
/Pwm/PwmChannel_0/PwmMcuClockReferencePoint - /Mcu/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/CORE_CLK 
/Pwm/PwmChannel_0/PwmNotification - PwmChannel_0_Callback 
/Pwm/PwmChannel_0/PwmPeriodDefault - 16000.0 
/Pwm/PwmChannel_0/PwmPeriodInTicks - true 
/Pwm/PwmChannel_0/PwmPolarity - PWM_HIGH 
/Pwm/PwmChannel_1/PwmChannelId - 1 
/Pwm/PwmChannel_1/PwmDutycycleDefault - 2048 
/Pwm/PwmChannel_1/PwmHwChannel - /Pwm/Pwm/PwmChannelConfigSet/PwmEmios_0/PwmEmiosChannels_17 
/Pwm/PwmChannel_1/PwmIdleState - PWM_LOW 
/Pwm/PwmChannel_1/PwmMcuClockReferencePoint - /Mcu/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/CORE_CLK 
/Pwm/PwmChannel_1/PwmNotification - PwmChannel_1_Callback 
/Pwm/PwmChannel_1/PwmPeriodDefault - 16000.0 
/Pwm/PwmChannel_1/PwmPeriodInTicks - true 
/Pwm/PwmChannel_1/PwmPolarity - PWM_HIGH 
/Pwm/PwmChannel_2/PwmChannelId - 2 
/Pwm/PwmChannel_2/PwmDutycycleDefault - 0 
/Pwm/PwmChannel_2/PwmHwChannel - /Pwm/Pwm/PwmChannelConfigSet/PwmEmios_1/PwmEmiosChannels_19 
/Pwm/PwmChannel_2/PwmIdleState - PWM_LOW 
/Pwm/PwmChannel_2/PwmMcuClockReferencePoint - /Mcu/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/CORE_CLK 
/Pwm/PwmChannel_2/PwmNotification - PwmChannel_2_Callback 
/Pwm/PwmChannel_2/PwmPeriodDefault - 16000.0 
/Pwm/PwmChannel_2/PwmPeriodInTicks - true 
/Pwm/PwmChannel_2/PwmPolarity - PWM_HIGH 
/Pwm/PwmChannel_3/PwmChannelId - 3 
/Pwm/PwmChannel_3/PwmDutycycleDefault - 0 
/Pwm/PwmChannel_3/PwmHwChannel - /Pwm/Pwm/PwmChannelConfigSet/PwmEmios_1/PwmEmiosChannels_20 
/Pwm/PwmChannel_3/PwmIdleState - PWM_LOW 
/Pwm/PwmChannel_3/PwmMcuClockReferencePoint - /Mcu/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/CORE_CLK 
/Pwm/PwmChannel_3/PwmNotification - PwmChannel_3_Callback 
/Pwm/PwmChannel_3/PwmPeriodDefault - 16000.0 
/Pwm/PwmChannel_3/PwmPeriodInTicks - true 
/Pwm/PwmChannel_3/PwmPolarity - PWM_HIGH 
/Pwm/PwmChannel_4/PwmChannelId - 4 
/Pwm/PwmChannel_4/PwmDutycycleDefault - 0 
/Pwm/PwmChannel_4/PwmHwChannel - /Pwm/Pwm/PwmChannelConfigSet/PwmEmios_1/PwmEmiosChannels_0 
/Pwm/PwmChannel_4/PwmIdleState - PWM_LOW 
/Pwm/PwmChannel_4/PwmMcuClockReferencePoint - /Mcu/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/CORE_CLK 
/Pwm/PwmChannel_4/PwmNotification - PwmChannel_4_Callback 
/Pwm/PwmChannel_4/PwmPeriodDefault - 16000.0 
/Pwm/PwmChannel_4/PwmPeriodInTicks - true 
/Pwm/PwmChannel_4/PwmPolarity - PWM_HIGH 
/Pwm/PwmChannel_5/PwmChannelId - 5 
/Pwm/PwmChannel_5/PwmDutycycleDefault - 0 
/Pwm/PwmChannel_5/PwmHwChannel - /Pwm/Pwm/PwmChannelConfigSet/PwmEmios_1/PwmEmiosChannels_1 
/Pwm/PwmChannel_5/PwmIdleState - PWM_LOW 
/Pwm/PwmChannel_5/PwmMcuClockReferencePoint - /Mcu/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/CORE_CLK 
/Pwm/PwmChannel_5/PwmNotification - PwmChannel_5_Callback 
/Pwm/PwmChannel_5/PwmPeriodDefault - 16000.0 
/Pwm/PwmChannel_5/PwmPeriodInTicks - true 
/Pwm/PwmChannel_5/PwmPolarity - PWM_HIGH 
/Pwm/PwmChannel_6/PwmChannelId - 6 
/Pwm/PwmChannel_6/PwmDutycycleDefault - 0 
/Pwm/PwmChannel_6/PwmHwChannel - /Pwm/Pwm/PwmChannelConfigSet/PwmEmios_1/PwmEmiosChannels_21 
/Pwm/PwmChannel_6/PwmIdleState - PWM_LOW 
/Pwm/PwmChannel_6/PwmMcuClockReferencePoint - /Mcu/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/CORE_CLK 
/Pwm/PwmChannel_6/PwmNotification - PwmChannel_6_Callback 
/Pwm/PwmChannel_6/PwmPeriodDefault - 16000.0 
/Pwm/PwmChannel_6/PwmPeriodInTicks - true 
/Pwm/PwmChannel_6/PwmPolarity - PWM_HIGH 
/Pwm/PwmChannel_7/PwmChannelId - 7 
/Pwm/PwmChannel_7/PwmDutycycleDefault - 0 
/Pwm/PwmChannel_7/PwmHwChannel - /Pwm/Pwm/PwmChannelConfigSet/PwmEmios_1/PwmEmiosChannels_22 
/Pwm/PwmChannel_7/PwmIdleState - PWM_LOW 
/Pwm/PwmChannel_7/PwmMcuClockReferencePoint - /Mcu/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/CORE_CLK 
/Pwm/PwmChannel_7/PwmNotification - PwmChannel_7_Callback 
/Pwm/PwmChannel_7/PwmPeriodDefault - 16000.0 
/Pwm/PwmChannel_7/PwmPeriodInTicks - true 
/Pwm/PwmChannel_7/PwmPolarity - PWM_HIGH 
/Pwm/PwmChannel_8/PwmChannelId - 8 
/Pwm/PwmChannel_8/PwmDutycycleDefault - 0 
/Pwm/PwmChannel_8/PwmHwChannel - /Pwm/Pwm/PwmChannelConfigSet/PwmEmios_2/PwmEmiosChannels_7 
/Pwm/PwmChannel_8/PwmIdleState - PWM_LOW 
/Pwm/PwmChannel_8/PwmMcuClockReferencePoint - /Mcu/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/CORE_CLK 
/Pwm/PwmChannel_8/PwmNotification - PwmChannel_8_Callback 
/Pwm/PwmChannel_8/PwmPeriodDefault - 40000 
/Pwm/PwmChannel_8/PwmPeriodInTicks - true 
/Pwm/PwmChannel_8/PwmPolarity - PWM_HIGH 
/Pwm/PwmConfigurationOfOptApiServices - PwmConfigurationOfOptApiServices 
/Pwm/PwmConfigurationOfOptApiServices/PwmDeInitApi - true 
/Pwm/PwmConfigurationOfOptApiServices/PwmEmiosFastUpdateApi - true 
/Pwm/PwmConfigurationOfOptApiServices/PwmEnableMaskOutputs - false 
/Pwm/PwmConfigurationOfOptApiServices/PwmGetChannelStateApi - true 
/Pwm/PwmConfigurationOfOptApiServices/PwmGetOutputState - true 
/Pwm/PwmConfigurationOfOptApiServices/PwmSetChannelDeadTime - true 
/Pwm/PwmConfigurationOfOptApiServices/PwmSetChannelOutputApi - true 
/Pwm/PwmConfigurationOfOptApiServices/PwmSetCounterBusApi - true 
/Pwm/PwmConfigurationOfOptApiServices/PwmSetDutyCycle - true 
/Pwm/PwmConfigurationOfOptApiServices/PwmSetDutyCycle_NoUpdate - false 
/Pwm/PwmConfigurationOfOptApiServices/PwmSetDutyPhaseShift - false 
/Pwm/PwmConfigurationOfOptApiServices/PwmSetOutputToIdle - true 
/Pwm/PwmConfigurationOfOptApiServices/PwmSetPeriodAndDuty - true 
/Pwm/PwmConfigurationOfOptApiServices/PwmSetPeriodAndDuty_NoUpdate - false 
/Pwm/PwmConfigurationOfOptApiServices/PwmSetTriggerDelayApi - true 
/Pwm/PwmConfigurationOfOptApiServices/PwmVersionInfoApi - true 
/Pwm/PwmEmios - PwmEmios_0 PwmEmios_1 PwmEmios_2 
/Pwm/PwmEmios_0/PwmEmiosChannels - PwmEmiosChannels_17 PwmEmiosChannels_9 
/Pwm/PwmEmios_0/PwmEmiosChannels_17/EmiosChCounterBus - EMIOS_PWM_IP_BUS_A 
/Pwm/PwmEmios_0/PwmEmiosChannels_17/EmiosChDeadtime - 0 
/Pwm/PwmEmios_0/PwmEmiosChannels_17/EmiosChFlagGeneration - Trailing_Edge 
/Pwm/PwmEmios_0/PwmEmiosChannels_17/EmiosChFreeze - false 
/Pwm/PwmEmios_0/PwmEmiosChannels_17/EmiosChId - CH_17 
/Pwm/PwmEmios_0/PwmEmiosChannels_17/EmiosChInterrupt - EMIOS_PWM_IP_INTERRUPT_REQUEST 
/Pwm/PwmEmios_0/PwmEmiosChannels_17/EmiosChMode - EMIOS_PWM_IP_MODE_OPWMB 
/Pwm/PwmEmios_0/PwmEmiosChannels_17/EmiosChOutputDisable - EMIOS_PWM_IP_OUTPUT_DISABLE_NONE 
/Pwm/PwmEmios_0/PwmEmiosChannels_17/EmiosChPhaseShift - 0 
/Pwm/PwmEmios_0/PwmEmiosChannels_17/EmiosChPrescaler - EMIOS_PWM_IP_CLOCK_DIV_2 
/Pwm/PwmEmios_0/PwmEmiosChannels_17/EmiosChPrescalerAlternate - EMIOS_PWM_IP_CLOCK_DIV_1 
/Pwm/PwmEmios_0/PwmEmiosChannels_17/EmiosChPrescalerSource - EMIOS_PWM_IP_PS_SRC_MODULE_CLOCK 
/Pwm/PwmEmios_0/PwmEmiosChannels_17/EmiosChTrigger - 0 
/Pwm/PwmEmios_0/PwmEmiosChannels_17/PwmEmiosBusRef - /Mcl/Mcl/MclConfig/EmiosCommon_0/EmiosMclMasterBus_0 
/Pwm/PwmEmios_0/PwmEmiosChannels_9/EmiosChCounterBus - EMIOS_PWM_IP_BUS_A 
/Pwm/PwmEmios_0/PwmEmiosChannels_9/EmiosChDeadtime - 0 
/Pwm/PwmEmios_0/PwmEmiosChannels_9/EmiosChFlagGeneration - Trailing_Edge 
/Pwm/PwmEmios_0/PwmEmiosChannels_9/EmiosChFreeze - false 
/Pwm/PwmEmios_0/PwmEmiosChannels_9/EmiosChId - CH_9 
/Pwm/PwmEmios_0/PwmEmiosChannels_9/EmiosChInterrupt - EMIOS_PWM_IP_INTERRUPT_REQUEST 
/Pwm/PwmEmios_0/PwmEmiosChannels_9/EmiosChMode - EMIOS_PWM_IP_MODE_OPWMB 
/Pwm/PwmEmios_0/PwmEmiosChannels_9/EmiosChOutputDisable - EMIOS_PWM_IP_OUTPUT_DISABLE_NONE 
/Pwm/PwmEmios_0/PwmEmiosChannels_9/EmiosChPhaseShift - 0 
/Pwm/PwmEmios_0/PwmEmiosChannels_9/EmiosChPrescaler - EMIOS_PWM_IP_CLOCK_DIV_1 
/Pwm/PwmEmios_0/PwmEmiosChannels_9/EmiosChPrescalerAlternate - EMIOS_PWM_IP_CLOCK_DIV_1 
/Pwm/PwmEmios_0/PwmEmiosChannels_9/EmiosChPrescalerSource - EMIOS_PWM_IP_PS_SRC_MODULE_CLOCK 
/Pwm/PwmEmios_0/PwmEmiosChannels_9/EmiosChTrigger - 0 
/Pwm/PwmEmios_0/PwmEmiosChannels_9/PwmEmiosBusRef - /Mcl/Mcl/MclConfig/EmiosCommon_0/EmiosMclMasterBus_0 
/Pwm/PwmEmios_0/PwmHwInstance - Emios_0 
/Pwm/PwmEmios_1/PwmEmiosChannels - PwmEmiosChannels_0 PwmEmiosChannels_1 PwmEmiosChannels_19 PwmEmiosChannels_20 PwmEmiosChannels_21 PwmEmiosChannels_22 
/Pwm/PwmEmios_1/PwmEmiosChannels_0/EmiosChCounterBus - EMIOS_PWM_IP_BUS_A 
/Pwm/PwmEmios_1/PwmEmiosChannels_0/EmiosChDeadtime - 0 
/Pwm/PwmEmios_1/PwmEmiosChannels_0/EmiosChFlagGeneration - Trailing_Edge 
/Pwm/PwmEmios_1/PwmEmiosChannels_0/EmiosChFreeze - false 
/Pwm/PwmEmios_1/PwmEmiosChannels_0/EmiosChId - CH_0 
/Pwm/PwmEmios_1/PwmEmiosChannels_0/EmiosChInterrupt - EMIOS_PWM_IP_INTERRUPT_REQUEST 
/Pwm/PwmEmios_1/PwmEmiosChannels_0/EmiosChMode - EMIOS_PWM_IP_MODE_OPWMB 
/Pwm/PwmEmios_1/PwmEmiosChannels_0/EmiosChOutputDisable - EMIOS_PWM_IP_OUTPUT_DISABLE_NONE 
/Pwm/PwmEmios_1/PwmEmiosChannels_0/EmiosChPhaseShift - 0 
/Pwm/PwmEmios_1/PwmEmiosChannels_0/EmiosChPrescaler - EMIOS_PWM_IP_CLOCK_DIV_1 
/Pwm/PwmEmios_1/PwmEmiosChannels_0/EmiosChPrescalerAlternate - EMIOS_PWM_IP_CLOCK_DIV_1 
/Pwm/PwmEmios_1/PwmEmiosChannels_0/EmiosChPrescalerSource - EMIOS_PWM_IP_PS_SRC_MODULE_CLOCK 
/Pwm/PwmEmios_1/PwmEmiosChannels_0/EmiosChTrigger - 0 
/Pwm/PwmEmios_1/PwmEmiosChannels_0/PwmEmiosBusRef - /Mcl/Mcl/MclConfig/EmiosCommon_1/EmiosMclMasterBus_0 
/Pwm/PwmEmios_1/PwmEmiosChannels_1/EmiosChCounterBus - EMIOS_PWM_IP_BUS_A 
/Pwm/PwmEmios_1/PwmEmiosChannels_1/EmiosChDeadtime - 0 
/Pwm/PwmEmios_1/PwmEmiosChannels_1/EmiosChFlagGeneration - Trailing_Edge 
/Pwm/PwmEmios_1/PwmEmiosChannels_1/EmiosChFreeze - false 
/Pwm/PwmEmios_1/PwmEmiosChannels_1/EmiosChId - CH_1 
/Pwm/PwmEmios_1/PwmEmiosChannels_1/EmiosChInterrupt - EMIOS_PWM_IP_INTERRUPT_REQUEST 
/Pwm/PwmEmios_1/PwmEmiosChannels_1/EmiosChMode - EMIOS_PWM_IP_MODE_OPWMB 
/Pwm/PwmEmios_1/PwmEmiosChannels_1/EmiosChOutputDisable - EMIOS_PWM_IP_OUTPUT_DISABLE_NONE 
/Pwm/PwmEmios_1/PwmEmiosChannels_1/EmiosChPhaseShift - 0 
/Pwm/PwmEmios_1/PwmEmiosChannels_1/EmiosChPrescaler - EMIOS_PWM_IP_CLOCK_DIV_1 
/Pwm/PwmEmios_1/PwmEmiosChannels_1/EmiosChPrescalerAlternate - EMIOS_PWM_IP_CLOCK_DIV_1 
/Pwm/PwmEmios_1/PwmEmiosChannels_1/EmiosChPrescalerSource - EMIOS_PWM_IP_PS_SRC_MODULE_CLOCK 
/Pwm/PwmEmios_1/PwmEmiosChannels_1/EmiosChTrigger - 0 
/Pwm/PwmEmios_1/PwmEmiosChannels_1/PwmEmiosBusRef - /Mcl/Mcl/MclConfig/EmiosCommon_1/EmiosMclMasterBus_0 
/Pwm/PwmEmios_1/PwmEmiosChannels_19/EmiosChCounterBus - EMIOS_PWM_IP_BUS_A 
/Pwm/PwmEmios_1/PwmEmiosChannels_19/EmiosChDeadtime - 0 
/Pwm/PwmEmios_1/PwmEmiosChannels_19/EmiosChFlagGeneration - Trailing_Edge 
/Pwm/PwmEmios_1/PwmEmiosChannels_19/EmiosChFreeze - false 
/Pwm/PwmEmios_1/PwmEmiosChannels_19/EmiosChId - CH_19 
/Pwm/PwmEmios_1/PwmEmiosChannels_19/EmiosChInterrupt - EMIOS_PWM_IP_INTERRUPT_REQUEST 
/Pwm/PwmEmios_1/PwmEmiosChannels_19/EmiosChMode - EMIOS_PWM_IP_MODE_OPWMB 
/Pwm/PwmEmios_1/PwmEmiosChannels_19/EmiosChOutputDisable - EMIOS_PWM_IP_OUTPUT_DISABLE_NONE 
/Pwm/PwmEmios_1/PwmEmiosChannels_19/EmiosChPhaseShift - 0 
/Pwm/PwmEmios_1/PwmEmiosChannels_19/EmiosChPrescaler - EMIOS_PWM_IP_CLOCK_DIV_1 
/Pwm/PwmEmios_1/PwmEmiosChannels_19/EmiosChPrescalerAlternate - EMIOS_PWM_IP_CLOCK_DIV_1 
/Pwm/PwmEmios_1/PwmEmiosChannels_19/EmiosChPrescalerSource - EMIOS_PWM_IP_PS_SRC_MODULE_CLOCK 
/Pwm/PwmEmios_1/PwmEmiosChannels_19/EmiosChTrigger - 0 
/Pwm/PwmEmios_1/PwmEmiosChannels_19/PwmEmiosBusRef - /Mcl/Mcl/MclConfig/EmiosCommon_1/EmiosMclMasterBus_0 
/Pwm/PwmEmios_1/PwmEmiosChannels_20/EmiosChCounterBus - EMIOS_PWM_IP_BUS_A 
/Pwm/PwmEmios_1/PwmEmiosChannels_20/EmiosChDeadtime - 0 
/Pwm/PwmEmios_1/PwmEmiosChannels_20/EmiosChFlagGeneration - Trailing_Edge 
/Pwm/PwmEmios_1/PwmEmiosChannels_20/EmiosChFreeze - false 
/Pwm/PwmEmios_1/PwmEmiosChannels_20/EmiosChId - CH_20 
/Pwm/PwmEmios_1/PwmEmiosChannels_20/EmiosChInterrupt - EMIOS_PWM_IP_INTERRUPT_REQUEST 
/Pwm/PwmEmios_1/PwmEmiosChannels_20/EmiosChMode - EMIOS_PWM_IP_MODE_OPWMB 
/Pwm/PwmEmios_1/PwmEmiosChannels_20/EmiosChOutputDisable - EMIOS_PWM_IP_OUTPUT_DISABLE_NONE 
/Pwm/PwmEmios_1/PwmEmiosChannels_20/EmiosChPhaseShift - 0 
/Pwm/PwmEmios_1/PwmEmiosChannels_20/EmiosChPrescaler - EMIOS_PWM_IP_CLOCK_DIV_1 
/Pwm/PwmEmios_1/PwmEmiosChannels_20/EmiosChPrescalerAlternate - EMIOS_PWM_IP_CLOCK_DIV_1 
/Pwm/PwmEmios_1/PwmEmiosChannels_20/EmiosChPrescalerSource - EMIOS_PWM_IP_PS_SRC_MODULE_CLOCK 
/Pwm/PwmEmios_1/PwmEmiosChannels_20/EmiosChTrigger - 0 
/Pwm/PwmEmios_1/PwmEmiosChannels_20/PwmEmiosBusRef - /Mcl/Mcl/MclConfig/EmiosCommon_1/EmiosMclMasterBus_0 
/Pwm/PwmEmios_1/PwmEmiosChannels_21/EmiosChCounterBus - EMIOS_PWM_IP_BUS_A 
/Pwm/PwmEmios_1/PwmEmiosChannels_21/EmiosChDeadtime - 0 
/Pwm/PwmEmios_1/PwmEmiosChannels_21/EmiosChFlagGeneration - Trailing_Edge 
/Pwm/PwmEmios_1/PwmEmiosChannels_21/EmiosChFreeze - false 
/Pwm/PwmEmios_1/PwmEmiosChannels_21/EmiosChId - CH_21 
/Pwm/PwmEmios_1/PwmEmiosChannels_21/EmiosChInterrupt - EMIOS_PWM_IP_INTERRUPT_REQUEST 
/Pwm/PwmEmios_1/PwmEmiosChannels_21/EmiosChMode - EMIOS_PWM_IP_MODE_OPWMB 
/Pwm/PwmEmios_1/PwmEmiosChannels_21/EmiosChOutputDisable - EMIOS_PWM_IP_OUTPUT_DISABLE_NONE 
/Pwm/PwmEmios_1/PwmEmiosChannels_21/EmiosChPhaseShift - 0 
/Pwm/PwmEmios_1/PwmEmiosChannels_21/EmiosChPrescaler - EMIOS_PWM_IP_CLOCK_DIV_1 
/Pwm/PwmEmios_1/PwmEmiosChannels_21/EmiosChPrescalerAlternate - EMIOS_PWM_IP_CLOCK_DIV_1 
/Pwm/PwmEmios_1/PwmEmiosChannels_21/EmiosChPrescalerSource - EMIOS_PWM_IP_PS_SRC_MODULE_CLOCK 
/Pwm/PwmEmios_1/PwmEmiosChannels_21/EmiosChTrigger - 0 
/Pwm/PwmEmios_1/PwmEmiosChannels_21/PwmEmiosBusRef - /Mcl/Mcl/MclConfig/EmiosCommon_1/EmiosMclMasterBus_0 
/Pwm/PwmEmios_1/PwmEmiosChannels_22/EmiosChCounterBus - EMIOS_PWM_IP_BUS_A 
/Pwm/PwmEmios_1/PwmEmiosChannels_22/EmiosChDeadtime - 0 
/Pwm/PwmEmios_1/PwmEmiosChannels_22/EmiosChFlagGeneration - Trailing_Edge 
/Pwm/PwmEmios_1/PwmEmiosChannels_22/EmiosChFreeze - false 
/Pwm/PwmEmios_1/PwmEmiosChannels_22/EmiosChId - CH_22 
/Pwm/PwmEmios_1/PwmEmiosChannels_22/EmiosChInterrupt - EMIOS_PWM_IP_INTERRUPT_REQUEST 
/Pwm/PwmEmios_1/PwmEmiosChannels_22/EmiosChMode - EMIOS_PWM_IP_MODE_OPWMB 
/Pwm/PwmEmios_1/PwmEmiosChannels_22/EmiosChOutputDisable - EMIOS_PWM_IP_OUTPUT_DISABLE_NONE 
/Pwm/PwmEmios_1/PwmEmiosChannels_22/EmiosChPhaseShift - 0 
/Pwm/PwmEmios_1/PwmEmiosChannels_22/EmiosChPrescaler - EMIOS_PWM_IP_CLOCK_DIV_1 
/Pwm/PwmEmios_1/PwmEmiosChannels_22/EmiosChPrescalerAlternate - EMIOS_PWM_IP_CLOCK_DIV_1 
/Pwm/PwmEmios_1/PwmEmiosChannels_22/EmiosChPrescalerSource - EMIOS_PWM_IP_PS_SRC_MODULE_CLOCK 
/Pwm/PwmEmios_1/PwmEmiosChannels_22/EmiosChTrigger - 0 
/Pwm/PwmEmios_1/PwmEmiosChannels_22/PwmEmiosBusRef - /Mcl/Mcl/MclConfig/EmiosCommon_1/EmiosMclMasterBus_0 
/Pwm/PwmEmios_1/PwmHwInstance - Emios_1 
/Pwm/PwmEmios_2/PwmEmiosChannels - PwmEmiosChannels_7 
/Pwm/PwmEmios_2/PwmEmiosChannels_7/EmiosChCounterBus - EMIOS_PWM_IP_BUS_A 
/Pwm/PwmEmios_2/PwmEmiosChannels_7/EmiosChDeadtime - 0 
/Pwm/PwmEmios_2/PwmEmiosChannels_7/EmiosChFlagGeneration - Trailing_Edge 
/Pwm/PwmEmios_2/PwmEmiosChannels_7/EmiosChFreeze - false 
/Pwm/PwmEmios_2/PwmEmiosChannels_7/EmiosChId - CH_7 
/Pwm/PwmEmios_2/PwmEmiosChannels_7/EmiosChInterrupt - EMIOS_PWM_IP_INTERRUPT_REQUEST 
/Pwm/PwmEmios_2/PwmEmiosChannels_7/EmiosChMode - EMIOS_PWM_IP_MODE_OPWMB 
/Pwm/PwmEmios_2/PwmEmiosChannels_7/EmiosChOutputDisable - EMIOS_PWM_IP_OUTPUT_DISABLE_NONE 
/Pwm/PwmEmios_2/PwmEmiosChannels_7/EmiosChPhaseShift - 0 
/Pwm/PwmEmios_2/PwmEmiosChannels_7/EmiosChPrescaler - EMIOS_PWM_IP_CLOCK_DIV_2 
/Pwm/PwmEmios_2/PwmEmiosChannels_7/EmiosChPrescalerAlternate - EMIOS_PWM_IP_CLOCK_DIV_2 
/Pwm/PwmEmios_2/PwmEmiosChannels_7/EmiosChPrescalerSource - EMIOS_PWM_IP_PS_SRC_MODULE_CLOCK 
/Pwm/PwmEmios_2/PwmEmiosChannels_7/EmiosChTrigger - 0 
/Pwm/PwmEmios_2/PwmEmiosChannels_7/PwmEmiosBusRef - /Mcl/Mcl/MclConfig/EmiosCommon_2/EmiosMclMasterBus_0 
/Pwm/PwmEmios_2/PwmHwInstance - Emios_2 
/Pwm/PwmGeneral - PwmGeneral 
/Pwm/PwmGeneral/PwmDevErrorDetect - true 
/Pwm/PwmGeneral/PwmDutycycleUpdatedEndperiod - false 
/Pwm/PwmGeneral/PwmEnableDualClockMode - false 
/Pwm/PwmGeneral/PwmEnableUserModeSupport - false 
/Pwm/PwmGeneral/PwmIndex - 0 
/Pwm/PwmGeneral/PwmMultiChannelSync - false 
/Pwm/PwmGeneral/PwmMulticoreEnabled - false 
/Pwm/PwmGeneral/PwmNotificationSupported - true 
/Pwm/PwmGeneral/PwmPeriodUpdatedEndperiod - true 

