Caler10/RBCM_S32K344_AUTOSAR_MBD/Firmware/S32K344_DAPlink/S32K344_LED/S32K344_LED_ert_rtw/MW_target_hardware_resources.h
*/
#define MW_DETAILS_PWM 
#define MW_OPEN_PWM 
#define MW_UPDATE_PWM 
#define MW_RESTORE_PWM 
#define MW_SPI_INFO /*
/Spi - Spi 
/Spi/CommonPublishedInformation - CommonPublishedInformation 
/Spi/CommonPublishedInformation/ArReleaseMajorVersion - 4 
/Spi/CommonPublishedInformation/ArReleaseMinorVersion - 4 
/Spi/CommonPublishedInformation/ArReleaseRevisionVersion - 0 
/Spi/CommonPublishedInformation/ModuleId - 83 
/Spi/CommonPublishedInformation/SwMajorVersion - 2 
/Spi/CommonPublishedInformation/SwMinorVersion - 0 
/Spi/CommonPublishedInformation/SwPatchVersion - 0 
/Spi/CommonPublishedInformation/VendorId - 43 
/Spi/IMPLEMENTATION-CONFIG-VARIANT - VARIANT-POST-BUILD 
/Spi/POST_BUILD_VARIANT_USED - true 
/Spi/SpiAutosarExt - SpiAutosarExt 
/Spi/SpiAutosarExt/SpiAllowBigSizeCollections - false 
/Spi/SpiAutosarExt/SpiDisableDemReportErrorStatus - false 
/Spi/SpiAutosarExt/SpiEnableDmaContMemTransferSupport - false 
/Spi/SpiAutosarExt/SpiEnableDmaFastTransferSupport - false 
/Spi/SpiAutosarExt/SpiEnableHWUnitAsyncMode - false 
/Spi/SpiAutosarExt/SpiEnableUserModeSupport - false 
/Spi/SpiAutosarExt/SpiFlexioEnable - false 
/Spi/SpiAutosarExt/SpiHREQSupport - false 
/Spi/SpiAutosarExt/SpiHalfDuplexModeSupport - false 
/Spi/SpiAutosarExt/SpiJobStartNotificationEnable - false 
/Spi/SpiDriver - SpiDriver 
/Spi/SpiDriver/SpiChannel - SpiChannel_0 SpiChannel_1 
/Spi/SpiDriver/SpiChannel_0/SpiByteSwapTransfer - false 
/Spi/SpiDriver/SpiChannel_0/SpiChannelId - 0 
/Spi/SpiDriver/SpiChannel_0/SpiChannelType - EB 
/Spi/SpiDriver/SpiChannel_0/SpiDataWidth - 8 
/Spi/SpiDriver/SpiChannel_0/SpiEbMaxLength - 1000 
/Spi/SpiDriver/SpiChannel_0/SpiIbNBuffers - 1 
/Spi/SpiDriver/SpiChannel_0/SpiTransferStart - MSB 
/Spi/SpiDriver/SpiChannel_1/SpiByteSwapTransfer - false 
/Spi/SpiDriver/SpiChannel_1/SpiChannelId - 1 
/Spi/SpiDriver/SpiChannel_1/SpiChannelType - IB 
/Spi/SpiDriver/SpiChannel_1/SpiDataWidth - 8 
/Spi/SpiDriver/SpiChannel_1/SpiEbMaxLength - 1000 
/Spi/SpiDriver/SpiChannel_1/SpiIbNBuffers - 1 
/Spi/SpiDriver/SpiChannel_1/SpiTransferStart - MSB 
/Spi/SpiDriver/SpiExternalDevice - SpiExternalDevice_0 SpiExternalDevice_1 
/Spi/SpiDriver/SpiExternalDevice_0/SpiBaudrate - 500000.0 
/Spi/SpiDriver/SpiExternalDevice_0/SpiCsBehavior - CS_KEEP_ASSERTED 
/Spi/SpiDriver/SpiExternalDevice_0/SpiCsIdentifier - PCS0 
/Spi/SpiDriver/SpiExternalDevice_0/SpiCsPolarity - LOW 
/Spi/SpiDriver/SpiExternalDevice_0/SpiCsSelection - CS_VIA_PERIPHERAL_ENGINE 
/Spi/SpiDriver/SpiExternalDevice_0/SpiDataShiftEdge - LEADING 
/Spi/SpiDriver/SpiExternalDevice_0/SpiDeviceHalfDuplexSupport - false 
/Spi/SpiDriver/SpiExternalDevice_0/SpiEnableCs - true 
/Spi/SpiDriver/SpiExternalDevice_0/SpiHalfDuplexPinSelect - HALF_DUPLEX_SIN 
/Spi/SpiDriver/SpiExternalDevice_0/SpiHostRequest - DISABLE 
/Spi/SpiDriver/SpiExternalDevice_0/SpiHwUnit - CSIB0 
/Spi/SpiDriver/SpiExternalDevice_0/SpiShiftClockIdleLevel - LOW 
/Spi/SpiDriver/SpiExternalDevice_0/SpiTimeClk2Cs - 2.0E-7 
/Spi/SpiDriver/SpiExternalDevice_0/SpiTimeCs2Clk - 2.0E-7 
/Spi/SpiDriver/SpiExternalDevice_0/SpiTimeCs2Cs - 4.0E-7 
/Spi/SpiDriver/SpiExternalDevice_0/SpiTransferWidth - TRANSFER_1_BIT 
/Spi/SpiDriver/SpiExternalDevice_0/SpiUseBaudrateConfig - false 
/Spi/SpiDriver/SpiExternalDevice_1/SpiBaudrate - 500000.0 
/Spi/SpiDriver/SpiExternalDevice_1/SpiCsBehavior - CS_KEEP_ASSERTED 
/Spi/SpiDriver/SpiExternalDevice_1/SpiCsIdentifier - PCS3 
/Spi/SpiDriver/SpiExternalDevice_1/SpiCsPolarity - LOW 
/Spi/SpiDriver/SpiExternalDevice_1/SpiCsSelection - CS_VIA_PERIPHERAL_ENGINE 
/Spi/SpiDriver/SpiExternalDevice_1/SpiDataShiftEdge - LEADING 
/Spi/SpiDriver/SpiExternalDevice_1/SpiDeviceHalfDuplexSupport - false 
/Spi/SpiDriver/SpiExternalDevice_1/SpiEnableCs - true 
/Spi/SpiDriver/SpiExternalDevice_1/SpiHalfDuplexPinSelect - HALF_DUPLEX_SIN 
/Spi/SpiDriver/SpiExternalDevice_1/SpiHostRequest - DISABLE 
/Spi/SpiDriver/SpiExternalDevice_1/SpiHwUnit - CSIB1 
/Spi/SpiDriver/SpiExternalDevice_1/SpiShiftClockIdleLevel - LOW 
/Spi/SpiDriver/SpiExternalDevice_1/SpiTimeClk2Cs - 2.0E-7 
/Spi/SpiDriver/SpiExternalDevice_1/SpiTimeCs2Clk - 2.0E-7 
/Spi/SpiDriver/SpiExternalDevice_1/SpiTimeCs2Cs - 4.0E-7 
/Spi/SpiDriver/SpiExternalDevice_1/SpiTransferWidth - TRANSFER_1_BIT 
/Spi/SpiDriver/SpiExternalDevice_1/SpiUseBaudrateConfig - false 
/Spi/SpiDriver/SpiJob - SpiJob_0 SpiJob_1 
/Spi/SpiDriver/SpiJob_0/SpiChannelList - SpiChannelList_0 
/Spi/SpiDriver/SpiJob_0/SpiChannelList_0/SpiChannelAssignment - /Spi/Spi/SpiDriver/SpiChannel_0 
/Spi/SpiDriver/SpiJob_0/SpiChannelList_0/SpiChannelIndex - 0 
/Spi/SpiDriver/SpiJob_0/SpiDeviceAssignment - /Spi/Spi/SpiDriver/SpiExternalDevice_0 
/Spi/SpiDriver/SpiJob_0/SpiJobEndNotification - MBDT_SPI_end_job0_callback 
/Spi/SpiDriver/SpiJob_0/SpiJobId - 0 
/Spi/SpiDriver/SpiJob_0/SpiJobPriority - 0 
/Spi/SpiDriver/SpiJob_1/SpiChannelList - SpiChannelList_0 
/Spi/SpiDriver/SpiJob_1/SpiChannelList_0/SpiChannelAssignment - /Spi/Spi/SpiDriver/SpiChannel_1 
/Spi/SpiDriver/SpiJob_1/SpiChannelList_0/SpiChannelIndex - 0 
/Spi/SpiDriver/SpiJob_1/SpiDeviceAssignment - /Spi/Spi/SpiDriver/SpiExternalDevice_1 
/Spi/SpiDriver/SpiJob_1/SpiJobId - 1 
/Spi/SpiDriver/SpiJob_1/SpiJobPriority - 0 
/Spi/SpiDriver/SpiSequence - SpiSequence_0 SpiSequence_1 
/Spi/SpiDriver/SpiSequence_0/SpiDmaContMemTransferSequenceEnable - false 
/Spi/SpiDriver/SpiSequence_0/SpiEnableDmaFastTransfer - false 
/Spi/SpiDriver/SpiSequence_0/SpiInterruptibleSequence - false 
/Spi/SpiDriver/SpiSequence_0/SpiJobAssignment - /Spi/Spi/SpiDriver/SpiJob_0 
/Spi/SpiDriver/SpiSequence_0/SpiSequenceId - 0 
/Spi/SpiDriver/SpiSequence_1/SpiDmaContMemTransferSequenceEnable - false 
/Spi/SpiDriver/SpiSequence_1/SpiEnableDmaFastTransfer - false 
/Spi/SpiDriver/SpiSequence_1/SpiInterruptibleSequence - false 
/Spi/SpiDriver/SpiSequence_1/SpiJobAssignment - /Spi/Spi/SpiDriver/SpiJob_1 
/Spi/SpiDriver/SpiSequence_1/SpiSeqEndNotification - MBDT_SPI_end_sequence1_callback 
/Spi/SpiDriver/SpiSequence_1/SpiSequenceId - 1 
/Spi/SpiGeneral - SpiGeneral 
/Spi/SpiGeneral/SpiCancelApi - true 
/Spi/SpiGeneral/SpiChannelBuffersAllowed - 2 
/Spi/SpiGeneral/SpiDevErrorDetect - true 
/Spi/SpiGeneral/SpiGlobalDmaEnable - false 
/Spi/SpiGeneral/SpiHwStatusApi - true 
/Spi/SpiGeneral/SpiInterruptibleSeqAllowed - true 
/Spi/SpiGeneral/SpiLevelDelivered - 2 
/Spi/SpiGeneral/SpiMulticoreSupport - false 
/Spi/SpiGeneral/SpiPhyUnit - SpiPhyUnit_0 SpiPhyUnit_1 
/Spi/SpiGeneral/SpiPhyUnit_0/SpiPhyUnitAsyncUseDma - false 
/Spi/SpiGeneral/SpiPhyUnit_0/SpiPhyUnitClockRef - /Mcu/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/SPI_CLK 
/Spi/SpiGeneral/SpiPhyUnit_0/SpiPhyUnitMapping - LPSPI_2 
/Spi/SpiGeneral/SpiPhyUnit_0/SpiPhyUnitMode - SPI_MASTER 
/Spi/SpiGeneral/SpiPhyUnit_0/SpiPhyUnitSync - false 
/Spi/SpiGeneral/SpiPhyUnit_0/SpiPinConfiguration - 0 
/Spi/SpiGeneral/SpiPhyUnit_0/SpiSamplePoint - 0 
/Spi/SpiGeneral/SpiPhyUnit_1/SpiPhyUnitAsyncUseDma - false 
/Spi/SpiGeneral/SpiPhyUnit_1/SpiPhyUnitClockRef - /Mcu/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/SPI_CLK 
/Spi/SpiGeneral/SpiPhyUnit_1/SpiPhyUnitMapping - LPSPI_1 
/Spi/SpiGeneral/SpiPhyUnit_1/SpiPhyUnitMode - SPI_SLAVE 
/Spi/SpiGeneral/SpiPhyUnit_1/SpiPhyUnitSync - false 
/Spi/SpiGeneral/SpiPhyUnit_1/SpiPinConfiguration - 0 
/Spi/SpiGeneral/SpiPhyUnit_1/SpiSamplePoint - 0 
/Spi/SpiGeneral/SpiSupportConcurrentSyncTransmit - false 
/Spi/SpiGeneral/SpiTimeoutMethod - OSIF_COUNTER_DUMMY 
/Spi/SpiGeneral/SpiTransmitTimeout - 50000 
/Spi/SpiGeneral/SpiVersionInfoApi - true 
/Spi/SpiPublishedInformation - SpiPublishedInformation 
/Spi/SpiPublishedInformation/SpiMaxHwUnit - 0 

*/
#define MW_DETAILS_SPI 
#define MW_OPEN_SPI 
#define MW_UPDATE_SPI 
#define MW_RESTORE_SPI 
#define MW_UART_INFO /*
/Uart/Uart - Uart 
/Uart/Uart/CommonPublishedInformation - CommonPublishedInformation 
/Uart/Uart/CommonPublishedInformation/ArReleaseMajorVersion - 4 
/Uart/Uart/CommonPublishedInformation/ArReleaseMinorVersion - 4 
/Uart/Uart/CommonPublishedInformation/ArReleaseRevisionVersion - 0 
/Uart/Uart/CommonPublishedInformation/ModuleId - 255 
/Uart/Uart/CommonPublishedInformation/SwMajorVersion - 2 
/Uart/Uart/CommonPublishedInformation/SwMinorVersion - 0 
/Uart/Uart/CommonPublishedInformation/SwPatchVersion - 0 
/Uart/Uart/CommonPublishedInformation/VendorApiInfix -  
/Uart/Uart/CommonPublishedInformation/VendorId - 43 
/Uart/Uart/GeneralConfiguration - GeneralConfiguration 
/Uart/Uart/GeneralConfiguration/DisableUartRuntimeErrorDetect - false 
/Uart/Uart/GeneralConfiguration/UartCallback - MBDT_Uart_Callback 
/Uart/Uart/GeneralConfiguration/UartCallbackCapability - true 
/Uart/Uart/GeneralConfiguration/UartDevErrorDetect - true 
/Uart/Uart/GeneralConfiguration/UartDmaEnable - false 
/Uart/Uart/GeneralConfiguration/UartEnableUserModeSupport - false 
/Uart/Uart/GeneralConfiguration/UartMulticoreSupport - false 
/Uart/Uart/GeneralConfiguration/UartTimeoutDuration - 1000 
/Uart/Uart/GeneralConfiguration/UartTimeoutMethod - OSIF_COUNTER_SYSTEM 
/Uart/Uart/GeneralConfiguration/UartVersionInfoApi - true 
/Uart/Uart/IMPLEMENTATION-CONFIG-VARIANT - VARIANT-POST-BUILD 
/Uart/Uart/POST_BUILD_VARIANT_USED - true 
/Uart/Uart/UartGlobalConfig - UartGlobalConfig 
/Uart/Uart/UartGlobalConfig/UartChannel - UartChannel_0 UartChannel_1 
/Uart/Uart/UartGlobalConfig/UartChannel_0//CustomBaudrateDivider - 0 
/Uart/Uart/UartGlobalConfig/UartChannel_0//CustomTimerDecrement - FLEXIO_TIMER_DECREMENT_FXIO_CLK_SHIFT_TMR 
/Uart/Uart/UartGlobalConfig/UartChannel_0//DesireBaudrate - FLEXIO_UART_BAUDRATE_1200 
/Uart/Uart/UartGlobalConfig/UartChannel_0//FlexioUartInteruptDmaMethod - FLEXIO_UART_IP_DRIVER_TYPE_INTERRUPTS 
/Uart/Uart/UartGlobalConfig/UartChannel_0//UartHwChannelRef -  
/Uart/Uart/UartGlobalConfig/UartChannel_0//bitCount - FLEXIO_UART_IP_8_BITS_PER_CHAR 
/Uart/Uart/UartGlobalConfig/UartChannel_0//driverDirection - FLEXIO_UART_IP_DIRECTION_TX 
/Uart/Uart/UartGlobalConfig/UartChannel_0/DetailModuleConfiguration - DetailModuleConfiguration 
/Uart/Uart/UartGlobalConfig/UartChannel_0/DetailModuleConfiguration/CustomBaudrateDivisor - 4 
/Uart/Uart/UartGlobalConfig/UartChannel_0/DetailModuleConfiguration/CustomBaudrateMantissa - 1 
/Uart/Uart/UartGlobalConfig/UartChannel_0/DetailModuleConfiguration/DesireBaudrate - LPUART_UART_BAUDRATE_115200 
/Uart/Uart/UartGlobalConfig/UartChannel_0/DetailModuleConfiguration/UartHwChannel - LPUART_6 
/Uart/Uart/UartGlobalConfig/UartChannel_0/DetailModuleConfiguration/UartInternalLoopbackEnable - false 
/Uart/Uart/UartGlobalConfig/UartChannel_0/DetailModuleConfiguration/UartInteruptDmaMethod - LPUART_UART_IP_USING_INTERRUPTS 
/Uart/Uart/UartGlobalConfig/UartChannel_0/DetailModuleConfiguration/UartParityType - LPUART_UART_IP_PARITY_DISABLED 
/Uart/Uart/UartGlobalConfig/UartChannel_0/DetailModuleConfiguration/UartStopBitNumber - LPUART_UART_IP_ONE_STOP_BIT 
/Uart/Uart/UartGlobalConfig/UartChannel_0/DetailModuleConfiguration/UartTimeoutEnable - false 
/Uart/Uart/UartGlobalConfig/UartChannel_0/DetailModuleConfiguration/UartWordLength - LPUART_UART_IP_8_BITS_PER_CHAR 
/Uart/Uart/UartGlobalConfig/UartChannel_0/FlexioModuleConfiguration -  
/Uart/Uart/UartGlobalConfig/UartChannel_0/UartChannelId - 0 
/Uart/Uart/UartGlobalConfig/UartChannel_0/UartClockRef - /Mcu/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/UART_CLK 
/Uart/Uart/UartGlobalConfig/UartChannel_0/UartHwUsing - LPUART_IP 
/Uart/Uart/UartGlobalConfig/UartChannel_1//CustomBaudrateDivider - 0 
/Uart/Uart/UartGlobalConfig/UartChannel_1//CustomTimerDecrement - FLEXIO_TIMER_DECREMENT_FXIO_CLK_SHIFT_TMR 
/Uart/Uart/UartGlobalConfig/UartChannel_1//DesireBaudrate - FLEXIO_UART_BAUDRATE_1200 
/Uart/Uart/UartGlobalConfig/UartChannel_1//FlexioUartInteruptDmaMethod - FLEXIO_UART_IP_DRIVER_TYPE_INTERRUPTS 
/Uart/Uart/UartGlobalConfig/UartChannel_1//UartHwChannelRef -  
/Uart/Uart/UartGlobalConfig/UartChannel_1//bitCount - FLEXIO_UART_IP_8_BITS_PER_CHAR 
/Uart/Uart/UartGlobalConfig/UartChannel_1//driverDirection - FLEXIO_UART_IP_DIRECTION_TX 
/Uart/Uart/UartGlobalConfig/UartChannel_1/DetailModuleConfiguration - DetailModuleConfiguration 
/Uart/Uart/UartGlobalConfig/UartChannel_1/DetailModuleConfiguration/CustomBaudrateDivisor - 4 
/Uart/Uart/UartGlobalConfig/UartChannel_1/DetailModuleConfiguration/CustomBaudrateMantissa - 1 
/Uart/Uart/UartGlobalConfig/UartChannel_1/DetailModuleConfiguration/DesireBaudrate - LPUART_UART_BAUDRATE_115200 
/Uart/Uart/UartGlobalConfig/UartChannel_1/DetailModuleConfiguration/UartHwChannel - LPUART_13 
/Uart/Uart/UartGlobalConfig/UartChannel_1/DetailModuleConfiguration/UartInternalLoopbackEnable - false 
/Uart/Uart/UartGlobalConfig/UartChannel_1/DetailModuleConfiguration/UartInteruptDmaMethod - LPUART_UART_IP_USING_INTERRUPTS 
/Uart/Uart/UartGlobalConfig/UartChannel_1/DetailModuleConfiguration/UartParityType - LPUART_UART_IP_PARITY_DISABLED 
/Uart/Uart/UartGlobalConfig/UartChannel_1/DetailModuleConfiguration/UartStopBitNumber - LPUART_UART_IP_ONE_STOP_BIT 
/Uart/Uart/UartGlobalConfig/UartChannel_1/DetailModuleConfiguration/UartTimeoutEnable - false 
/Uart/Uart/UartGlobalConfig/UartChannel_1/DetailModuleConfiguration/UartWordLength - LPUART_UART_IP_8_BITS_PER_CHAR 
/Uart/Uart/UartGlobalConfig/UartChannel_1/FlexioModuleConfiguration -  
/Uart/Uart/UartGlobalConfig/UartChannel_1/UartChannelId - 1 
/Uart/Uart/UartGlobalConfig/UartChannel_1/UartClockRef - /Mcu/Mcu/McuModuleConfiguration/McuClockSettingConfig_0/UART_CLK 
/Uart/Uart/UartGlobalConfig/UartChannel_1/UartHwUsing - LPUART_IP 

*/
#define MW_DETAILS_UART 
#define MW_OPEN_UART 
#define MW_UPDATE_UART 
#define MW_RESTORE_UART 
#define MW_DIAGNOSTICS_ENABLEMODELCHECKS 49
#define MW_DIAGNOSTICS_ENABLEPROFILERCHECKS 49
#define MW_DATAVERSION 2016.02

#endif /* __MW_TARGET_HARDWARE_RESOURCES_H__ */

#endif

#endif
